#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_Ranged_Weapon.ABP_Ranged_Weapon_C
// 0x64C9 (FullSize[0x6781] - InheritedSize[0x02B8])
class UABP_Ranged_Weapon_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_O4GI[0x8];                                     // 0x02B8(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x02C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x02C8(0x0030)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum;                             // 0x02F8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_18;                           // 0x03A8(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_17;                           // 0x0500(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_22;                            // 0x0658(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_21;                            // 0x0680(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_16;                           // 0x06A8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_20;                            // 0x0800(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_62;                        // 0x0828(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_61;                        // 0x0878(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_49;                          // 0x08C8(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_60;                        // 0x0968(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_59;                        // 0x09B8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_48;                          // 0x0A08(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_47;                          // 0x0AA8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_15;                              // 0x0B48(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_15;                             // 0x0B78(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_19;                            // 0x0C28(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_15;                           // 0x0C50(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_14;                           // 0x0DA8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_18;                            // 0x0F00(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_58;                        // 0x0F28(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_57;                        // 0x0F78(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_56;                        // 0x0FC8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_55;                        // 0x1018(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_54;                        // 0x1068(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_46;                          // 0x10B8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_45;                          // 0x1158(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_44;                          // 0x11F8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_43;                          // 0x1298(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_14;                              // 0x1338(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_14;                             // 0x1368(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4;                                // 0x1418(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2;                     // 0x1520(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2;                     // 0x1540(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3;                                // 0x1560(0x0108)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_53;                        // 0x1668(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_52;                        // 0x16B8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_42;                          // 0x1708(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_51;                        // 0x17A8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_50;                        // 0x17F8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_41;                          // 0x1848(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_40;                          // 0x18E8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_13;                              // 0x1988(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_13;                             // 0x19B8(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2;                                // 0x1A68(0x0108)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_49;                        // 0x1B70(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_48;                        // 0x1BC0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_39;                          // 0x1C10(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_47;                        // 0x1CB0(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_46;                        // 0x1D00(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_38;                          // 0x1D50(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_37;                          // 0x1DF0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12;                              // 0x1E90(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_12;                             // 0x1EC0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_36;                          // 0x1F70(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_13;                           // 0x2010(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_17;                            // 0x2168(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_16;                            // 0x2190(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_5;                                      // 0x21B8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_4;                                      // 0x2200(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_15;                            // 0x2248(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_12;                           // 0x2270(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_14;                            // 0x23C8(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_45;                        // 0x23F0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_35;                          // 0x2440(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_44;                        // 0x24E0(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_43;                        // 0x2530(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_42;                        // 0x2580(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_41;                        // 0x25D0(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_40;                        // 0x2620(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_34;                          // 0x2670(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_33;                          // 0x2710(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_32;                          // 0x27B0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_31;                          // 0x2850(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_11;                              // 0x28F0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_11;                             // 0x2920(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_11;                           // 0x29D0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_13;                            // 0x2B28(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_39;                        // 0x2B50(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_38;                        // 0x2BA0(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_37;                        // 0x2BF0(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_36;                        // 0x2C40(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_35;                        // 0x2C90(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_30;                          // 0x2CE0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_29;                          // 0x2D80(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_28;                          // 0x2E20(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_27;                          // 0x2EC0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_10;                              // 0x2F60(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_10;                             // 0x2F90(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_10;                           // 0x3040(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_12;                            // 0x3198(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_34;                        // 0x31C0(0x0050)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                               // 0x3210(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9;                              // 0x3240(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9;                            // 0x32F0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_11;                            // 0x3448(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2;                          // 0x3470(0x00C0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_33;                        // 0x3530(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_32;                        // 0x3580(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_31;                        // 0x35D0(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_30;                        // 0x3620(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_29;                        // 0x3670(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_26;                          // 0x36C0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_25;                          // 0x3760(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_24;                          // 0x3800(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                               // 0x38A0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8;                              // 0x38D0(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8;                            // 0x3980(0x0158)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_28;                        // 0x3AD8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_27;                        // 0x3B28(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_23;                          // 0x3B78(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_26;                        // 0x3C18(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_25;                        // 0x3C68(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_22;                          // 0x3CB8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_21;                          // 0x3D58(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                               // 0x3DF8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7;                              // 0x3E28(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7;                            // 0x3ED8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_10;                            // 0x4030(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_24;                        // 0x4058(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_23;                        // 0x40A8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_20;                          // 0x40F8(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_22;                        // 0x4198(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_19;                          // 0x41E8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_18;                          // 0x4288(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_21;                        // 0x4328(0x0050)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                               // 0x4378(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6;                              // 0x43A8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6;                            // 0x4458(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9;                             // 0x45B0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_17;                          // 0x45D8(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_3;                                      // 0x4678(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8;                             // 0x46C0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend;                            // 0x46E8(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5;                            // 0x47A8(0x0158)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2;                                      // 0x4900(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7;                             // 0x4948(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6;                             // 0x4970(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_20;                        // 0x4998(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_19;                        // 0x49E8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_16;                          // 0x4A38(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_18;                        // 0x4AD8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_17;                        // 0x4B28(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_15;                          // 0x4B78(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_14;                          // 0x4C18(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                               // 0x4CB8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5;                              // 0x4CE8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_4;                            // 0x4D98(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5;                             // 0x4EF0(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_16;                        // 0x4F18(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_15;                        // 0x4F68(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_13;                          // 0x4FB8(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_14;                        // 0x5058(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_13;                        // 0x50A8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_12;                          // 0x50F8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_11;                          // 0x5198(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                               // 0x5238(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4;                              // 0x5268(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3;                            // 0x5318(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4;                             // 0x5470(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_12;                        // 0x5498(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_11;                        // 0x54E8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_10;                          // 0x5538(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_10;                        // 0x55D8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9;                         // 0x5628(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9;                           // 0x5678(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8;                           // 0x5718(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x57B8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3;                              // 0x57E8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2;                            // 0x5898(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3;                             // 0x59F0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7;                           // 0x5A18(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot;                                        // 0x5AB8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2;                             // 0x5B00(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8;                         // 0x5B28(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7;                         // 0x5B78(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6;                           // 0x5BC8(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_6;                         // 0x5C68(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_5;                         // 0x5CB8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5;                           // 0x5D08(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4;                           // 0x5DA8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x5E48(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2;                              // 0x5E78(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose;                              // 0x5F28(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose;                               // 0x6080(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4;                         // 0x60A8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_3;                         // 0x60F8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3;                           // 0x6148(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_2;                         // 0x61E8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator;                           // 0x6238(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                           // 0x6288(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                             // 0x6328(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x63C8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x63F8(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone;                                  // 0x64A8(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace;                       // 0x65B0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace;                       // 0x65D0(0x0020)
	TEnumAsByte<ENUM_RangedWeaponCategories_ENUM_RangedWeaponCategories> CurrentRangedWeapon;                                       // 0x65F0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsAimingWeapon;                                            // 0x65F1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsHipFiring;                                               // 0x65F2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_6STE[0x1];                                     // 0x65F3(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              FireWeaponBlendInTime;                                     // 0x65F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsCrouching;                                               // 0x65F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               HipOrAimFiring;                                            // 0x65F9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_UP1P[0x2];                                     // 0x65FA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     RootJointOffset;                                           // 0x65FC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     LeftHandIKOffset;                                          // 0x6608(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              IsPlayingAsFemaleFloat;                                    // 0x6614(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsMovingOnGround;                                          // 0x6618(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_5IEG[0x7];                                     // 0x6619(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<TEnumAsByte<ENUM_RangedWeaponCategories_ENUM_RangedWeaponCategories>> ShouldOffsetLeftElbow;                                     // 0x6620(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	float                                              ShouldUseLeftElbowOffsetAlpha;                             // 0x6630(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     LeftElbowOffset;                                           // 0x6634(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               WallJumpIsAvailable;                                       // 0x6640(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_7VXR[0x7];                                     // 0x6641(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<TEnumAsByte<ENUM_RangedWeaponCategories_ENUM_RangedWeaponCategories>, struct FVector> RootJointOffsetMap;                                        // 0x6648(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<TEnumAsByte<ENUM_RangedWeaponCategories_ENUM_RangedWeaponCategories>, struct FVector> LeftHandOffsetMap;                                         // 0x6698(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	float                                              WeaponScaleAlpha;                                          // 0x66E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     WeaponScaleVector;                                         // 0x66EC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Tiger_ETigerGender                                 BodyType;                                                  // 0x66F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	unsigned char                                      UnknownData_BA9B[0x7];                                     // 0x66F9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<TEnumAsByte<ENUM_RangedWeaponCategories_ENUM_RangedWeaponCategories>, float> WeaponScaleMap;                                            // 0x6700(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                               IsPlayingAsFemaleBool;                                     // 0x6750(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsSecondaryWeapon;                                         // 0x6751(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_OMK9[0x6];                                     // 0x6752(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UABP_Player_C*                               Anim_Instance;                                             // 0x6758(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              AimSweepFloat;                                             // 0x6760(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	unsigned char                                      UnknownData_BKIS[0x4];                                     // 0x6764(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ATigerPlayer*                                Player;                                                    // 0x6768(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Is_in_Reload;                                              // 0x6770(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_IJC4[0x3];                                     // 0x6771(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FRotator                                    MagazineRotationAmount;                                    // 0x6774(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               RotatingMagazine;                                          // 0x6780(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_Ranged_Weapon.ABP_Ranged_Weapon_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimNotify_HideMagazine1();
	void AnimNotify_HideMagazine2();
	void AnimNotify_UnHideMagazine1();
	void AnimNotify_UnHideMagazine2();
	void ExecuteUbergraph_ABP_Ranged_Weapon(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
