#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_ActiveBuffsPanel.TBP_UI_ActiveBuffsPanel_C.GetItemFromColumnIndex
struct UTBP_UI_ActiveBuffsPanel_C_GetItemFromColumnIndex_Params
{
	int                                                ColumnIndex;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTBP_UI_ActiveBuffItem_C*                    Item;                                                      // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ActiveBuffsPanel.TBP_UI_ActiveBuffsPanel_C.Tick
struct UTBP_UI_ActiveBuffsPanel_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ActiveBuffsPanel.TBP_UI_ActiveBuffsPanel_C.OnBuffAdded
struct UTBP_UI_ActiveBuffsPanel_C_OnBuffAdded_Params
{
	class UTigerBuff*                                  Buff;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                ID;                                                        // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Duration;                                                  // 0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ActiveBuffsPanel.TBP_UI_ActiveBuffsPanel_C.OnBuffRemoved
struct UTBP_UI_ActiveBuffsPanel_C_OnBuffRemoved_Params
{
	class UTigerBuff*                                  Buff;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                ID;                                                        // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Duration;                                                  // 0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ActiveBuffsPanel.TBP_UI_ActiveBuffsPanel_C.OnBuffRefreshed
struct UTBP_UI_ActiveBuffsPanel_C_OnBuffRefreshed_Params
{
	class UTigerBuff*                                  Buff;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                ID;                                                        // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Duration;                                                  // 0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ActiveBuffsPanel.TBP_UI_ActiveBuffsPanel_C.OnPawnChanged_Event_1
struct UTBP_UI_ActiveBuffsPanel_C_OnPawnChanged_Event_1_Params
{
	class APawn*                                       NewPawn;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ActiveBuffsPanel.TBP_UI_ActiveBuffsPanel_C.OnPlayerStateReceived
struct UTBP_UI_ActiveBuffsPanel_C_OnPlayerStateReceived_Params
{
	class ATigerPlayerState*                           InPlayerState;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ActiveBuffsPanel.TBP_UI_ActiveBuffsPanel_C.ExecuteUbergraph_TBP_UI_ActiveBuffsPanel
struct UTBP_UI_ActiveBuffsPanel_C_ExecuteUbergraph_TBP_UI_ActiveBuffsPanel_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
