#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.OnFailed_EBC24ED74F5F36E2DCB45EB973C97E17
struct UTBP_UI_JoinGameMenu_C_OnFailed_EBC24ED74F5F36E2DCB45EB973C97E17_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.OnSuccess_EBC24ED74F5F36E2DCB45EB973C97E17
struct UTBP_UI_JoinGameMenu_C_OnSuccess_EBC24ED74F5F36E2DCB45EB973C97E17_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.HandleFailure
struct UTBP_UI_JoinGameMenu_C_HandleFailure_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.Join
struct UTBP_UI_JoinGameMenu_C_Join_Params
{
	struct FTigerBpFindSessionSelectedSession          FoundSession;                                              // 0x0000(0x0110)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.OnFadeInComplete
struct UTBP_UI_JoinGameMenu_C_OnFadeInComplete_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.PreConstruct
struct UTBP_UI_JoinGameMenu_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.WidgetAnimationEvt_CountdownAnimation_K2Node_WidgetAnimationEvent_1
struct UTBP_UI_JoinGameMenu_C_WidgetAnimationEvt_CountdownAnimation_K2Node_WidgetAnimationEvent_1_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.TriggerCountdownAnimation
struct UTBP_UI_JoinGameMenu_C_TriggerCountdownAnimation_Params
{
	int                                                NewCountDownValue;                                         // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.BndEvt__SearchButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UTBP_UI_JoinGameMenu_C_BndEvt__SearchButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.BndEvt__BackButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UTBP_UI_JoinGameMenu_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.CancelJoin
struct UTBP_UI_JoinGameMenu_C_CancelJoin_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.JoinThroughUrl
struct UTBP_UI_JoinGameMenu_C_JoinThroughUrl_Params
{
	struct FString                                     InSessionURL;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.Construct
struct UTBP_UI_JoinGameMenu_C_Construct_Params
{
};

// Function TBP_UI_JoinGameMenu.TBP_UI_JoinGameMenu_C.ExecuteUbergraph_TBP_UI_JoinGameMenu
struct UTBP_UI_JoinGameMenu_C_ExecuteUbergraph_TBP_UI_JoinGameMenu_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
