#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.Get UI Background ITexture
struct UTBP_UI_BattlepassReward_C_Get_UI_Background_ITexture_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.GetUITexture
struct UTBP_UI_BattlepassReward_C_GetUITexture_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.GetInventoryItemFromPossiblecombineditemContainer
struct UTBP_UI_BattlepassReward_C_GetInventoryItemFromPossiblecombineditemContainer_Params
{
	class UTigerInventoryItemBase*                     PotentialCombinedItem;                                     // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.UpdateAlignmentsIfPlayerCard
struct UTBP_UI_BattlepassReward_C_UpdateAlignmentsIfPlayerCard_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.Init
struct UTBP_UI_BattlepassReward_C_Init_Params
{
	int                                                InRank;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                InIndex;                                                   // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               InIsFree;                                                  // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTBP_UI_Battlepass_C*                        InBattlepassRef;                                           // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.ConstructTooltipWidget
struct UTBP_UI_BattlepassReward_C_ConstructTooltipWidget_Params
{
	class UTigerTooltipWidget*                         ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnLoaded_8BD3514D458743CC989B509F5DF0A4B2
struct UTBP_UI_BattlepassReward_C_OnLoaded_8BD3514D458743CC989B509F5DF0A4B2_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnLoaded_0E0168EB4C4BB527325A47BED659224C
struct UTBP_UI_BattlepassReward_C_OnLoaded_0E0168EB4C4BB527325A47BED659224C_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.Construct
struct UTBP_UI_BattlepassReward_C_Construct_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.BndEvt__ButtonBorder_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_BattlepassReward_C_BndEvt__ButtonBorder_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnTextureLoaded
struct UTBP_UI_BattlepassReward_C_OnTextureLoaded_Params
{
	class UTexture2D*                                  ImageTexture;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.PreConstruct
struct UTBP_UI_BattlepassReward_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.ItemSelected
struct UTBP_UI_BattlepassReward_C_ItemSelected_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.BndEvt__ButtonBorder_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UTBP_UI_BattlepassReward_C_BndEvt__ButtonBorder_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.UpdateRarityAndClanIcon
struct UTBP_UI_BattlepassReward_C_UpdateRarityAndClanIcon_Params
{
	class UTigerInventoryItemBase*                     InItem;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.BndEvt__ButtonBorder_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_BattlepassReward_C_BndEvt__ButtonBorder_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnItemFocused
struct UTBP_UI_BattlepassReward_C_OnItemFocused_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnItemUnfocused
struct UTBP_UI_BattlepassReward_C_OnItemUnfocused_Params
{
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnBackgroundTextureLoaded
struct UTBP_UI_BattlepassReward_C_OnBackgroundTextureLoaded_Params
{
	class UTexture2D*                                  BackgroundTexture;                                         // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnLoadedItem
struct UTBP_UI_BattlepassReward_C_OnLoadedItem_Params
{
	struct FTigerItemId                                ItemId;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UTigerInventoryItemBase*                     InventoryItem;                                             // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.ExecuteUbergraph_TBP_UI_BattlepassReward
struct UTBP_UI_BattlepassReward_C_ExecuteUbergraph_TBP_UI_BattlepassReward_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnItemSelected__DelegateSignature
struct UTBP_UI_BattlepassReward_C_OnItemSelected__DelegateSignature_Params
{
	struct FTigerItemId                                InItemId;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_BattlepassReward.TBP_UI_BattlepassReward_C.OnItemHovered__DelegateSignature
struct UTBP_UI_BattlepassReward_C_OnItemHovered__DelegateSignature_Params
{
	struct FTigerItemId                                ItemId;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
