#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_ConfirmPurchase_Premium.TBP_UI_ConfirmPurchase_Premium_C.PurchaseHandled
struct UTBP_UI_ConfirmPurchase_Premium_C_PurchaseHandled_Params
{
	bool                                               InSuccess;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FText                                       InMessage;                                                 // 0x0008(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function TBP_UI_ConfirmPurchase_Premium.TBP_UI_ConfirmPurchase_Premium_C.CloseWidget
struct UTBP_UI_ConfirmPurchase_Premium_C_CloseWidget_Params
{
};

// Function TBP_UI_ConfirmPurchase_Premium.TBP_UI_ConfirmPurchase_Premium_C.Show
struct UTBP_UI_ConfirmPurchase_Premium_C_Show_Params
{
};

// Function TBP_UI_ConfirmPurchase_Premium.TBP_UI_ConfirmPurchase_Premium_C.BndEvt__ClosePrompt_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UTBP_UI_ConfirmPurchase_Premium_C_BndEvt__ClosePrompt_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
};

// Function TBP_UI_ConfirmPurchase_Premium.TBP_UI_ConfirmPurchase_Premium_C.PreConstruct
struct UTBP_UI_ConfirmPurchase_Premium_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_ConfirmPurchase_Premium.TBP_UI_ConfirmPurchase_Premium_C.ExecuteUbergraph_TBP_UI_ConfirmPurchase_Premium
struct UTBP_UI_ConfirmPurchase_Premium_C_ExecuteUbergraph_TBP_UI_ConfirmPurchase_Premium_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ConfirmPurchase_Premium.TBP_UI_ConfirmPurchase_Premium_C.OnClosed__DelegateSignature
struct UTBP_UI_ConfirmPurchase_Premium_C_OnClosed__DelegateSignature_Params
{
	bool                                               ConfirmedPurchase;                                         // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
