#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.SetCharacterArchetype
struct UTBP_UI_ArchetypeInfo_C_SetCharacterArchetype_Params
{
	class UTigerPowerKit*                              DesiredArchetype;                                          // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.UpdateClanInfo
struct UTBP_UI_ArchetypeInfo_C_UpdateClanInfo_Params
{
	class UTigerPowerKit*                              InArchetypeData;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.ChangeClan
struct UTBP_UI_ArchetypeInfo_C_ChangeClan_Params
{
	class UTigerPlayerClanData*                        ClanData;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               bAnimateChange;                                            // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTigerPowerKit*                              ArchetypeData;                                             // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.PreConstruct
struct UTBP_UI_ArchetypeInfo_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.Toggle UI Visibility
struct UTBP_UI_ArchetypeInfo_C_Toggle_UI_Visibility_Params
{
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.WidgetAnimationEvt_ChangedClan_K2Node_WidgetAnimationEvent_1
struct UTBP_UI_ArchetypeInfo_C_WidgetAnimationEvt_ChangedClan_K2Node_WidgetAnimationEvent_1_Params
{
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.BndEvt__PowersWithVideoPreviews_K2Node_ComponentBoundEvent_0_OnVideoStarted__DelegateSignature
struct UTBP_UI_ArchetypeInfo_C_BndEvt__PowersWithVideoPreviews_K2Node_ComponentBoundEvent_0_OnVideoStarted__DelegateSignature_Params
{
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.BndEvt__PowersWithVideoPreviews_K2Node_ComponentBoundEvent_1_OnVideoEnded__DelegateSignature
struct UTBP_UI_ArchetypeInfo_C_BndEvt__PowersWithVideoPreviews_K2Node_ComponentBoundEvent_1_OnVideoEnded__DelegateSignature_Params
{
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.StopVideo
struct UTBP_UI_ArchetypeInfo_C_StopVideo_Params
{
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.ExecuteUbergraph_TBP_UI_ArchetypeInfo
struct UTBP_UI_ArchetypeInfo_C_ExecuteUbergraph_TBP_UI_ArchetypeInfo_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.OnVideoEnded__DelegateSignature
struct UTBP_UI_ArchetypeInfo_C_OnVideoEnded__DelegateSignature_Params
{
};

// Function TBP_UI_ArchetypeInfo.TBP_UI_ArchetypeInfo_C.OnVideoStarted__DelegateSignature
struct UTBP_UI_ArchetypeInfo_C_OnVideoStarted__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
