#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.HideTextIfEmpty
struct UTBP_UI_PromotionalPopup_C_HideTextIfEmpty_Params
{
	struct FText                                       InText;                                                    // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.ShowFirstTimeEntry
struct UTBP_UI_PromotionalPopup_C_ShowFirstTimeEntry_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.ApplyTextureToImage
struct UTBP_UI_PromotionalPopup_C_ApplyTextureToImage_Params
{
	class UTexture*                                    InTexture;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.OnFail_786AAD54450C034286CFC995F0D77869
struct UTBP_UI_PromotionalPopup_C_OnFail_786AAD54450C034286CFC995F0D77869_Params
{
	class UTexture2DDynamic*                           Texture;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.OnSuccess_786AAD54450C034286CFC995F0D77869
struct UTBP_UI_PromotionalPopup_C_OnSuccess_786AAD54450C034286CFC995F0D77869_Params
{
	class UTexture2DDynamic*                           Texture;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.OnShowFirstTimeEntry
struct UTBP_UI_PromotionalPopup_C_OnShowFirstTimeEntry_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.OnShowEntry
struct UTBP_UI_PromotionalPopup_C_OnShowEntry_Params
{
	struct FTigerPromotionalPopupConfigEntry           InEntry;                                                   // 0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UTBP_UI_PromotionalPopup_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1
struct UTBP_UI_PromotionalPopup_C_WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.BndEvt__GoToStoreButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
struct UTBP_UI_PromotionalPopup_C_BndEvt__GoToStoreButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.BndEvt__CornerCloseButton_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
struct UTBP_UI_PromotionalPopup_C_BndEvt__CornerCloseButton_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.Construct
struct UTBP_UI_PromotionalPopup_C_Construct_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.OnOpen
struct UTBP_UI_PromotionalPopup_C_OnOpen_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.BeginPopupCloseAnimated
struct UTBP_UI_PromotionalPopup_C_BeginPopupCloseAnimated_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.OnClose
struct UTBP_UI_PromotionalPopup_C_OnClose_Params
{
};

// Function TBP_UI_PromotionalPopup.TBP_UI_PromotionalPopup_C.ExecuteUbergraph_TBP_UI_PromotionalPopup
struct UTBP_UI_PromotionalPopup_C_ExecuteUbergraph_TBP_UI_PromotionalPopup_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
