#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_Buff_RejuvenatingVoice.TBP_Buff_RejuvenatingVoice_C.OnHealStop
struct UTBP_Buff_RejuvenatingVoice_C_OnHealStop_Params
{
	class ATigerCharacter*                             InBuffOwner;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATigerCharacter*                             InBuffCaster;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_Buff_RejuvenatingVoice.TBP_Buff_RejuvenatingVoice_C.OnHealStart
struct UTBP_Buff_RejuvenatingVoice_C_OnHealStart_Params
{
	class ATigerCharacter*                             InBuffOwner;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATigerCharacter*                             InBuffCaster;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_Buff_RejuvenatingVoice.TBP_Buff_RejuvenatingVoice_C.OnDeactivated
struct UTBP_Buff_RejuvenatingVoice_C_OnDeactivated_Params
{
	class ATigerCharacter*                             InBuffOwner;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATigerCharacter*                             InBuffCaster;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_Buff_RejuvenatingVoice.TBP_Buff_RejuvenatingVoice_C.ExecuteUbergraph_TBP_Buff_RejuvenatingVoice
struct UTBP_Buff_RejuvenatingVoice_C_ExecuteUbergraph_TBP_Buff_RejuvenatingVoice_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
