#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.SetCooldown
struct UTBP_UI_Social_ActionMenuItem_C_SetCooldown_Params
{
	float                                              InCooldown;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.BndEvt__MenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UTBP_UI_Social_ActionMenuItem_C_BndEvt__MenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.Construct
struct UTBP_UI_Social_ActionMenuItem_C_Construct_Params
{
};

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.BndEvt__MenuButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_Social_ActionMenuItem_C_BndEvt__MenuButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.BndEvt__MenuButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_Social_ActionMenuItem_C_BndEvt__MenuButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.PreConstruct
struct UTBP_UI_Social_ActionMenuItem_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.Tick
struct UTBP_UI_Social_ActionMenuItem_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.ExecuteUbergraph_TBP_UI_Social_ActionMenuItem
struct UTBP_UI_Social_ActionMenuItem_C_ExecuteUbergraph_TBP_UI_Social_ActionMenuItem_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.MenuClicked__DelegateSignature
struct UTBP_UI_Social_ActionMenuItem_C_MenuClicked__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
