#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.UpdatePromptVisibility
struct UTBP_UI_InputPromptCombined_C_UpdatePromptVisibility_Params
{
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.Update Properties
struct UTBP_UI_InputPromptCombined_C_Update_Properties_Params
{
	struct FText                                       PrefixText;                                                // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FText                                       PostfixText;                                               // 0x0018(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FName                                       Action;                                                    // 0x0030(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsAxis;                                                    // 0x0038(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.OnUseGamepadChanged
struct UTBP_UI_InputPromptCombined_C_OnUseGamepadChanged_Params
{
	bool                                               bNewIsProbablyUsingGamepad;                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.Construct
struct UTBP_UI_InputPromptCombined_C_Construct_Params
{
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.BndEvt__Button_89_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UTBP_UI_InputPromptCombined_C_BndEvt__Button_89_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.SetClickability
struct UTBP_UI_InputPromptCombined_C_SetClickability_Params
{
	bool                                               Index;                                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_InputPromptCombined_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_InputPromptCombined_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.ExecuteUbergraph_TBP_UI_InputPromptCombined
struct UTBP_UI_InputPromptCombined_C_ExecuteUbergraph_TBP_UI_InputPromptCombined_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.OnUnhovered__DelegateSignature
struct UTBP_UI_InputPromptCombined_C_OnUnhovered__DelegateSignature_Params
{
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.OnHovered__DelegateSignature
struct UTBP_UI_InputPromptCombined_C_OnHovered__DelegateSignature_Params
{
};

// Function TBP_UI_InputPromptCombined.TBP_UI_InputPromptCombined_C.OnClicked__DelegateSignature
struct UTBP_UI_InputPromptCombined_C_OnClicked__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
