#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.UpdateHighlight
struct UTBP_UI_CharacterSkin_Elysium_C_UpdateHighlight_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.FindPaperDollAndCameraActors
struct UTBP_UI_CharacterSkin_Elysium_C_FindPaperDollAndCameraActors_Params
{
	TArray<class AActor*>                              InActors;                                                  // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.GetAnimMontageIfNotAlreadyPlaying
struct UTBP_UI_CharacterSkin_Elysium_C_GetAnimMontageIfNotAlreadyPlaying_Params
{
	class USkeletalMeshComponent*                      BodyMesh;                                                  // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                                AnimMontage;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.OnNotifyEnd_9FF26C7D42A1CDCA47A92E8F5172239F
struct UTBP_UI_CharacterSkin_Elysium_C_OnNotifyEnd_9FF26C7D42A1CDCA47A92E8F5172239F_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.OnNotifyBegin_9FF26C7D42A1CDCA47A92E8F5172239F
struct UTBP_UI_CharacterSkin_Elysium_C_OnNotifyBegin_9FF26C7D42A1CDCA47A92E8F5172239F_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.OnInterrupted_9FF26C7D42A1CDCA47A92E8F5172239F
struct UTBP_UI_CharacterSkin_Elysium_C_OnInterrupted_9FF26C7D42A1CDCA47A92E8F5172239F_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.OnBlendOut_9FF26C7D42A1CDCA47A92E8F5172239F
struct UTBP_UI_CharacterSkin_Elysium_C_OnBlendOut_9FF26C7D42A1CDCA47A92E8F5172239F_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.OnCompleted_9FF26C7D42A1CDCA47A92E8F5172239F
struct UTBP_UI_CharacterSkin_Elysium_C_OnCompleted_9FF26C7D42A1CDCA47A92E8F5172239F_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.DeselectCharacter
struct UTBP_UI_CharacterSkin_Elysium_C_DeselectCharacter_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.SelectCharacter
struct UTBP_UI_CharacterSkin_Elysium_C_SelectCharacter_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.BndEvt__ExistingCharacterButtonNew_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UTBP_UI_CharacterSkin_Elysium_C_BndEvt__ExistingCharacterButtonNew_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.OnAppearanceLoaded
struct UTBP_UI_CharacterSkin_Elysium_C_OnAppearanceLoaded_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.BndEvt__ExistingCharacterButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_CharacterSkin_Elysium_C_BndEvt__ExistingCharacterButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.PreConstruct
struct UTBP_UI_CharacterSkin_Elysium_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.BndEvt__CreateNewCharacterButton_K2Node_ComponentBoundEvent_3_OnHovered__DelegateSignature
struct UTBP_UI_CharacterSkin_Elysium_C_BndEvt__CreateNewCharacterButton_K2Node_ComponentBoundEvent_3_OnHovered__DelegateSignature_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.BndEvt__CreateNewCharacterButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature
struct UTBP_UI_CharacterSkin_Elysium_C_BndEvt__CreateNewCharacterButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.InitializeActors
struct UTBP_UI_CharacterSkin_Elysium_C_InitializeActors_Params
{
	TArray<class AActor*>                              InArchetypeSelectActors;                                   // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.BndEvt__ExistingCharacterButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_CharacterSkin_Elysium_C_BndEvt__ExistingCharacterButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.BndEvt__CreateNewCharacterButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
struct UTBP_UI_CharacterSkin_Elysium_C_BndEvt__CreateNewCharacterButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.DoClick
struct UTBP_UI_CharacterSkin_Elysium_C_DoClick_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.SetAsExistingCharacter
struct UTBP_UI_CharacterSkin_Elysium_C_SetAsExistingCharacter_Params
{
	struct FTigerPersistentPlayerCharacter             InPersistentCharacter;                                     // 0x0000(0x00B8)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.Update Ui State
struct UTBP_UI_CharacterSkin_Elysium_C_Update_Ui_State_Params
{
	TEnumAsByte<E_ElysiumChangeCharacterState_E_ElysiumChangeCharacterState> Ui_State;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.BndEvt__Customize_Button2_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature
struct UTBP_UI_CharacterSkin_Elysium_C_BndEvt__Customize_Button2_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature_Params
{
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.SetAsEmptySlot
struct UTBP_UI_CharacterSkin_Elysium_C_SetAsEmptySlot_Params
{
	Tiger_ETigerPowerKitType                           InArchetypeType;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.ExecuteUbergraph_TBP_UI_CharacterSkin_Elysium
struct UTBP_UI_CharacterSkin_Elysium_C_ExecuteUbergraph_TBP_UI_CharacterSkin_Elysium_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CharacterSkin_Elysium.TBP_UI_CharacterSkin_Elysium_C.OnClick__DelegateSignature
struct UTBP_UI_CharacterSkin_Elysium_C_OnClick__DelegateSignature_Params
{
	struct FTigerPersistentPlayerCharacter             InPersistentCharacter;                                     // 0x0000(0x00B8)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
