#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.UpdatePassivesViewOrCloseText
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_UpdatePassivesViewOrCloseText_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.ViewOrCloseVideoText
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_ViewOrCloseVideoText_Params
{
	class UMediaSource*                                Media_Source;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.UpdateVideoTextProperties
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_UpdateVideoTextProperties_Params
{
	struct FText                                       PostfixText;                                               // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.DeselectOnUnhover
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_DeselectOnUnhover_Params
{
	class UTBP_UI_TransitionMenuButton_C*              ButtonWidget;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnVideoButtonClicked
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnVideoButtonClicked_Params
{
	class UMediaSource*                                InVIdeoSource;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.StopVideo
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_StopVideo_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.Construct
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_Construct_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnMediaOpened
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnMediaOpened_Params
{
	struct FString                                     OpenedUrl;                                                 // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.Tick
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnMediaEndReached
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnMediaEndReached_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnClickedMoveSkill
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnClickedMoveSkill_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnClickedArchetypeSkill
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnClickedArchetypeSkill_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnClickedPassiveSkill
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnClickedPassiveSkill_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.Hovered_PassiveSkill
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_Hovered_PassiveSkill_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.Hovered_ArchetypeSkill
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_Hovered_ArchetypeSkill_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.Hovered_MoveSkill
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_Hovered_MoveSkill_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.PlayVideo
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_PlayVideo_Params
{
	class UMediaSource*                                InVIdeoSource;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnInitialized
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnInitialized_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.ChangeArchetype
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_ChangeArchetype_Params
{
	class UTigerPowerKit*                              InArchetypeData;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.On Open
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_On_Open_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.ExecuteUbergraph_TBP_ArchetypeSelect_PowersWithVideoPreviews
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_ExecuteUbergraph_TBP_ArchetypeSelect_PowersWithVideoPreviews_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnVideoEnded__DelegateSignature
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnVideoEnded__DelegateSignature_Params
{
};

// Function TBP_ArchetypeSelect_PowersWithVideoPreviews.TBP_ArchetypeSelect_PowersWithVideoPreviews_C.OnVideoStarted__DelegateSignature
struct UTBP_ArchetypeSelect_PowersWithVideoPreviews_C_OnVideoStarted__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
