#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.UpdatePackData
struct UTBP_UI_PremiumCurrency_Button_C_UpdatePackData_Params
{
	struct FTigerPremiumCurrencyPackData               InNewPackData;                                             // 0x0000(0x0048)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.UpdateAppearance
struct UTBP_UI_PremiumCurrency_Button_C_UpdateAppearance_Params
{
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.OnFail_70BD921E4DF523A95B2F7CA66C0D34FC
struct UTBP_UI_PremiumCurrency_Button_C_OnFail_70BD921E4DF523A95B2F7CA66C0D34FC_Params
{
	class UTexture2DDynamic*                           Texture;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.OnSuccess_70BD921E4DF523A95B2F7CA66C0D34FC
struct UTBP_UI_PremiumCurrency_Button_C_OnSuccess_70BD921E4DF523A95B2F7CA66C0D34FC_Params
{
	class UTexture2DDynamic*                           Texture;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.PreConstruct
struct UTBP_UI_PremiumCurrency_Button_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.Construct
struct UTBP_UI_PremiumCurrency_Button_C_Construct_Params
{
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.BndEvt__Button_63_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_PremiumCurrency_Button_C_BndEvt__Button_63_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.BndEvt__Button_63_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_PremiumCurrency_Button_C_BndEvt__Button_63_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.BndEvt__CurrencyButton_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature
struct UTBP_UI_PremiumCurrency_Button_C_BndEvt__CurrencyButton_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.DownloadImage
struct UTBP_UI_PremiumCurrency_Button_C_DownloadImage_Params
{
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.ExecuteUbergraph_TBP_UI_PremiumCurrency_Button
struct UTBP_UI_PremiumCurrency_Button_C_ExecuteUbergraph_TBP_UI_PremiumCurrency_Button_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PremiumCurrency_Button.TBP_UI_PremiumCurrency_Button_C.OnClicked__DelegateSignature
struct UTBP_UI_PremiumCurrency_Button_C_OnClicked__DelegateSignature_Params
{
	struct FTigerPremiumCurrencyPackData               PremiumPackData;                                           // 0x0000(0x0048)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
