#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_ConfirmSlotPurchase.TBP_UI_ConfirmSlotPurchase_C.OnLoaded_2F008DAC479D06EA7CE27EA187DD07B3
struct UTBP_UI_ConfirmSlotPurchase_C_OnLoaded_2F008DAC479D06EA7CE27EA187DD07B3_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ConfirmSlotPurchase.TBP_UI_ConfirmSlotPurchase_C.OnLoaded_9A80E476402A7298AD4629B56CCA144F
struct UTBP_UI_ConfirmSlotPurchase_C_OnLoaded_9A80E476402A7298AD4629B56CCA144F_Params
{
	class UClass*                                      Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function TBP_UI_ConfirmSlotPurchase.TBP_UI_ConfirmSlotPurchase_C.Show
struct UTBP_UI_ConfirmSlotPurchase_C_Show_Params
{
	struct FTigerItemIdWithPrice                       InItemWithPrice;                                           // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function TBP_UI_ConfirmSlotPurchase.TBP_UI_ConfirmSlotPurchase_C.BndEvt__ConfirmPrompt_K2Node_ComponentBoundEvent_0_OnInputPressed__DelegateSignature
struct UTBP_UI_ConfirmSlotPurchase_C_BndEvt__ConfirmPrompt_K2Node_ComponentBoundEvent_0_OnInputPressed__DelegateSignature_Params
{
};

// Function TBP_UI_ConfirmSlotPurchase.TBP_UI_ConfirmSlotPurchase_C.BndEvt__CancelPrompt_K2Node_ComponentBoundEvent_1_OnInputPressed__DelegateSignature
struct UTBP_UI_ConfirmSlotPurchase_C_BndEvt__CancelPrompt_K2Node_ComponentBoundEvent_1_OnInputPressed__DelegateSignature_Params
{
};

// Function TBP_UI_ConfirmSlotPurchase.TBP_UI_ConfirmSlotPurchase_C.ExecuteUbergraph_TBP_UI_ConfirmSlotPurchase
struct UTBP_UI_ConfirmSlotPurchase_C_ExecuteUbergraph_TBP_UI_ConfirmSlotPurchase_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ConfirmSlotPurchase.TBP_UI_ConfirmSlotPurchase_C.OnClosed__DelegateSignature
struct UTBP_UI_ConfirmSlotPurchase_C_OnClosed__DelegateSignature_Params
{
	bool                                               ConfirmedPurchase;                                         // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
