#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_Rarity_VFX.TBP_UI_Rarity_VFX_C.Construct
struct UTBP_UI_Rarity_VFX_C_Construct_Params
{
};

// Function TBP_UI_Rarity_VFX.TBP_UI_Rarity_VFX_C.SetGradientTexture
struct UTBP_UI_Rarity_VFX_C_SetGradientTexture_Params
{
	class UTexture2D*                                  Texture;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Rarity_VFX.TBP_UI_Rarity_VFX_C.SetColor
struct UTBP_UI_Rarity_VFX_C_SetColor_Params
{
	struct FLinearColor                                Color;                                                     // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Rarity_VFX.TBP_UI_Rarity_VFX_C.SetIntensity
struct UTBP_UI_Rarity_VFX_C_SetIntensity_Params
{
	float                                              Intentsity;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Rarity_VFX.TBP_UI_Rarity_VFX_C.SetAspectRatio
struct UTBP_UI_Rarity_VFX_C_SetAspectRatio_Params
{
	struct FVector2D                                   AspectRatio;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Rarity_VFX.TBP_UI_Rarity_VFX_C.ExecuteUbergraph_TBP_UI_Rarity_VFX
struct UTBP_UI_Rarity_VFX_C_ExecuteUbergraph_TBP_UI_Rarity_VFX_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
