#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.UpdateInteractionSize
struct UTBP_UI_VendorShared_C_UpdateInteractionSize_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.OverrideNameAndPurpose
struct UTBP_UI_VendorShared_C_OverrideNameAndPurpose_Params
{
	struct FText                                       Name;                                                      // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FText                                       Purpose;                                                   // 0x0018(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.OverrideBackground
struct UTBP_UI_VendorShared_C_OverrideBackground_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.CycleActiveInteraction
struct UTBP_UI_VendorShared_C_CycleActiveInteraction_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.AddAndActivateShopCanvas
struct UTBP_UI_VendorShared_C_AddAndActivateShopCanvas_Params
{
	class UCanvasPanel*                                NewParam;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.ShowPlayerCharacter
struct UTBP_UI_VendorShared_C_ShowPlayerCharacter_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.ShowVendorNPC
struct UTBP_UI_VendorShared_C_ShowVendorNPC_Params
{
	class ATigerNPC*                                   VendorNPC;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.OnLoaded_074CCE824EB764DB2242DBA1BD20B138
struct UTBP_UI_VendorShared_C_OnLoaded_074CCE824EB764DB2242DBA1BD20B138_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.OnLoaded_8D766778435DA3B2F6BDA382CB67B356
struct UTBP_UI_VendorShared_C_OnLoaded_8D766778435DA3B2F6BDA382CB67B356_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.Construct
struct UTBP_UI_VendorShared_C_Construct_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.OneFrameLater
struct UTBP_UI_VendorShared_C_OneFrameLater_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.PreConstruct
struct UTBP_UI_VendorShared_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.TabMenuLeftGamepad
struct UTBP_UI_VendorShared_C_TabMenuLeftGamepad_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.TabMenuRightGamepad
struct UTBP_UI_VendorShared_C_TabMenuRightGamepad_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.BndEvt__VendorTabButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
struct UTBP_UI_VendorShared_C_BndEvt__VendorTabButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.BndEvt__ShortcutTabButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
struct UTBP_UI_VendorShared_C_BndEvt__ShortcutTabButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.LoadVendorImages
struct UTBP_UI_VendorShared_C_LoadVendorImages_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.Back
struct UTBP_UI_VendorShared_C_Back_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.BndEvt__CloseButtonPrompt_K2Node_ComponentBoundEvent_3_OnInputPressed__DelegateSignature
struct UTBP_UI_VendorShared_C_BndEvt__CloseButtonPrompt_K2Node_ComponentBoundEvent_3_OnInputPressed__DelegateSignature_Params
{
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.ExecuteUbergraph_TBP_UI_VendorShared
struct UTBP_UI_VendorShared_C_ExecuteUbergraph_TBP_UI_VendorShared_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_VendorShared.TBP_UI_VendorShared_C.OnActiveMenuSwitched__DelegateSignature
struct UTBP_UI_VendorShared_C_OnActiveMenuSwitched__DelegateSignature_Params
{
	bool                                               Is_Dialogue_Menu;                                          // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
