#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_RichTextBlockIconDecorator.TBP_RichTextBlockIconDecorator_C.GetBrushForKeyInternal
struct UTBP_RichTextBlockIconDecorator_C_GetBrushForKeyInternal_Params
{
	struct FKey                                        InKey;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FSlateBrush                                 ReturnValue;                                               // 0x0018(0x0088)  (Parm, OutParm, ReturnParm)
};

// Function TBP_RichTextBlockIconDecorator.TBP_RichTextBlockIconDecorator_C.GetBrushForAxisInternal
struct UTBP_RichTextBlockIconDecorator_C_GetBrushForAxisInternal_Params
{
	struct FName                                       InName;                                                    // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                                 ReturnValue;                                               // 0x0008(0x0088)  (Parm, OutParm, ReturnParm)
};

// Function TBP_RichTextBlockIconDecorator.TBP_RichTextBlockIconDecorator_C.GetBrushForActionInternal
struct UTBP_RichTextBlockIconDecorator_C_GetBrushForActionInternal_Params
{
	struct FName                                       InName;                                                    // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                                 ReturnValue;                                               // 0x0008(0x0088)  (Parm, OutParm, ReturnParm)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
