#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_StyledComboBoxRow.TBP_UI_StyledComboBoxRow_C.SetSelected
struct UTBP_UI_StyledComboBoxRow_C_SetSelected_Params
{
	bool                                               InIsSelected;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_StyledComboBoxRow.TBP_UI_StyledComboBoxRow_C.Init
struct UTBP_UI_StyledComboBoxRow_C_Init_Params
{
	struct FText                                       InText;                                                    // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FDataTableRowHandle                         InTextStyle;                                               // 0x0018(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UTBP_UI_StyledComboBox_C*                    InParentBox;                                               // 0x0028(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_StyledComboBoxRow.TBP_UI_StyledComboBoxRow_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_StyledComboBoxRow_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_StyledComboBoxRow.TBP_UI_StyledComboBoxRow_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UTBP_UI_StyledComboBoxRow_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function TBP_UI_StyledComboBoxRow.TBP_UI_StyledComboBoxRow_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UTBP_UI_StyledComboBoxRow_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function TBP_UI_StyledComboBoxRow.TBP_UI_StyledComboBoxRow_C.ExecuteUbergraph_TBP_UI_StyledComboBoxRow
struct UTBP_UI_StyledComboBoxRow_C_ExecuteUbergraph_TBP_UI_StyledComboBoxRow_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
