#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.SetEditorPreviewState
struct UTBP_UI_LoadingScreen_Simple_C_SetEditorPreviewState_Params
{
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.UpdateLoadingTips
struct UTBP_UI_LoadingScreen_Simple_C_UpdateLoadingTips_Params
{
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.RandomizeLoadingTip
struct UTBP_UI_LoadingScreen_Simple_C_RandomizeLoadingTip_Params
{
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.UpdateLoadingDebug
struct UTBP_UI_LoadingScreen_Simple_C_UpdateLoadingDebug_Params
{
	float                                              InDeltaTime;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.OnLoaded_A9BA45904D621D959BC5A8831E744710
struct UTBP_UI_LoadingScreen_Simple_C_OnLoaded_A9BA45904D621D959BC5A8831E744710_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.OnLoaded_982BBF6049ABFCB92CFEBD91FBE8FCA1
struct UTBP_UI_LoadingScreen_Simple_C_OnLoaded_982BBF6049ABFCB92CFEBD91FBE8FCA1_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.PreConstruct
struct UTBP_UI_LoadingScreen_Simple_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.InputBlocker
struct UTBP_UI_LoadingScreen_Simple_C_InputBlocker_Params
{
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.StartFadeOut
struct UTBP_UI_LoadingScreen_Simple_C_StartFadeOut_Params
{
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.WidgetAnimationEvt_FadeOutAnimation_K2Node_WidgetAnimationEvent_1
struct UTBP_UI_LoadingScreen_Simple_C_WidgetAnimationEvt_FadeOutAnimation_K2Node_WidgetAnimationEvent_1_Params
{
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.Tick
struct UTBP_UI_LoadingScreen_Simple_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.Construct
struct UTBP_UI_LoadingScreen_Simple_C_Construct_Params
{
};

// Function TBP_UI_LoadingScreen_Simple.TBP_UI_LoadingScreen_Simple_C.ExecuteUbergraph_TBP_UI_LoadingScreen_Simple
struct UTBP_UI_LoadingScreen_Simple_C_ExecuteUbergraph_TBP_UI_LoadingScreen_Simple_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
