#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_PageIndicator.TBP_UI_PageIndicator_C.GetCurrentPageIndex
struct UTBP_UI_PageIndicator_C_GetCurrentPageIndex_Params
{
	int                                                CurrentIndex;                                              // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PageIndicator.TBP_UI_PageIndicator_C.SetNumPages
struct UTBP_UI_PageIndicator_C_SetNumPages_Params
{
	int                                                NumPages;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PageIndicator.TBP_UI_PageIndicator_C.PreConstruct
struct UTBP_UI_PageIndicator_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_PageIndicator.TBP_UI_PageIndicator_C.SelectPage
struct UTBP_UI_PageIndicator_C_SelectPage_Params
{
	int                                                NewPageIndex;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PageIndicator.TBP_UI_PageIndicator_C.Construct
struct UTBP_UI_PageIndicator_C_Construct_Params
{
};

// Function TBP_UI_PageIndicator.TBP_UI_PageIndicator_C.PageSelected
struct UTBP_UI_PageIndicator_C_PageSelected_Params
{
	int                                                PageIndex;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PageIndicator.TBP_UI_PageIndicator_C.ExecuteUbergraph_TBP_UI_PageIndicator
struct UTBP_UI_PageIndicator_C_ExecuteUbergraph_TBP_UI_PageIndicator_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_PageIndicator.TBP_UI_PageIndicator_C.OnPageSelected__DelegateSignature
struct UTBP_UI_PageIndicator_C_OnPageSelected__DelegateSignature_Params
{
	int                                                PageIndex;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
