#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_Social_Elysium_Subscreen.TBP_UI_Social_Elysium_Subscreen_C.RefreshPlayerListIfNeeded
struct UTBP_UI_Social_Elysium_Subscreen_C_RefreshPlayerListIfNeeded_Params
{
};

// Function TBP_UI_Social_Elysium_Subscreen.TBP_UI_Social_Elysium_Subscreen_C.AddPlayerEntry
struct UTBP_UI_Social_Elysium_Subscreen_C_AddPlayerEntry_Params
{
	class ATigerElysiumPlayerState*                    PlayerState;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Index;                                                     // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Social_Elysium_Subscreen.TBP_UI_Social_Elysium_Subscreen_C.RefreshPlayerList
struct UTBP_UI_Social_Elysium_Subscreen_C_RefreshPlayerList_Params
{
};

// Function TBP_UI_Social_Elysium_Subscreen.TBP_UI_Social_Elysium_Subscreen_C.OnOpen
struct UTBP_UI_Social_Elysium_Subscreen_C_OnOpen_Params
{
};

// Function TBP_UI_Social_Elysium_Subscreen.TBP_UI_Social_Elysium_Subscreen_C.OnClose
struct UTBP_UI_Social_Elysium_Subscreen_C_OnClose_Params
{
};

// Function TBP_UI_Social_Elysium_Subscreen.TBP_UI_Social_Elysium_Subscreen_C.AddPlayer
struct UTBP_UI_Social_Elysium_Subscreen_C_AddPlayer_Params
{
	class ATigerPlayerState*                           PlayerState;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Index;                                                     // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_Social_Elysium_Subscreen.TBP_UI_Social_Elysium_Subscreen_C.OnPartyUpdated
struct UTBP_UI_Social_Elysium_Subscreen_C_OnPartyUpdated_Params
{
};

// Function TBP_UI_Social_Elysium_Subscreen.TBP_UI_Social_Elysium_Subscreen_C.ExecuteUbergraph_TBP_UI_Social_Elysium_Subscreen
struct UTBP_UI_Social_Elysium_Subscreen_C_ExecuteUbergraph_TBP_UI_Social_Elysium_Subscreen_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
