#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.SetTitleText
struct UTBP_UI_ConfirmMenu_C_SetTitleText_Params
{
	struct FText                                       TitleText;                                                 // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.Hide
struct UTBP_UI_ConfirmMenu_C_Hide_Params
{
	bool                                               TryFadeOut;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.Show
struct UTBP_UI_ConfirmMenu_C_Show_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.PreConstruct
struct UTBP_UI_ConfirmMenu_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.Yes
struct UTBP_UI_ConfirmMenu_C_Yes_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.No
struct UTBP_UI_ConfirmMenu_C_No_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.BndEvt__ConfirmWidget_K2Node_ComponentBoundEvent_0_OnInputPressed__DelegateSignature
struct UTBP_UI_ConfirmMenu_C_BndEvt__ConfirmWidget_K2Node_ComponentBoundEvent_0_OnInputPressed__DelegateSignature_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.BndEvt__DeclineWidget_K2Node_ComponentBoundEvent_1_OnInputPressed__DelegateSignature
struct UTBP_UI_ConfirmMenu_C_BndEvt__DeclineWidget_K2Node_ComponentBoundEvent_1_OnInputPressed__DelegateSignature_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.Construct
struct UTBP_UI_ConfirmMenu_C_Construct_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.OnInitialized
struct UTBP_UI_ConfirmMenu_C_OnInitialized_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.OnFadeOutFinished
struct UTBP_UI_ConfirmMenu_C_OnFadeOutFinished_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.InitCountdown
struct UTBP_UI_ConfirmMenu_C_InitCountdown_Params
{
	int                                                InSeconds;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.StopCountdown
struct UTBP_UI_ConfirmMenu_C_StopCountdown_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.ExecuteUbergraph_TBP_UI_ConfirmMenu
struct UTBP_UI_ConfirmMenu_C_ExecuteUbergraph_TBP_UI_ConfirmMenu_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.CountdownFinished__DelegateSignature
struct UTBP_UI_ConfirmMenu_C_CountdownFinished__DelegateSignature_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.Decline__DelegateSignature
struct UTBP_UI_ConfirmMenu_C_Decline__DelegateSignature_Params
{
};

// Function TBP_UI_ConfirmMenu.TBP_UI_ConfirmMenu_C.Confirm__DelegateSignature
struct UTBP_UI_ConfirmMenu_C_Confirm__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
