#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_ResourceBar_Health.TBP_UI_ResourceBar_Health_C.GetLockedColor
struct UTBP_UI_ResourceBar_Health_C_GetLockedColor_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ResourceBar_Health.TBP_UI_ResourceBar_Health_C.GetEmptyColor
struct UTBP_UI_ResourceBar_Health_C_GetEmptyColor_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ResourceBar_Health.TBP_UI_ResourceBar_Health_C.IsDowned
struct UTBP_UI_ResourceBar_Health_C_IsDowned_Params
{
	bool                                               Downed;                                                    // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_ResourceBar_Health.TBP_UI_ResourceBar_Health_C.GetFilledColor
struct UTBP_UI_ResourceBar_Health_C_GetFilledColor_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ResourceBar_Health.TBP_UI_ResourceBar_Health_C.GetRecentResourcesLost
struct UTBP_UI_ResourceBar_Health_C_GetRecentResourcesLost_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ResourceBar_Health.TBP_UI_ResourceBar_Health_C.GetMaxResources
struct UTBP_UI_ResourceBar_Health_C_GetMaxResources_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_ResourceBar_Health.TBP_UI_ResourceBar_Health_C.GetCurrentResources
struct UTBP_UI_ResourceBar_Health_C_GetCurrentResources_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
