#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TBP_UI_CoterieNavigatorIcon.TBP_UI_CoterieNavigatorIcon_C.UpdateVisibility
struct UTBP_UI_CoterieNavigatorIcon_C_UpdateVisibility_Params
{
	bool                                               bIsNavigator;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_CoterieNavigatorIcon.TBP_UI_CoterieNavigatorIcon_C.SetOwningPawn
struct UTBP_UI_CoterieNavigatorIcon_C_SetOwningPawn_Params
{
	class APawn*                                       In_Pawn;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TBP_UI_CoterieNavigatorIcon.TBP_UI_CoterieNavigatorIcon_C.OnIsCoterieNavigatorChanged_Event_1
struct UTBP_UI_CoterieNavigatorIcon_C_OnIsCoterieNavigatorChanged_Event_1_Params
{
	bool                                               bInIsCoterieNavigator;                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_CoterieNavigatorIcon.TBP_UI_CoterieNavigatorIcon_C.PreConstruct
struct UTBP_UI_CoterieNavigatorIcon_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function TBP_UI_CoterieNavigatorIcon.TBP_UI_CoterieNavigatorIcon_C.ExecuteUbergraph_TBP_UI_CoterieNavigatorIcon
struct UTBP_UI_CoterieNavigatorIcon_C_ExecuteUbergraph_TBP_UI_CoterieNavigatorIcon_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
