#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum Tiger.ETigerDisciplineCooldownReductionType
enum class Tiger_ETigerDisciplineCooldownReductionType : uint8_t
{
	ETigerDisciplineCooldownReductionType__Seconds = 0,
	ETigerDisciplineCooldownReductionType__MultiplierOfTotal = 1,
	ETigerDisciplineCooldownReductionType__MultiplierOfRemaining = 2,
	ETigerDisciplineCooldownReductionType__ETigerDisciplineCooldownReductionType_MAX = 3,

};

// Enum Tiger.ETigerDisciplinesEnum
enum class Tiger_ETigerDisciplinesEnum : uint8_t
{
	ETigerDisciplinesEnum__TE_DisciplineNone = 0,
	ETigerDisciplinesEnum__TE_DisciplineTeleport = 1,
	ETigerDisciplinesEnum__TE_DisciplineStun = 2,
	ETigerDisciplinesEnum__TE_DisciplineFOTT = 3,
	ETigerDisciplinesEnum__TE_DisciplineJump = 4,
	ETigerDisciplinesEnum__TE_DisciplineSwiftStrike = 5,
	ETigerDisciplinesEnum__TE_DisciplineFlowerOfDeath = 6,
	ETigerDisciplinesEnum__TE_DisciplineDisplacement = 7,
	ETigerDisciplinesEnum__TE_DisciplineEarthshock = 8,
	ETigerDisciplinesEnum__TE_DisciplineFrenzy = 9,
	ETigerDisciplinesEnum__TE_DisciplineVanish = 10,
	ETigerDisciplinesEnum__TE_DisciplineScouts = 11,
	ETigerDisciplinesEnum__TE_DisciplineLaceratingThrow = 12,
	ETigerDisciplinesEnum__TE_DisciplineReposition = 13,
	ETigerDisciplinesEnum__TE_DisciplineIncitePain = 14,
	ETigerDisciplinesEnum__TE_DisciplineMajesty = 15,
	ETigerDisciplinesEnum__TE_DisciplineGuardBreak = 16,
	ETigerDisciplinesEnum__TE_DisciplinePassion = 17,
	ETigerDisciplinesEnum__TE_DisciplineCharm = 18,
	ETigerDisciplinesEnum__TE_DisciplineProjectionDash = 19,
	ETigerDisciplinesEnum__TE_DisciplineBlindingBeauty = 20,
	ETigerDisciplinesEnum__TE_DisciplineRejuvenatingVoice = 21,
	ETigerDisciplinesEnum__TE_DisciplineShackles = 22,
	ETigerDisciplinesEnum__TE_DisciplineTraps = 23,
	ETigerDisciplinesEnum__TE_DisciplineShockwavePunch = 24,
	ETigerDisciplinesEnum__TE_WeaponAbilityAxeThrow = 25,
	ETigerDisciplinesEnum__TE_WeaponAbilityDash = 26,
	ETigerDisciplinesEnum__TE_WeaponAbilityHook = 27,
	ETigerDisciplinesEnum__TE_WeaponAbilityReflect = 28,
	ETigerDisciplinesEnum__TE_WeaponAbilitySpikedBat = 29,
	ETigerDisciplinesEnum__TE_WeaponAbilityGreatsword = 30,
	ETigerDisciplinesEnum__TE_WeaponAbilityThrowingKnifes = 31,
	ETigerDisciplinesEnum__TE_DisciplineCount = 32,
	ETigerDisciplinesEnum__TE_MAX  = 33,

};

// Enum Tiger.ETigerDisciplineSlot
enum class Tiger_ETigerDisciplineSlot : uint8_t
{
	ETigerDisciplineSlot__TE_DisciplineSlotLeft = 0,
	ETigerDisciplineSlot__TE_DisciplineSlotSuper = 1,
	ETigerDisciplineSlot__TE_DisciplineSlotRight = 2,
	ETigerDisciplineSlot__TE_DisciplineSlotCount = 3,
	ETigerDisciplineSlot__TE_MAX   = 4,

};

// Enum Tiger.ETigerCharacterActions
enum class Tiger_ETigerCharacterActions : uint8_t
{
	ETigerCharacterActions__Reloading = 0,
	ETigerCharacterActions__Shooting = 1,
	ETigerCharacterActions__Aiming = 2,
	ETigerCharacterActions__Blocking = 3,
	ETigerCharacterActions__MeleeAttack = 4,
	ETigerCharacterActions__Climbing = 5,
	ETigerCharacterActions__LedgeGrab = 6,
	ETigerCharacterActions__LowVault = 7,
	ETigerCharacterActions__Interacting = 8,
	ETigerCharacterActions__UseDiscipline = 9,
	ETigerCharacterActions__SwitchWeapon = 10,
	ETigerCharacterActions__Jump   = 11,
	ETigerCharacterActions__Sprinting = 12,
	ETigerCharacterActions__AlternateAction = 13,
	ETigerCharacterActions__None   = 14,
	ETigerCharacterActions__ETigerCharacterActions_MAX = 15,

};

// Enum Tiger.ETigerDisciplineEvent
enum class Tiger_ETigerDisciplineEvent : uint8_t
{
	ETigerDisciplineEvent__ScoutSpawned = 0,
	ETigerDisciplineEvent__ScoutDespawned = 1,
	ETigerDisciplineEvent__AnimationCallback = 2,
	ETigerDisciplineEvent__ProjectionDied = 3,
	ETigerDisciplineEvent__TeleportToProjection = 4,
	ETigerDisciplineEvent__EnablePlayerMovement = 5,
	ETigerDisciplineEvent__WeaponAbility_ThrowHook = 6,
	ETigerDisciplineEvent__ProjectionDiedDueToOutOfRange = 7,
	ETigerDisciplineEvent__ETigerDisciplineEvent_MAX = 8,

};

// Enum Tiger.ETigerInputActionResult
enum class Tiger_ETigerInputActionResult : uint8_t
{
	ETigerInputActionResult__Failed = 0,
	ETigerInputActionResult__Buffer = 1,
	ETigerInputActionResult__Success = 2,
	ETigerInputActionResult__ETigerInputActionResult_MAX = 3,

};

// Enum Tiger.ETigerTraversalAction
enum class Tiger_ETigerTraversalAction : uint8_t
{
	ETigerTraversalAction__Jump    = 0,
	ETigerTraversalAction__WallJump = 1,
	ETigerTraversalAction__SlideBegin = 2,
	ETigerTraversalAction__SlideEnd = 3,
	ETigerTraversalAction__SlideJump = 4,
	ETigerTraversalAction__AirDash = 5,
	ETigerTraversalAction__WallGrindStarted = 6,
	ETigerTraversalAction__WallGrindEnded = 7,
	ETigerTraversalAction__ClimbStarted = 8,
	ETigerTraversalAction__ClimbEnded = 9,
	ETigerTraversalAction__HardLanding = 10,
	ETigerTraversalAction__ETigerTraversalAction_MAX = 11,

};

// Enum Tiger.ETigerCharacterAkAlignmentType
enum class Tiger_ETigerCharacterAkAlignmentType : uint8_t
{
	ETigerCharacterAkAlignmentType__Me = 0,
	ETigerCharacterAkAlignmentType__Ally = 1,
	ETigerCharacterAkAlignmentType__Enemy = 2,
	ETigerCharacterAkAlignmentType__Count = 3,
	ETigerCharacterAkAlignmentType__ETigerCharacterAkAlignmentType_MAX = 4,

};

// Enum Tiger.ETigerSeasonMatchStatType
enum class Tiger_ETigerSeasonMatchStatType : uint8_t
{
	ETigerSeasonMatchStatType__Placement = 0,
	ETigerSeasonMatchStatType__LevelReached = 1,
	ETigerSeasonMatchStatType__Kills = 2,
	ETigerSeasonMatchStatType__KillAssists = 3,
	ETigerSeasonMatchStatType__Diableries = 4,
	ETigerSeasonMatchStatType__DamageDone = 5,
	ETigerSeasonMatchStatType__Count = 6,
	ETigerSeasonMatchStatType__ETigerSeasonMatchStatType_MAX = 7,

};

// Enum Tiger.ETigerKillerType
enum class Tiger_ETigerKillerType : uint8_t
{
	ETigerKillerType__Unknown      = 0,
	ETigerKillerType__Player       = 1,
	ETigerKillerType__Entity       = 2,
	ETigerKillerType__RedGas       = 3,
	ETigerKillerType__Shark        = 4,
	ETigerKillerType__ETigerKillerType_MAX = 5,

};

// Enum Tiger.ETigerGroupingMode
enum class Tiger_ETigerGroupingMode : uint8_t
{
	ETigerGroupingMode__Solo       = 0,
	ETigerGroupingMode__SquadOfFour = 1,
	ETigerGroupingMode__Count      = 2,
	ETigerGroupingMode__ETigerGroupingMode_MAX = 3,

};

// Enum Tiger.ETargetInteraction
enum class Tiger_ETargetInteraction : uint8_t
{
	ETargetInteraction__None       = 0,
	ETargetInteraction__PickupItem = 1,
	ETargetInteraction__Lure       = 2,
	ETargetInteraction__Feed       = 3,
	ETargetInteraction__TalkTo     = 4,
	ETargetInteraction__UsingConsumable = 5,
	ETargetInteraction__InteractWithObject = 6,
	ETargetInteraction__DiablerizeTrainer = 7,
	ETargetInteraction__ReviveTrainer = 8,
	ETargetInteraction__JudgeFeed  = 9,
	ETargetInteraction__Diablerize = 10,
	ETargetInteraction__Revive     = 11,
	ETargetInteraction__ETargetInteraction_MAX = 12,

};

// Enum Tiger.ETigerWeaponMeleeAttackType
enum class Tiger_ETigerWeaponMeleeAttackType : uint8_t
{
	ETigerWeaponMeleeAttackType__Invalid = 0,
	ETigerWeaponMeleeAttackType__Normal = 1,
	ETigerWeaponMeleeAttackType__Sprinting = 2,
	ETigerWeaponMeleeAttackType__Aerial = 3,
	ETigerWeaponMeleeAttackType__QuickAttack = 4,
	ETigerWeaponMeleeAttackType__UNUSED = 5,
	ETigerWeaponMeleeAttackType__StrafeAttack = 6,
	ETigerWeaponMeleeAttackType__Heavy = 7,
	ETigerWeaponMeleeAttackType__Count = 8,
	ETigerWeaponMeleeAttackType__ETigerWeaponMeleeAttackType_MAX = 9,

};

// Enum Tiger.ETigerTelemetryMatchmackingCancelReason
enum class Tiger_ETigerTelemetryMatchmackingCancelReason : uint8_t
{
	ETigerTelemetryMatchmackingCancelReason__Input = 0,
	ETigerTelemetryMatchmackingCancelReason__Timeout = 1,
	ETigerTelemetryMatchmackingCancelReason__ExitGame = 2,
	ETigerTelemetryMatchmackingCancelReason__ETigerTelemetryMatchmackingCancelReason_MAX = 3,

};

// Enum Tiger.ETigerWeaponSlot
enum class Tiger_ETigerWeaponSlot : uint8_t
{
	ETigerWeaponSlot__First        = 0,
	ETigerWeaponSlot__Ranged_Primary = 1,
	ETigerWeaponSlot__Ranged_Secondary = 2,
	ETigerWeaponSlot__Melee        = 3,
	ETigerWeaponSlot__Unarmed      = 4,
	ETigerWeaponSlot__Last         = 5,
	ETigerWeaponSlot__Count        = 6,
	ETigerWeaponSlot__ETigerWeaponSlot_MAX = 7,

};

// Enum Tiger.ETigerOnlineErrorCategory
enum class Tiger_ETigerOnlineErrorCategory : uint8_t
{
	ETigerOnlineErrorCategory__ACC = 0,
	ETigerOnlineErrorCategory__SYS = 1,
	ETigerOnlineErrorCategory__SRV = 2,
	ETigerOnlineErrorCategory__ETigerOnlineErrorCategory_MAX = 3,

};

// Enum Tiger.ETigerAIPlayerAction
enum class Tiger_ETigerAIPlayerAction : uint8_t
{
	ETigerAIPlayerAction__None     = 0,
	ETigerAIPlayerAction__BulletImpactEnvironment = 1,
	ETigerAIPlayerAction__CollideWithCivilian = 2,
	ETigerAIPlayerAction__CollideWithGuard = 3,
	ETigerAIPlayerAction__DamageDealing = 4,
	ETigerAIPlayerAction__Dodge    = 5,
	ETigerAIPlayerAction__AirDodgeRecovery = 6,
	ETigerAIPlayerAction__FeedingStart = 7,
	ETigerAIPlayerAction__FeedingTick = 8,
	ETigerAIPlayerAction__FeedingEnd = 9,
	ETigerAIPlayerAction__FeedingStoppedOnSpecificNPC = 10,
	ETigerAIPlayerAction__GenericDisciplineActivation = 11,
	ETigerAIPlayerAction__HardLanding = 12,
	ETigerAIPlayerAction__InsideSuspiciousVolume = 13,
	ETigerAIPlayerAction__InsideThreatVolume = 14,
	ETigerAIPlayerAction__MeleeAttack = 15,
	ETigerAIPlayerAction__Mobility = 16,
	ETigerAIPlayerAction__Sprinting = 17,
	ETigerAIPlayerAction__Climbing = 18,
	ETigerAIPlayerAction__AirTime  = 19,
	ETigerAIPlayerAction__ReportSuspectPlayer = 20,
	ETigerAIPlayerAction__ReportThreateningPlayer = 21,
	ETigerAIPlayerAction__ShowingMeleeWeapon = 22,
	ETigerAIPlayerAction__ShowingRangedWeapon = 23,
	ETigerAIPlayerAction__AimingRangedWeapon = 24,
	ETigerAIPlayerAction__WeaponFired = 25,
	ETigerAIPlayerAction__SeenByEntity = 26,
	ETigerAIPlayerAction__SeenByEntityWhenBloodHunted = 27,
	ETigerAIPlayerAction__NotifyMasqueradeBreachSpecificNPC = 28,
	ETigerAIPlayerAction__SeenByGuardWhenBloodHunted = 29,
	ETigerAIPlayerAction__SeenBySuspectingGuard = 30,
	ETigerAIPlayerAction__FeedingStartGuard = 31,
	ETigerAIPlayerAction__FeedingTickGuard = 32,
	ETigerAIPlayerAction__FeedingEndGuard = 33,
	ETigerAIPlayerAction__DiablerizeStart = 34,
	ETigerAIPlayerAction__DiablerizeTick = 35,
	ETigerAIPlayerAction__DiablerizeEnd = 36,
	ETigerAIPlayerAction__HideousPassiveTick = 37,
	ETigerAIPlayerAction__AttackedByGuard = 38,
	ETigerAIPlayerAction__AttackedByEntity = 39,
	ETigerAIPlayerAction__UtilityRoarPower = 40,
	ETigerAIPlayerAction__UtilityRoarPowerCloseRange = 41,
	ETigerAIPlayerAction__ActivateCarAlarm = 42,
	ETigerAIPlayerAction__ActivateInvisibility = 43,
	ETigerAIPlayerAction__DeactivateInvisibility = 44,
	ETigerAIPlayerAction__TeleportToProjectionDash = 45,
	ETigerAIPlayerAction__KilledNPC = 46,
	ETigerAIPlayerAction__ActivateStoreAlarm = 47,
	ETigerAIPlayerAction__SeenByCivilianWhenBloodHunted = 48,
	ETigerAIPlayerAction__DisciplineBegin = 49,
	ETigerAIPlayerAction__DisciplineActivationFOTT = 50,
	ETigerAIPlayerAction__DisciplineActivationMightyLeap = 51,
	ETigerAIPlayerAction__DisciplineActivationSwiftStrike = 52,
	ETigerAIPlayerAction__DisciplineActivationDisplacement = 53,
	ETigerAIPlayerAction__DisciplineActivationGroundSlam = 54,
	ETigerAIPlayerAction__DisciplineActivationFrenzy = 55,
	ETigerAIPlayerAction__DisciplineActivationVanish = 56,
	ETigerAIPlayerAction__DisciplineActivationScouts = 57,
	ETigerAIPlayerAction__DisciplineActivationGuardBreak = 58,
	ETigerAIPlayerAction__DisciplineActivationPassion = 59,
	ETigerAIPlayerAction__DisciplineActivationCharm = 60,
	ETigerAIPlayerAction__DisciplineActivationProjectionDash = 61,
	ETigerAIPlayerAction__DisciplineActivationShackles = 62,
	ETigerAIPlayerAction__DisciplineActivationRejuvanatingVoice = 63,
	ETigerAIPlayerAction__DisciplineActivationAxe = 64,
	ETigerAIPlayerAction__DisciplineActivationKatana = 65,
	ETigerAIPlayerAction__DisciplineActivationDualBlades = 66,
	ETigerAIPlayerAction__DisciplineActivationLaceratingThrow = 67,
	ETigerAIPlayerAction__DisciplineEnd = 68,
	ETigerAIPlayerAction__Count    = 69,
	ETigerAIPlayerAction__ETigerAIPlayerAction_MAX = 70,

};

// Enum Tiger.EBodyPart
enum class Tiger_EBodyPart : uint8_t
{
	EBodyPart__None                = 0,
	EBodyPart__Head                = 1,
	EBodyPart__Chest               = 2,
	EBodyPart__Body                = 3,
	EBodyPart__Arms                = 4,
	EBodyPart__Legs                = 5,
	EBodyPart__MAX                 = 6,

};

// Enum Tiger.ETigerTelemetryItemSourceID
enum class Tiger_ETigerTelemetryItemSourceID : uint8_t
{
	ETigerTelemetryItemSourceID__Cheat = 0,
	ETigerTelemetryItemSourceID__BotCheat = 1,
	ETigerTelemetryItemSourceID__Spawn = 2,
	ETigerTelemetryItemSourceID__Floor = 3,
	ETigerTelemetryItemSourceID__Van = 4,
	ETigerTelemetryItemSourceID__Store = 5,
	ETigerTelemetryItemSourceID__EntityCorpse = 6,
	ETigerTelemetryItemSourceID__JudgeCorpse = 7,
	ETigerTelemetryItemSourceID__PlayerCorpse = 8,
	ETigerTelemetryItemSourceID__PlayerDrop = 9,
	ETigerTelemetryItemSourceID__LootCrate = 10,
	ETigerTelemetryItemSourceID__Collectible = 11,
	ETigerTelemetryItemSourceID__ETigerTelemetryItemSourceID_MAX = 12,

};

// Enum Tiger.ETigerMusicAudioState
enum class Tiger_ETigerMusicAudioState : uint8_t
{
	ETigerMusicAudioState__None    = 0,
	ETigerMusicAudioState__Unknown = 1,
	ETigerMusicAudioState__Silent  = 2,
	ETigerMusicAudioState__TitleScreen = 3,
	ETigerMusicAudioState__Ambient = 4,
	ETigerMusicAudioState__Feeding = 5,
	ETigerMusicAudioState__Elysium = 6,
	ETigerMusicAudioState__RedGas  = 7,
	ETigerMusicAudioState__Combat  = 8,
	ETigerMusicAudioState__Deployment = 9,
	ETigerMusicAudioState__PreLoading = 10,
	ETigerMusicAudioState__PostMatch = 11,
	ETigerMusicAudioState__EntityNearby = 12,
	ETigerMusicAudioState__LastStage = 13,
	ETigerMusicAudioState__MasqueradeBreak = 14,
	ETigerMusicAudioState__MainMenu = 15,
	ETigerMusicAudioState__Count   = 16,
	ETigerMusicAudioState__ETigerMusicAudioState_MAX = 17,

};

// Enum Tiger.ETigerFeedingAudioState
enum class Tiger_ETigerFeedingAudioState : uint8_t
{
	ETigerFeedingAudioState__None  = 0,
	ETigerFeedingAudioState__IsFeeding = 1,
	ETigerFeedingAudioState__Count = 2,
	ETigerFeedingAudioState__ETigerFeedingAudioState_MAX = 3,

};

// Enum Tiger.ETigerCombatAudioState
enum class Tiger_ETigerCombatAudioState : uint8_t
{
	ETigerCombatAudioState__None   = 0,
	ETigerCombatAudioState__Kindred = 1,
	ETigerCombatAudioState__Entity = 2,
	ETigerCombatAudioState__Count  = 3,
	ETigerCombatAudioState__ETigerCombatAudioState_MAX = 4,

};

// Enum Tiger.ETigerAmbienceAudioState
enum class Tiger_ETigerAmbienceAudioState : uint8_t
{
	ETigerAmbienceAudioState__None = 0,
	ETigerAmbienceAudioState__AmbienceOn = 1,
	ETigerAmbienceAudioState__AmbienceOff = 2,
	ETigerAmbienceAudioState__Count = 3,
	ETigerAmbienceAudioState__ETigerAmbienceAudioState_MAX = 4,

};

// Enum Tiger.ETigerMainMenuAudioState
enum class Tiger_ETigerMainMenuAudioState : uint8_t
{
	ETigerMainMenuAudioState__None = 0,
	ETigerMainMenuAudioState__InMainMenu = 1,
	ETigerMainMenuAudioState__OutMainMenu = 2,
	ETigerMainMenuAudioState__Count = 3,
	ETigerMainMenuAudioState__ETigerMainMenuAudioState_MAX = 4,

};

// Enum Tiger.ETigerIndoorAudioState
enum class Tiger_ETigerIndoorAudioState : uint8_t
{
	ETigerIndoorAudioState__None   = 0,
	ETigerIndoorAudioState__Indoor = 1,
	ETigerIndoorAudioState__Count  = 2,
	ETigerIndoorAudioState__ETigerIndoorAudioState_MAX = 3,

};

// Enum Tiger.ETigerBlindedAudioState
enum class Tiger_ETigerBlindedAudioState : uint8_t
{
	ETigerBlindedAudioState__None  = 0,
	ETigerBlindedAudioState__Blind = 1,
	ETigerBlindedAudioState__Count = 2,
	ETigerBlindedAudioState__ETigerBlindedAudioState_MAX = 3,

};

// Enum Tiger.ETigerLodSplitMeshQuality
enum class Tiger_ETigerLodSplitMeshQuality : uint8_t
{
	ETigerLodSplitMeshQuality__FullMesh = 0,
	ETigerLodSplitMeshQuality__OnlyLod0 = 1,
	ETigerLodSplitMeshQuality__NoLod0 = 2,
	ETigerLodSplitMeshQuality__ETigerLodSplitMeshQuality_MAX = 3,

};

// Enum Tiger.ETigerCharacterMeshPart
enum class Tiger_ETigerCharacterMeshPart : uint8_t
{
	ETigerCharacterMeshPart__Body  = 0,
	ETigerCharacterMeshPart__Head  = 1,
	ETigerCharacterMeshPart__Hair  = 2,
	ETigerCharacterMeshPart__Hoodie = 3,
	ETigerCharacterMeshPart__Headgear = 4,
	ETigerCharacterMeshPart__Eyewear = 5,
	ETigerCharacterMeshPart__Weapon = 6,
	ETigerCharacterMeshPart__SecondaryWeapon = 7,
	ETigerCharacterMeshPart__HolsteredWeapon = 8,
	ETigerCharacterMeshPart__SecondaryHolsteredWeapon = 9,
	ETigerCharacterMeshPart__BodyAdditional = 10,
	ETigerCharacterMeshPart__Count = 11,
	ETigerCharacterMeshPart__ETigerCharacterMeshPart_MAX = 12,

};

// Enum Tiger.ETigerCharacterDynamicMeshType
enum class Tiger_ETigerCharacterDynamicMeshType : uint8_t
{
	ETigerCharacterDynamicMeshType__Generic = 0,
	ETigerCharacterDynamicMeshType__Piercing = 1,
	ETigerCharacterDynamicMeshType__Beard = 2,
	ETigerCharacterDynamicMeshType__Count = 3,
	ETigerCharacterDynamicMeshType__ETigerCharacterDynamicMeshType_MAX = 4,

};

// Enum Tiger.ETigerOutlineMode
enum class Tiger_ETigerOutlineMode : uint8_t
{
	ETigerOutlineMode__HeightenedSenses = 0,
	ETigerOutlineMode__Lure        = 1,
	ETigerOutlineMode__EnemyPlayer = 2,
	ETigerOutlineMode__ScoutingFamiliarsGroupMember = 3,
	ETigerOutlineMode__ScoutingFamiliars = 4,
	ETigerOutlineMode__BloodHuntedHSReveal = 5,
	ETigerOutlineMode__BloodHunted = 6,
	ETigerOutlineMode__CapturingHaven = 7,
	ETigerOutlineMode__CharmingUs  = 8,
	ETigerOutlineMode__GroupMember = 9,
	ETigerOutlineMode__LocalPlayer = 10,
	ETigerOutlineMode__Count       = 11,
	ETigerOutlineMode__None        = 12,
	ETigerOutlineMode__ETigerOutlineMode_MAX = 13,

};

// Enum Tiger.ETigerCharacterAction
enum class Tiger_ETigerCharacterAction : uint8_t
{
	ETigerCharacterAction__Dodged  = 0,
	ETigerCharacterAction__MeleeAttack = 1,
	ETigerCharacterAction__RangedAttack = 2,
	ETigerCharacterAction__Aimed   = 3,
	ETigerCharacterAction__DisciplineActivated = 4,
	ETigerCharacterAction__SuperDisciplineActivated = 5,
	ETigerCharacterAction__PickedUpItem = 6,
	ETigerCharacterAction__BeginBlock = 7,
	ETigerCharacterAction__RangedDamageTaken = 8,
	ETigerCharacterAction__MeleeDamageTaken = 9,
	ETigerCharacterAction__DisciplineDamageTaken = 10,
	ETigerCharacterAction__OtherDamageTaken = 11,
	ETigerCharacterAction__DodgeAborted = 12,
	ETigerCharacterAction__DisciplineReleased = 13,
	ETigerCharacterAction__Downed  = 14,
	ETigerCharacterAction__DamageDealt = 15,
	ETigerCharacterAction__ETigerCharacterAction_MAX = 16,

};

// Enum Tiger.ETigerCharacterType
enum class Tiger_ETigerCharacterType : uint8_t
{
	ETigerCharacterType__Player    = 0,
	ETigerCharacterType__Npc       = 1,
	ETigerCharacterType__TutorialTrainer = 2,
	ETigerCharacterType__PlayerBot = 3,
	ETigerCharacterType__Count     = 4,
	ETigerCharacterType__ETigerCharacterType_MAX = 5,

};

// Enum Tiger.ETigerGender
enum class Tiger_ETigerGender : uint8_t
{
	ETigerGender__Female           = 0,
	ETigerGender__Male             = 1,
	ETigerGender__Count            = 2,
	ETigerGender__ETigerGender_MAX = 3,

};

// Enum Tiger.ETigerMetaStoreEventType
enum class Tiger_ETigerMetaStoreEventType : uint8_t
{
	ETigerMetaStoreEventType__ConfigAdded = 0,
	ETigerMetaStoreEventType__ConfigChanged = 1,
	ETigerMetaStoreEventType__ConfigGetFailed = 2,
	ETigerMetaStoreEventType__ETigerMetaStoreEventType_MAX = 3,

};

// Enum Tiger.ETigerMetaStoreCategoryType
enum class Tiger_ETigerMetaStoreCategoryType : uint8_t
{
	ETigerMetaStoreCategoryType__All = 0,
	ETigerMetaStoreCategoryType__FlashStore = 1,
	ETigerMetaStoreCategoryType__Battlepass = 2,
	ETigerMetaStoreCategoryType__SeasonRankSkip = 3,
	ETigerMetaStoreCategoryType__ETigerMetaStoreCategoryType_MAX = 4,

};

// Enum Tiger.ETigerBuyStoreEntryResponseCode
enum class Tiger_ETigerBuyStoreEntryResponseCode : uint8_t
{
	ETigerBuyStoreEntryResponseCode__Success = 0,
	ETigerBuyStoreEntryResponseCode__Error_InsufficentFunds = 1,
	ETigerBuyStoreEntryResponseCode__Error_NoVendor = 2,
	ETigerBuyStoreEntryResponseCode__Error_InvalidEntry = 3,
	ETigerBuyStoreEntryResponseCode__Error_NoPlayerDataService = 4,
	ETigerBuyStoreEntryResponseCode__Error_BackendError = 5,
	ETigerBuyStoreEntryResponseCode__Error_NoResponse = 6,
	ETigerBuyStoreEntryResponseCode__Error_ParsePlayerTransactionalData = 7,
	ETigerBuyStoreEntryResponseCode__Error_BuyResult_InsufficentFunds = 8,
	ETigerBuyStoreEntryResponseCode__Error_BuyResult_InsufficientItems = 9,
	ETigerBuyStoreEntryResponseCode__Error_BuyResult_ExpiredItem = 10,
	ETigerBuyStoreEntryResponseCode__Error_BuyResult_Unknown = 11,
	ETigerBuyStoreEntryResponseCode__Error_TimedOut = 12,
	ETigerBuyStoreEntryResponseCode__ETigerBuyStoreEntryResponseCode_MAX = 13,

};

// Enum Tiger.ETigerPowerKitType
enum class Tiger_ETigerPowerKitType : uint8_t
{
	ETigerPowerKitType__None       = 0,
	ETigerPowerKitType__Veteran    = 1,
	ETigerPowerKitType__Outlaw     = 2,
	ETigerPowerKitType__Siren      = 3,
	ETigerPowerKitType__Nightingale = 4,
	ETigerPowerKitType__Animalist  = 5,
	ETigerPowerKitType__Technocrat = 6,
	ETigerPowerKitType__Count      = 7,
	ETigerPowerKitType__ETigerPowerKitType_MAX = 8,

};

// Enum Tiger.ETigerThrallId
enum class Tiger_ETigerThrallId : uint8_t
{
	ETigerThrallId__None           = 0,
	ETigerThrallId__Brutallist     = 1,
	ETigerThrallId__Rebel          = 2,
	ETigerThrallId__Hacker         = 3,
	ETigerThrallId__Monster        = 4,
	ETigerThrallId__Lover          = 5,
	ETigerThrallId__Model          = 6,
	ETigerThrallId__Max            = 7,

};

// Enum Tiger.ETigerPlayerEvent
enum class Tiger_ETigerPlayerEvent : uint8_t
{
	ETigerPlayerEvent__None        = 0,
	ETigerPlayerEvent__OnFeedingCompleted = 1,
	ETigerPlayerEvent__OnRatFeedingCompleted = 2,
	ETigerPlayerEvent__OnFedOnHighPotenceBlood = 3,
	ETigerPlayerEvent__OnDownedPlayer = 4,
	ETigerPlayerEvent__OnDownedBloodHuntedPlayer = 5,
	ETigerPlayerEvent__OnDownedPlayerWithHeadshot = 6,
	ETigerPlayerEvent__OnDownedPlayerWithMelee = 7,
	ETigerPlayerEvent__OnDownedEntity = 8,
	ETigerPlayerEvent__OnDiablerizedPlayer = 9,
	ETigerPlayerEvent__OnDiablerizedBloodHuntedPlayer = 10,
	ETigerPlayerEvent__OnSurvivedHolyIncenseWave = 11,
	ETigerPlayerEvent__OnKilledEntityGrunt = 12,
	ETigerPlayerEvent__OnKilledOtherPlayer = 13,
	ETigerPlayerEvent__OnKilledBloodHuntedPlayer = 14,
	ETigerPlayerEvent__OnPickedUpRelic = 15,
	ETigerPlayerEvent__OnFedOnSuperHighPotenceBlood = 16,
	ETigerPlayerEvent__OnFedOnEntity = 17,
	ETigerPlayerEvent__OnPickedUpArtifact = 18,
	ETigerPlayerEvent__OnNewTrackingTrailSpawned = 19,
	ETigerPlayerEvent__OnAssistDowned = 20,
	ETigerPlayerEvent__OnAssistKill = 21,
	ETigerPlayerEvent__OnRevivedPlayer = 22,
	ETigerPlayerEvent__OnSurviveBloodHunted = 23,
	ETigerPlayerEvent__OnSurviveDownedState = 24,
	ETigerPlayerEvent__OnOpenedCrate = 25,
	ETigerPlayerEvent__OnFirstStoreBurglary = 26,
	ETigerPlayerEvent__OnWipedOtherGroup = 27,
	ETigerPlayerEvent__OnPickedUpCollectible = 28,
	ETigerPlayerEvent__Size        = 29,
	ETigerPlayerEvent__ETigerPlayerEvent_MAX = 30,

};

// Enum Tiger.ETigerSeasonExperienceSource
enum class Tiger_ETigerSeasonExperienceSource : uint8_t
{
	ETigerSeasonExperienceSource__Placement = 0,
	ETigerSeasonExperienceSource__PlacementBonus = 1,
	ETigerSeasonExperienceSource__SurvivalTime = 2,
	ETigerSeasonExperienceSource__DownedEnemies = 3,
	ETigerSeasonExperienceSource__Eliminations = 4,
	ETigerSeasonExperienceSource__Diableries = 5,
	ETigerSeasonExperienceSource__Assists = 6,
	ETigerSeasonExperienceSource__DamageDealt = 7,
	ETigerSeasonExperienceSource__EntityKilled = 8,
	ETigerSeasonExperienceSource__IngameAchievements = 9,
	ETigerSeasonExperienceSource__ChallengeRewards = 10,
	ETigerSeasonExperienceSource__Collectible = 11,
	ETigerSeasonExperienceSource__QuestRewards = 12,
	ETigerSeasonExperienceSource__Count = 13,
	ETigerSeasonExperienceSource__ETigerSeasonExperienceSource_MAX = 14,

};

// Enum Tiger.ETigerGrimoireEntryState
enum class Tiger_ETigerGrimoireEntryState : uint8_t
{
	ETigerGrimoireEntryState__Locked = 0,
	ETigerGrimoireEntryState__Unlocked = 1,
	ETigerGrimoireEntryState__Read = 2,
	ETigerGrimoireEntryState__ETigerGrimoireEntryState_MAX = 3,

};

// Enum Tiger.ETigerLoginStatus
enum class Tiger_ETigerLoginStatus : uint8_t
{
	ETigerLoginStatus__NotLoggedIn = 0,
	ETigerLoginStatus__LoggingIn   = 1,
	ETigerLoginStatus__LoggedIn    = 2,
	ETigerLoginStatus__ETigerLoginStatus_MAX = 3,

};

// Enum Tiger.ETigerVersionCheckStatus
enum class Tiger_ETigerVersionCheckStatus : uint8_t
{
	ETigerVersionCheckStatus__NotChecked = 0,
	ETigerVersionCheckStatus__Checking = 1,
	ETigerVersionCheckStatus__Validated = 2,
	ETigerVersionCheckStatus__ETigerVersionCheckStatus_MAX = 3,

};

// Enum Tiger.ETigerTraversalTransitionAction
enum class Tiger_ETigerTraversalTransitionAction : uint8_t
{
	ETigerTraversalTransitionAction__Jump = 0,
	ETigerTraversalTransitionAction__Crouch = 1,
	ETigerTraversalTransitionAction__OnMovementUpdated = 2,
	ETigerTraversalTransitionAction__OnMovementModeChanged = 3,
	ETigerTraversalTransitionAction__DeltaCorrection = 4,
	ETigerTraversalTransitionAction__InitialReplication = 5,
	ETigerTraversalTransitionAction__Climb = 6,
	ETigerTraversalTransitionAction__Downed = 7,
	ETigerTraversalTransitionAction__FromSavedMove = 8,
	ETigerTraversalTransitionAction__StartedForcedMove = 9,
	ETigerTraversalTransitionAction__Reset = 10,
	ETigerTraversalTransitionAction__ETigerTraversalTransitionAction_MAX = 11,

};

// Enum Tiger.ETigerTraversalState
enum class Tiger_ETigerTraversalState : uint8_t
{
	ETigerTraversalState__Walking  = 0,
	ETigerTraversalState__Falling  = 1,
	ETigerTraversalState__Jumping  = 2,
	ETigerTraversalState__WallGrinding = 3,
	ETigerTraversalState__WallJumping = 4,
	ETigerTraversalState__AirDashing = 5,
	ETigerTraversalState__Climbing = 6,
	ETigerTraversalState__LedgeGrabbing = 7,
	ETigerTraversalState__Sliding  = 8,
	ETigerTraversalState__Crouching = 9,
	ETigerTraversalState__SlideJump = 10,
	ETigerTraversalState__Downed   = 11,
	ETigerTraversalState__LowVault = 12,
	ETigerTraversalState__ForcedMove = 13,
	ETigerTraversalState__WallHang = 14,
	ETigerTraversalState__Count    = 15,
	ETigerTraversalState__ETigerTraversalState_MAX = 16,

};

// Enum Tiger.ETigerServerScalabilityTarget
enum class Tiger_ETigerServerScalabilityTarget : uint8_t
{
	ETigerServerScalabilityTarget__Target_10Hz = 0,
	ETigerServerScalabilityTarget__Target_20Hz = 1,
	ETigerServerScalabilityTarget__Target_30Hz = 2,
	ETigerServerScalabilityTarget__Target_MAX = 3,

};

// Enum Tiger.ETigerMatchState
enum class Tiger_ETigerMatchState : uint8_t
{
	ETigerMatchState__MatchNotStarted = 0,
	ETigerMatchState__MatchStarted = 1,
	ETigerMatchState__OneLastGroupAlive = 2,
	ETigerMatchState__CapturePointCaptured = 3,
	ETigerMatchState__MatchEnded   = 4,
	ETigerMatchState__ETigerMatchState_MAX = 5,

};

// Enum Tiger.ETigerPreMatchState
enum class Tiger_ETigerPreMatchState : uint8_t
{
	ETigerPreMatchState__Unknown   = 0,
	ETigerPreMatchState__WaitingForGroups = 1,
	ETigerPreMatchState__WaitingForPlayerConnections = 2,
	ETigerPreMatchState__RebalancingGroups = 3,
	ETigerPreMatchState__PreSpawnSelect = 4,
	ETigerPreMatchState__SpawnSelect = 5,
	ETigerPreMatchState__PostSpawnSelect = 6,
	ETigerPreMatchState__ArchetypeSelect = 7,
	ETigerPreMatchState__TeamView  = 8,
	ETigerPreMatchState__SpawnPawns = 9,
	ETigerPreMatchState__WaitingForLoadingPlayers = 10,
	ETigerPreMatchState__FreeLookPreparationCountdown = 11,
	ETigerPreMatchState__PreMatchEnded = 12,
	ETigerPreMatchState__ETigerPreMatchState_MAX = 13,

};

// Enum Tiger.EMatchBalanceMode
enum class Tiger_EMatchBalanceMode : uint8_t
{
	EMatchBalanceMode__Solo        = 0,
	EMatchBalanceMode__Group       = 1,
	EMatchBalanceMode__Count       = 2,
	EMatchBalanceMode__EMatchBalanceMode_MAX = 3,

};

// Enum Tiger.ETigerPlayerLifeStatus
enum class Tiger_ETigerPlayerLifeStatus : uint8_t
{
	ETigerPlayerLifeStatus__Alive  = 0,
	ETigerPlayerLifeStatus__Downed = 1,
	ETigerPlayerLifeStatus__Dead   = 2,
	ETigerPlayerLifeStatus__ETigerPlayerLifeStatus_MAX = 3,

};

// Enum Tiger.ETigerBloodType
enum class Tiger_ETigerBloodType : uint8_t
{
	ETigerBloodType__Choleric      = 0,
	ETigerBloodType__Melancholic   = 1,
	ETigerBloodType__Phlegmatic    = 2,
	ETigerBloodType__Sanguine      = 3,
	ETigerBloodType__Count         = 4,
	ETigerBloodType__ETigerBloodType_MAX = 5,

};

// Enum Tiger.ETigerBloodPotency
enum class Tiger_ETigerBloodPotency : uint8_t
{
	ETigerBloodPotency__Drained    = 0,
	ETigerBloodPotency__Normal     = 1,
	ETigerBloodPotency__Potent     = 2,
	ETigerBloodPotency__HighPotent = 3,
	ETigerBloodPotency__Count      = 4,
	ETigerBloodPotency__ETigerBloodPotency_MAX = 5,

};

// Enum Tiger.ETigerNPCType
enum class Tiger_ETigerNPCType : uint8_t
{
	ETigerNPCType__Civilian        = 0,
	ETigerNPCType__Guard           = 1,
	ETigerNPCType__Entity          = 2,
	ETigerNPCType__Judge           = 3,
	ETigerNPCType__Count           = 4,
	ETigerNPCType__ETigerNPCType_MAX = 5,

};

// Enum Tiger.ETigerDetachMethod
enum class Tiger_ETigerDetachMethod : uint8_t
{
	ETigerDetachMethod__Destroy    = 0,
	ETigerDetachMethod__Drop       = 1,
	ETigerDetachMethod__ETigerDetachMethod_MAX = 2,

};

// Enum Tiger.ETigerAIAnimationMode
enum class Tiger_ETigerAIAnimationMode : uint8_t
{
	ETigerAIAnimationMode__Neutral = 0,
	ETigerAIAnimationMode__Suspicious = 1,
	ETigerAIAnimationMode__Threatened = 2,
	ETigerAIAnimationMode__BloodDrained = 3,
	ETigerAIAnimationMode__Lured   = 4,
	ETigerAIAnimationMode__Downed  = 5,
	ETigerAIAnimationMode__Sprinting = 6,
	ETigerAIAnimationMode__Strafing = 7,
	ETigerAIAnimationMode__ETigerAIAnimationMode_MAX = 8,

};

// Enum Tiger.ETigerAIMasqueradeState
enum class Tiger_ETigerAIMasqueradeState : uint8_t
{
	ETigerAIMasqueradeState__None  = 0,
	ETigerAIMasqueradeState__Downed = 1,
	ETigerAIMasqueradeState__Suspicious = 2,
	ETigerAIMasqueradeState__Threatened = 3,
	ETigerAIMasqueradeState__Count = 4,
	ETigerAIMasqueradeState__ETigerAIMasqueradeState_MAX = 5,

};

// Enum Tiger.ETigerCivilianEmotionalState
enum class Tiger_ETigerCivilianEmotionalState : uint8_t
{
	ETigerCivilianEmotionalState__Neutral = 0,
	ETigerCivilianEmotionalState__Cocky = 1,
	ETigerCivilianEmotionalState__Disbelief = 2,
	ETigerCivilianEmotionalState__Drunk = 3,
	ETigerCivilianEmotionalState__Fearful = 4,
	ETigerCivilianEmotionalState__Flirty = 5,
	ETigerCivilianEmotionalState__Count = 6,
	ETigerCivilianEmotionalState__ETigerCivilianEmotionalState_MAX = 7,

};

// Enum Tiger.ETigerGameType
enum class Tiger_ETigerGameType : uint8_t
{
	ETigerGameType__Elysium        = 0,
	ETigerGameType__BattleRoyale   = 1,
	ETigerGameType__Tutorial       = 2,
	ETigerGameType__PvpArena       = 3,
	ETigerGameType__Benchmark      = 4,
	ETigerGameType__Invalid        = 5,
	ETigerGameType__ETigerGameType_MAX = 6,

};

// Enum Tiger.ESessionType
enum class Tiger_ESessionType : uint8_t
{
	ESessionType__Elysium          = 0,
	ESessionType__Match            = 1,
	ESessionType__Unknown          = 2,
	ESessionType__ESessionType_MAX = 3,

};

// Enum Tiger.ETigerClan
enum class Tiger_ETigerClan : uint8_t
{
	ETigerClan__Brujah             = 0,
	ETigerClan__Nosferatu          = 1,
	ETigerClan__Toreador           = 2,
	ETigerClan__Count              = 3,
	ETigerClan__ETigerClan_MAX     = 4,

};

// Enum Tiger.ETigerColourSpace
enum class Tiger_ETigerColourSpace : uint8_t
{
	ETigerColourSpace__LinearSpace = 0,
	ETigerColourSpace__SrgbSpace   = 1,
	ETigerColourSpace__ETigerColourSpace_MAX = 2,

};

// Enum Tiger.ETigerUIColor
enum class Tiger_ETigerUIColor : uint8_t
{
	ETigerUIColor__Masquerade_None = 0,
	ETigerUIColor__Masquerade_Suspicious = 1,
	ETigerUIColor__Masquerade_Threatened = 2,
	ETigerUIColor__Masquerade_BloodHunted = 3,
	ETigerUIColor__Ally            = 4,
	ETigerUIColor__GroupMember     = 5,
	ETigerUIColor__Crosshair_ActionText = 6,
	ETigerUIColor__Crosshair_ItemPickupDenied = 7,
	ETigerUIColor__Crosshair_ItemPickupDeniedInputKey = 8,
	ETigerUIColor__Text_Header_Orange = 9,
	ETigerUIColor__Text_Header_Red = 10,
	ETigerUIColor__Text_Header_DarkRed = 11,
	ETigerUIColor__Text_HardCurrency = 12,
	ETigerUIColor__Text_NeutralPlayerName = 13,
	ETigerUIColor__Text_PlayerTitle = 14,
	ETigerUIColor__Brand_MedallionYellow = 15,
	ETigerUIColor__Brand_SpurseBlue = 16,
	ETigerUIColor__Brand_JadeGreen = 17,
	ETigerUIColor__Brand_CarmineRed = 18,
	ETigerUIColor__Hitmarker_NoExtraHealth = 19,
	ETigerUIColor__Group_Player1   = 20,
	ETigerUIColor__Group_Player2   = 21,
	ETigerUIColor__Group_Player3   = 22,
	ETigerUIColor__Group_Player4   = 23,
	ETigerUIColor__Rarity_Common   = 24,
	ETigerUIColor__Rarity_Uncommon = 25,
	ETigerUIColor__Rarity_Rare     = 26,
	ETigerUIColor__Rarity_Epic     = 27,
	ETigerUIColor__Rarity_Legendary = 28,
	ETigerUIColor__Heal            = 29,
	ETigerUIColor__ItemType_Weapon = 30,
	ETigerUIColor__ItemType_Ammo   = 31,
	ETigerUIColor__ItemType_Mod    = 32,
	ETigerUIColor__ItemType_Healing = 33,
	ETigerUIColor__ItemType_Consumable = 34,
	ETigerUIColor__ItemType_Artifact = 35,
	ETigerUIColor__Count           = 36,
	ETigerUIColor__ETigerUIColor_MAX = 37,

};

// Enum Tiger.ETigerPersistentStoreCategory
enum class Tiger_ETigerPersistentStoreCategory : uint8_t
{
	ETigerPersistentStoreCategory__Featured = 0,
	ETigerPersistentStoreCategory__Apparel = 1,
	ETigerPersistentStoreCategory__Character = 2,
	ETigerPersistentStoreCategory__SkinColor = 3,
	ETigerPersistentStoreCategory__EyeBrows = 4,
	ETigerPersistentStoreCategory__EyebrowColors = 5,
	ETigerPersistentStoreCategory__EyebrowCategory = 6,
	ETigerPersistentStoreCategory__Beards = 7,
	ETigerPersistentStoreCategory__Hair = 8,
	ETigerPersistentStoreCategory__EyeColors = 9,
	ETigerPersistentStoreCategory__Accessories = 10,
	ETigerPersistentStoreCategory__Ink = 11,
	ETigerPersistentStoreCategory__Ethnicity = 12,
	ETigerPersistentStoreCategory__HairStyle = 13,
	ETigerPersistentStoreCategory__HairColor = 14,
	ETigerPersistentStoreCategory__FacialHair = 15,
	ETigerPersistentStoreCategory__FacialHairColor = 16,
	ETigerPersistentStoreCategory__FacePaint = 17,
	ETigerPersistentStoreCategory__Tattoo = 18,
	ETigerPersistentStoreCategory__Mask = 19,
	ETigerPersistentStoreCategory__Glasses = 20,
	ETigerPersistentStoreCategory__Body = 21,
	ETigerPersistentStoreCategory__BodyCategory = 22,
	ETigerPersistentStoreCategory__Emote = 23,
	ETigerPersistentStoreCategory__PlayerIcon = 24,
	ETigerPersistentStoreCategory__PlayerCardBackground = 25,
	ETigerPersistentStoreCategory__PlayerCardShape = 26,
	ETigerPersistentStoreCategory__Count = 27,
	ETigerPersistentStoreCategory__ETigerPersistentStoreCategory_MAX = 28,

};

// Enum Tiger.ETigerPlayerApperanceChangeReason
enum class Tiger_ETigerPlayerApperanceChangeReason : uint8_t
{
	ETigerPlayerApperanceChangeReason__Generic = 0,
	ETigerPlayerApperanceChangeReason__CharacterSwitch = 1,
	ETigerPlayerApperanceChangeReason__ETigerPlayerApperanceChangeReason_MAX = 2,

};

// Enum Tiger.ETigerSessionSearchStatus
enum class Tiger_ETigerSessionSearchStatus : uint8_t
{
	ETigerSessionSearchStatus__ReadyToSearch = 0,
	ETigerSessionSearchStatus__Searching = 1,
	ETigerSessionSearchStatus__SessionFound = 2,
	ETigerSessionSearchStatus__JoiningSession = 3,
	ETigerSessionSearchStatus__CouldNotFindSession = 4,
	ETigerSessionSearchStatus__CouldNotJoinSession = 5,
	ETigerSessionSearchStatus__ETigerSessionSearchStatus_MAX = 6,

};

// Enum Tiger.ETigerWorldCompositionGridLayout
enum class Tiger_ETigerWorldCompositionGridLayout : uint8_t
{
	ETigerWorldCompositionGridLayout__QuadTree = 0,
	ETigerWorldCompositionGridLayout__HexGrid = 1,
	ETigerWorldCompositionGridLayout__ETigerWorldCompositionGridLayout_MAX = 2,

};

// Enum Tiger.ETigerItemRarity
enum class Tiger_ETigerItemRarity : uint8_t
{
	ETigerItemRarity__TigerItemRarity_Common = 0,
	ETigerItemRarity__TigerItemRarity_Uncommon = 1,
	ETigerItemRarity__TigerItemRarity_Rare = 2,
	ETigerItemRarity__TigerItemRarity_Epic = 3,
	ETigerItemRarity__TigerItemRarity_Legendary = 4,
	ETigerItemRarity__TigerItemRarity_Size = 5,
	ETigerItemRarity__TigerItemRarity_MAX = 6,

};

// Enum Tiger.ETigerBloodResonanceBlockType
enum class Tiger_ETigerBloodResonanceBlockType : uint8_t
{
	ETigerBloodResonanceBlockType__BloodType = 0,
	ETigerBloodResonanceBlockType__ResonanceCap = 1,
	ETigerBloodResonanceBlockType__Count = 2,
	ETigerBloodResonanceBlockType__ETigerBloodResonanceBlockType_MAX = 3,

};

// Enum Tiger.ETigerBloodVeinAlternateAction
enum class Tiger_ETigerBloodVeinAlternateAction : uint8_t
{
	ETigerBloodVeinAlternateAction__None = 0,
	ETigerBloodVeinAlternateAction__LaunchSolo = 1,
	ETigerBloodVeinAlternateAction__RejoinGroupLaunch = 2,
	ETigerBloodVeinAlternateAction__PassCoterieNavigator = 3,
	ETigerBloodVeinAlternateAction__ETigerBloodVeinAlternateAction_MAX = 4,

};

// Enum Tiger.ETigerSelectNewSpectatorDirection
enum class Tiger_ETigerSelectNewSpectatorDirection : uint8_t
{
	ETigerSelectNewSpectatorDirection__Next = 0,
	ETigerSelectNewSpectatorDirection__Previous = 1,
	ETigerSelectNewSpectatorDirection__ETigerSelectNewSpectatorDirection_MAX = 2,

};

// Enum Tiger.ETigerMissionSuccessRating
enum class Tiger_ETigerMissionSuccessRating : uint8_t
{
	ETigerMissionSuccessRating__Abject_Failure = 0,
	ETigerMissionSuccessRating__Failure = 1,
	ETigerMissionSuccessRating__Slight_Failure = 2,
	ETigerMissionSuccessRating__Success = 3,
	ETigerMissionSuccessRating__Good = 4,
	ETigerMissionSuccessRating__Very_Good = 5,
	ETigerMissionSuccessRating__Perfect = 6,
	ETigerMissionSuccessRating__Minted = 7,
	ETigerMissionSuccessRating__Double_Minted = 8,
	ETigerMissionSuccessRating__ETigerMissionSuccessRating_MAX = 9,

};

// Enum Tiger.ETigerCustomizePart
enum class Tiger_ETigerCustomizePart : uint8_t
{
	ETigerCustomizePart__Outfit    = 0,
	ETigerCustomizePart__BodyType  = 1,
	ETigerCustomizePart__Head      = 2,
	ETigerCustomizePart__SkinColor = 3,
	ETigerCustomizePart__HairType  = 4,
	ETigerCustomizePart__HairColor = 5,
	ETigerCustomizePart__Eyes      = 6,
	ETigerCustomizePart__Tattoo    = 7,
	ETigerCustomizePart__Makeup    = 8,
	ETigerCustomizePart__BeardType = 9,
	ETigerCustomizePart__BeardColor = 10,
	ETigerCustomizePart__Count     = 11,
	ETigerCustomizePart__ETigerCustomizePart_MAX = 12,

};

// Enum Tiger.ETigerNewNotificationMenuOptions
enum class Tiger_ETigerNewNotificationMenuOptions : uint8_t
{
	ETigerNewNotificationMenuOptions__Rootmenu = 0,
	ETigerNewNotificationMenuOptions__LandingPage = 1,
	ETigerNewNotificationMenuOptions__Battlepass = 2,
	ETigerNewNotificationMenuOptions__Challenges = 3,
	ETigerNewNotificationMenuOptions__Challenges_Daily = 4,
	ETigerNewNotificationMenuOptions__Challenges_Weekly = 5,
	ETigerNewNotificationMenuOptions__Grimoire = 6,
	ETigerNewNotificationMenuOptions__Grimoire_Archetypes = 7,
	ETigerNewNotificationMenuOptions__Grimoire_Talents = 8,
	ETigerNewNotificationMenuOptions__Grimoire_Items = 9,
	ETigerNewNotificationMenuOptions__Grimoire_Locations = 10,
	ETigerNewNotificationMenuOptions__Grimoire_Lore = 11,
	ETigerNewNotificationMenuOptions__Grimoire_Characters = 12,
	ETigerNewNotificationMenuOptions__Grimoire_Collectibles = 13,
	ETigerNewNotificationMenuOptions__Grimoire_Tutorial = 14,
	ETigerNewNotificationMenuOptions__Bloodtrack = 15,
	ETigerNewNotificationMenuOptions__Inventory = 16,
	ETigerNewNotificationMenuOptions__Inventory_Character = 17,
	ETigerNewNotificationMenuOptions__Inventory_Body = 18,
	ETigerNewNotificationMenuOptions__Inventory_BodyType = 19,
	ETigerNewNotificationMenuOptions__Inventory_Head = 20,
	ETigerNewNotificationMenuOptions__Inventory_Hair = 21,
	ETigerNewNotificationMenuOptions__Inventory_Haircut = 22,
	ETigerNewNotificationMenuOptions__Inventory_HairColor = 23,
	ETigerNewNotificationMenuOptions__Inventory_Eyes = 24,
	ETigerNewNotificationMenuOptions__Inventory_Eyebrows = 25,
	ETigerNewNotificationMenuOptions__Inventory_EyebrowType = 26,
	ETigerNewNotificationMenuOptions__Inventory_EyebrowColor = 27,
	ETigerNewNotificationMenuOptions__Inventory_Makeup = 28,
	ETigerNewNotificationMenuOptions__Inventory_Tattoos = 29,
	ETigerNewNotificationMenuOptions__Inventory_FacialHair = 30,
	ETigerNewNotificationMenuOptions__Inventory_FacialHairType = 31,
	ETigerNewNotificationMenuOptions__Inventory_FacialHairColor = 32,
	ETigerNewNotificationMenuOptions__Inventory_Wardrobe = 33,
	ETigerNewNotificationMenuOptions__Inventory_Outfit = 34,
	ETigerNewNotificationMenuOptions__Inventory_Accessories = 35,
	ETigerNewNotificationMenuOptions__Inventory_Piercing = 36,
	ETigerNewNotificationMenuOptions__Inventory_Mask = 37,
	ETigerNewNotificationMenuOptions__Inventory_Glasses = 38,
	ETigerNewNotificationMenuOptions__Inventory_Hats = 39,
	ETigerNewNotificationMenuOptions__Inventory_Emotes = 40,
	ETigerNewNotificationMenuOptions__StoreMenu = 41,
	ETigerNewNotificationMenuOptions__Store_Flash = 42,
	ETigerNewNotificationMenuOptions__Store_Currency = 43,
	ETigerNewNotificationMenuOptions__ArchetypeSelect = 44,
	ETigerNewNotificationMenuOptions__Social = 45,
	ETigerNewNotificationMenuOptions__Social_Friends = 46,
	ETigerNewNotificationMenuOptions__Social_Elysium = 47,
	ETigerNewNotificationMenuOptions__Social_Invites = 48,
	ETigerNewNotificationMenuOptions__Social_GroupInvites = 49,
	ETigerNewNotificationMenuOptions__Social_FriendInvites = 50,
	ETigerNewNotificationMenuOptions__Thralls = 51,
	ETigerNewNotificationMenuOptions__Grimoire_Conversations = 52,
	ETigerNewNotificationMenuOptions__Inventory_Icon = 53,
	ETigerNewNotificationMenuOptions__Inventory_CardBackground = 54,
	ETigerNewNotificationMenuOptions__Count = 55,
	ETigerNewNotificationMenuOptions__None = 56,
	ETigerNewNotificationMenuOptions__ETigerNewNotificationMenuOptions_MAX = 57,

};

// Enum Tiger.ETigerGrimoireSortType
enum class Tiger_ETigerGrimoireSortType : uint8_t
{
	ETigerGrimoireSortType__Default = 0,
	ETigerGrimoireSortType__Alphabetical = 1,
	ETigerGrimoireSortType__Unread = 2,
	ETigerGrimoireSortType__ETigerGrimoireSortType_MAX = 3,

};

// Enum Tiger.ETigerChatMessageCategory
enum class Tiger_ETigerChatMessageCategory : uint8_t
{
	ETigerChatMessageCategory__Unknown = 0,
	ETigerChatMessageCategory__General = 1,
	ETigerChatMessageCategory__Group = 2,
	ETigerChatMessageCategory__Server = 3,
	ETigerChatMessageCategory__Game = 4,
	ETigerChatMessageCategory__ChatBanned = 5,
	ETigerChatMessageCategory__ETigerChatMessageCategory_MAX = 6,

};

// Enum Tiger.ETigerIsDedicatedServer
enum class Tiger_ETigerIsDedicatedServer : uint8_t
{
	ETigerIsDedicatedServer__DedicatedServer = 0,
	ETigerIsDedicatedServer__Other = 1,
	ETigerIsDedicatedServer__ETigerIsDedicatedServer_MAX = 2,

};

// Enum Tiger.ETigerDamageCauser
enum class Tiger_ETigerDamageCauser : uint8_t
{
	ETigerDamageCauser__Unknown    = 0,
	ETigerDamageCauser__HolyIncense = 1,
	ETigerDamageCauser__Water      = 2,
	ETigerDamageCauser__Helicopter = 3,
	ETigerDamageCauser__NPC        = 4,
	ETigerDamageCauser__Player     = 5,
	ETigerDamageCauser__Trigger    = 6,
	ETigerDamageCauser__ETigerDamageCauser_MAX = 7,

};

// Enum Tiger.ETigerSignificanceBudgetType
enum class Tiger_ETigerSignificanceBudgetType : uint8_t
{
	ETigerSignificanceBudgetType__Elysium = 0,
	ETigerSignificanceBudgetType__Match = 1,
	ETigerSignificanceBudgetType__Count = 2,
	ETigerSignificanceBudgetType__ETigerSignificanceBudgetType_MAX = 3,

};

// Enum Tiger.ETigerWeaponFireMode
enum class Tiger_ETigerWeaponFireMode : uint8_t
{
	ETigerWeaponFireMode__Single   = 0,
	ETigerWeaponFireMode__Burst    = 1,
	ETigerWeaponFireMode__Automatic = 2,
	ETigerWeaponFireMode__Count    = 3,
	ETigerWeaponFireMode__ETigerWeaponFireMode_MAX = 4,

};

// Enum Tiger.ETigerSpreadIncreaseMode
enum class Tiger_ETigerSpreadIncreaseMode : uint8_t
{
	ETigerSpreadIncreaseMode__Add  = 0,
	ETigerSpreadIncreaseMode__Multiply = 1,
	ETigerSpreadIncreaseMode__ETigerSpreadIncreaseMode_MAX = 2,

};

// Enum Tiger.ETigerFireAudioState
enum class Tiger_ETigerFireAudioState : uint8_t
{
	ETigerFireAudioState__Idle     = 0,
	ETigerFireAudioState__Firing   = 1,
	ETigerFireAudioState__FiringLoopAudio = 2,
	ETigerFireAudioState__ETigerFireAudioState_MAX = 3,

};

// Enum Tiger.ETigerAsyncMoveResult
enum class Tiger_ETigerAsyncMoveResult : uint8_t
{
	ETigerAsyncMoveResult__SuccessfullyStartedAsyncRequest = 0,
	ETigerAsyncMoveResult__Failed  = 1,
	ETigerAsyncMoveResult__ETigerAsyncMoveResult_MAX = 2,

};

// Enum Tiger.ETigerBotWeaponPowerState
enum class Tiger_ETigerBotWeaponPowerState : uint8_t
{
	ETigerBotWeaponPowerState__PowerAvailable = 0,
	ETigerBotWeaponPowerState__PowerInUse = 1,
	ETigerBotWeaponPowerState__PowerOnCooldown = 2,
	ETigerBotWeaponPowerState__ETigerBotWeaponPowerState_MAX = 3,

};

// Enum Tiger.ETigerEntityEvent
enum class Tiger_ETigerEntityEvent : uint8_t
{
	ETigerEntityEvent__NewThreatEnterCombat = 0,
	ETigerEntityEvent__NewThreatInCombat = 1,
	ETigerEntityEvent__Count       = 2,
	ETigerEntityEvent__ETigerEntityEvent_MAX = 3,

};

// Enum Tiger.ETigerNpcSquadOrder
enum class Tiger_ETigerNpcSquadOrder : uint8_t
{
	ETigerNpcSquadOrder__FollowCaptain = 0,
	ETigerNpcSquadOrder__HoldPosition = 1,
	ETigerNpcSquadOrder__OpenFire  = 2,
	ETigerNpcSquadOrder__ETigerNpcSquadOrder_MAX = 3,

};

// Enum Tiger.ETigerNpcMovementRestrictionBoundsArea
enum class Tiger_ETigerNpcMovementRestrictionBoundsArea : uint8_t
{
	ETigerNpcMovementRestrictionBoundsArea__InnerRestriction = 0,
	ETigerNpcMovementRestrictionBoundsArea__OuterRestriction = 1,
	ETigerNpcMovementRestrictionBoundsArea__OutOfBounds = 2,
	ETigerNpcMovementRestrictionBoundsArea__ETigerNpcMovementRestrictionBoundsArea_MAX = 3,

};

// Enum Tiger.ETigerJudgeRotationMode
enum class Tiger_ETigerJudgeRotationMode : uint8_t
{
	ETigerJudgeRotationMode__RotateTowardsPrimaryTarget = 0,
	ETigerJudgeRotationMode__RotateTowardsLocation = 1,
	ETigerJudgeRotationMode__RotateTowardsMovement = 2,
	ETigerJudgeRotationMode__NoForcedRotation = 3,
	ETigerJudgeRotationMode__Count = 4,
	ETigerJudgeRotationMode__ETigerJudgeRotationMode_MAX = 5,

};

// Enum Tiger.ETigerPatrollingHelicopterEventType
enum class Tiger_ETigerPatrollingHelicopterEventType : uint8_t
{
	ETigerPatrollingHelicopterEventType__BloodHunt = 0,
	ETigerPatrollingHelicopterEventType__RooftopGunFight = 1,
	ETigerPatrollingHelicopterEventType__ETigerPatrollingHelicopterEventType_MAX = 2,

};

// Enum Tiger.ETigerAiMovementReason
enum class Tiger_ETigerAiMovementReason : uint8_t
{
	ETigerAiMovementReason__GenericMovement = 0,
	ETigerAiMovementReason__ThreatMovement = 1,
	ETigerAiMovementReason__CapMovement = 2,
	ETigerAiMovementReason__Count  = 3,
	ETigerAiMovementReason__ETigerAiMovementReason_MAX = 4,

};

// Enum Tiger.ETigerNpcReactionEventSeverity
enum class Tiger_ETigerNpcReactionEventSeverity : uint8_t
{
	ETigerNpcReactionEventSeverity__Mild = 0,
	ETigerNpcReactionEventSeverity__Average = 1,
	ETigerNpcReactionEventSeverity__Severe = 2,
	ETigerNpcReactionEventSeverity__ETigerNpcReactionEventSeverity_MAX = 3,

};

// Enum Tiger.ETigerAiConditionCheckTiming
enum class Tiger_ETigerAiConditionCheckTiming : uint8_t
{
	ETigerAiConditionCheckTiming__OnConditionCommandStart = 0,
	ETigerAiConditionCheckTiming__OnConditionCommandEnd = 1,
	ETigerAiConditionCheckTiming__ETigerAiConditionCheckTiming_MAX = 2,

};

// Enum Tiger.ETigerAiFailedCAPConditionAction
enum class Tiger_ETigerAiFailedCAPConditionAction : uint8_t
{
	ETigerAiFailedCAPConditionAction__ExitCAP = 0,
	ETigerAiFailedCAPConditionAction__RedoLastCommand = 1,
	ETigerAiFailedCAPConditionAction__RestartCommandList = 2,
	ETigerAiFailedCAPConditionAction__Wait = 3,
	ETigerAiFailedCAPConditionAction__ETigerAiFailedCAPConditionAction_MAX = 4,

};

// Enum Tiger.ETigerJumpDistribution
enum class Tiger_ETigerJumpDistribution : uint8_t
{
	ETigerJumpDistribution__Random = 0,
	ETigerJumpDistribution__Early  = 1,
	ETigerJumpDistribution__Late   = 2,
	ETigerJumpDistribution__Middle = 3,
	ETigerJumpDistribution__ETigerJumpDistribution_MAX = 4,

};

// Enum Tiger.ETigerAnimBlendState
enum class Tiger_ETigerAnimBlendState : uint8_t
{
	ETigerAnimBlendState__BlendingIn = 0,
	ETigerAnimBlendState__BlendingOut = 1,
	ETigerAnimBlendState__FullyBlended = 2,
	ETigerAnimBlendState__ETigerAnimBlendState_MAX = 3,

};

// Enum Tiger.ETigerIKDirection
enum class Tiger_ETigerIKDirection : uint8_t
{
	ETigerIKDirection__Forward     = 0,
	ETigerIKDirection__Downward    = 1,
	ETigerIKDirection__ETigerIKDirection_MAX = 2,

};

// Enum Tiger.ETigerPlayOnClients
enum class Tiger_ETigerPlayOnClients : uint8_t
{
	ETigerPlayOnClients__PlayOnSelf = 0,
	ETigerPlayOnClients__PlayOnOthers = 1,
	ETigerPlayOnClients__PlayOnAll = 2,
	ETigerPlayOnClients__ETigerPlayOnClients_MAX = 3,

};

// Enum Tiger.ETigerTriggerUpdateWpnAppearance
enum class Tiger_ETigerTriggerUpdateWpnAppearance : uint8_t
{
	ETigerTriggerUpdateWpnAppearance__None = 0,
	ETigerTriggerUpdateWpnAppearance__Begin = 1,
	ETigerTriggerUpdateWpnAppearance__End = 2,
	ETigerTriggerUpdateWpnAppearance__ETigerTriggerUpdateWpnAppearance_MAX = 3,

};

// Enum Tiger.ETigerArchetypeSelectUiState
enum class Tiger_ETigerArchetypeSelectUiState : uint8_t
{
	ETigerArchetypeSelectUiState__PreSelection = 0,
	ETigerArchetypeSelectUiState__Player0 = 1,
	ETigerArchetypeSelectUiState__Player1 = 2,
	ETigerArchetypeSelectUiState__Player2 = 3,
	ETigerArchetypeSelectUiState__PostSelection = 4,
	ETigerArchetypeSelectUiState__ETigerArchetypeSelectUiState_MAX = 5,

};

// Enum Tiger.ETigerBloodTrackPassivePowerIncrease
enum class Tiger_ETigerBloodTrackPassivePowerIncrease : uint8_t
{
	ETigerBloodTrackPassivePowerIncrease__None = 0,
	ETigerBloodTrackPassivePowerIncrease__LevelDisciplineClan = 1,
	ETigerBloodTrackPassivePowerIncrease__LevelDisciplineArchetype = 2,
	ETigerBloodTrackPassivePowerIncrease__LevelPassives = 3,
	ETigerBloodTrackPassivePowerIncrease__Unused = 4,
	ETigerBloodTrackPassivePowerIncrease__ETigerBloodTrackPassivePowerIncrease_MAX = 5,

};

// Enum Tiger.ETigerBloodTrackPassiveCategory
enum class Tiger_ETigerBloodTrackPassiveCategory : uint8_t
{
	ETigerBloodTrackPassiveCategory__Archetype = 0,
	ETigerBloodTrackPassiveCategory__General = 1,
	ETigerBloodTrackPassiveCategory__HealthUpgrade = 2,
	ETigerBloodTrackPassiveCategory__UltimatePredator = 3,
	ETigerBloodTrackPassiveCategory__UnlockPowers = 4,
	ETigerBloodTrackPassiveCategory__Count = 5,
	ETigerBloodTrackPassiveCategory__ETigerBloodTrackPassiveCategory_MAX = 6,

};

// Enum Tiger.ETigerBuffProgressType
enum class Tiger_ETigerBuffProgressType : uint8_t
{
	ETigerBuffProgressType__Increase = 0,
	ETigerBuffProgressType__Decrease = 1,
	ETigerBuffProgressType__ETigerBuffProgressType_MAX = 2,

};

// Enum Tiger.ETigerBuffStatusType
enum class Tiger_ETigerBuffStatusType : uint8_t
{
	ETigerBuffStatusType__Neutral  = 0,
	ETigerBuffStatusType__Positive = 1,
	ETigerBuffStatusType__Negative = 2,
	ETigerBuffStatusType__ETigerBuffStatusType_MAX = 3,

};

// Enum Tiger.UTigerBuildingSide
enum class Tiger_EUTigerBuildingSide : uint8_t
{
	UTigerBuildingSide__Front      = 0,
	UTigerBuildingSide__Left       = 1,
	UTigerBuildingSide__Back       = 2,
	UTigerBuildingSide__Right      = 3,
	UTigerBuildingSide__UTigerBuildingSide_MAX = 4,

};

// Enum Tiger.ETigerCameraPresetModeAdditive
enum class Tiger_ETigerCameraPresetModeAdditive : uint8_t
{
	ETigerCameraPresetModeAdditive__Crouching = 0,
	ETigerCameraPresetModeAdditive__Running = 1,
	ETigerCameraPresetModeAdditive__Combat = 2,
	ETigerCameraPresetModeAdditive__Sliding = 3,
	ETigerCameraPresetModeAdditive__Count = 4,
	ETigerCameraPresetModeAdditive__ETigerCameraPresetModeAdditive_MAX = 5,

};

// Enum Tiger.ETigerCapturePointStatus
enum class Tiger_ETigerCapturePointStatus : uint8_t
{
	ETigerCapturePointStatus__YouCapturing = 0,
	ETigerCapturePointStatus__EnemyCapturing = 1,
	ETigerCapturePointStatus__ContestedWithCapturee = 2,
	ETigerCapturePointStatus__ContestedWithoutCapturee = 3,
	ETigerCapturePointStatus__None = 4,
	ETigerCapturePointStatus__ETigerCapturePointStatus_MAX = 5,

};

// Enum Tiger.ETigerAkCharacterGender
enum class Tiger_ETigerAkCharacterGender : uint8_t
{
	ETigerAkCharacterGender__Male  = 0,
	ETigerAkCharacterGender__Female = 1,
	ETigerAkCharacterGender__Count = 2,
	ETigerAkCharacterGender__ETigerAkCharacterGender_MAX = 3,

};

// Enum Tiger.ETigerCustomizationType
enum class Tiger_ETigerCustomizationType : uint8_t
{
	ETigerCustomizationType__None  = 0,
	ETigerCustomizationType__Outfits = 1,
	ETigerCustomizationType__Heads = 2,
	ETigerCustomizationType__Hairs = 3,
	ETigerCustomizationType__HairColors = 4,
	ETigerCustomizationType__EyeColors = 5,
	ETigerCustomizationType__Tattoos = 6,
	ETigerCustomizationType__FacePaints = 7,
	ETigerCustomizationType__PiercingSets = 8,
	ETigerCustomizationType__Headgears = 9,
	ETigerCustomizationType__Eyewears = 10,
	ETigerCustomizationType__Eyebrows = 11,
	ETigerCustomizationType__EyebrowColors = 12,
	ETigerCustomizationType__Beards = 13,
	ETigerCustomizationType__BeardColors = 14,
	ETigerCustomizationType__CharacterCardShapes = 15,
	ETigerCustomizationType__CharacterCardTextures = 16,
	ETigerCustomizationType__CharacterIcons = 17,
	ETigerCustomizationType__Emotes = 18,
	ETigerCustomizationType__All   = 19,
	ETigerCustomizationType__ETigerCustomizationType_MAX = 20,

};

// Enum Tiger.ETigerForcedMoveResult
enum class Tiger_ETigerForcedMoveResult : uint8_t
{
	ETigerForcedMoveResult__Finished = 0,
	ETigerForcedMoveResult__Overridden = 1,
	ETigerForcedMoveResult__Canceled = 2,
	ETigerForcedMoveResult__ETigerForcedMoveResult_MAX = 3,

};

// Enum Tiger.ETigerMovementMode
enum class Tiger_ETigerMovementMode : uint8_t
{
	ETigerMovementMode__None       = 0,
	ETigerMovementMode__Sliding    = 1,
	ETigerMovementMode__ETigerMovementMode_MAX = 2,

};

// Enum Tiger.ETigerEquippedWeaponType
enum class Tiger_ETigerEquippedWeaponType : uint8_t
{
	ETigerEquippedWeaponType__TigerEquippedWeaponType_NoWeapon = 0,
	ETigerEquippedWeaponType__TigerEquippedWeaponType_Ranged = 1,
	ETigerEquippedWeaponType__TigerEquippedWeaponType_Melee = 2,
	ETigerEquippedWeaponType__TigerEquippedWeaponType_MAX = 3,

};

// Enum Tiger.ETigerQuickUseConsumable
enum class Tiger_ETigerQuickUseConsumable : uint8_t
{
	ETigerQuickUseConsumable__Syringe = 0,
	ETigerQuickUseConsumable__Bloodbag = 1,
	ETigerQuickUseConsumable__Armor = 2,
	ETigerQuickUseConsumable__Stimpack = 3,
	ETigerQuickUseConsumable__UnholyStimulant = 4,
	ETigerQuickUseConsumable__Flare = 5,
	ETigerQuickUseConsumable__Count = 6,
	ETigerQuickUseConsumable__ETigerQuickUseConsumable_MAX = 7,

};

// Enum Tiger.ETigerContextualHelpShouldShowInGameMode
enum class Tiger_ETigerContextualHelpShouldShowInGameMode : uint8_t
{
	ETigerContextualHelpShouldShowInGameMode__TutorialOnly = 0,
	ETigerContextualHelpShouldShowInGameMode__MatchOnly = 1,
	ETigerContextualHelpShouldShowInGameMode__All = 2,
	ETigerContextualHelpShouldShowInGameMode__ETigerContextualHelpShouldShowInGameMode_MAX = 3,

};

// Enum Tiger.ETigerContextualHelpType
enum class Tiger_ETigerContextualHelpType : uint8_t
{
	ETigerContextualHelpType__Reminder = 0,
	ETigerContextualHelpType__Interaction = 1,
	ETigerContextualHelpType__Count = 2,
	ETigerContextualHelpType__ETigerContextualHelpType_MAX = 3,

};

// Enum Tiger.ETigerDesiredPawnType
enum class Tiger_ETigerDesiredPawnType : uint8_t
{
	ETigerDesiredPawnType__DefaultPawn = 0,
	ETigerDesiredPawnType__BloodVeinPawn = 1,
	ETigerDesiredPawnType__ETigerDesiredPawnType_MAX = 2,

};

// Enum Tiger.ETigerDisciplineCharmState
enum class Tiger_ETigerDisciplineCharmState : uint8_t
{
	ETigerDisciplineCharmState__Ready = 0,
	ETigerDisciplineCharmState__Bonding = 1,
	ETigerDisciplineCharmState__ETigerDisciplineCharmState_MAX = 2,

};

// Enum Tiger.ETigerDisciplineCanUseResult
enum class Tiger_ETigerDisciplineCanUseResult : uint8_t
{
	ETigerDisciplineCanUseResult__UseAllowed = 0,
	ETigerDisciplineCanUseResult__FailedDisciplineOutOfBounds = 1,
	ETigerDisciplineCanUseResult__FailedBlockingDiscipline = 2,
	ETigerDisciplineCanUseResult__FailedDoesNotExist = 3,
	ETigerDisciplineCanUseResult__FailedLocked = 4,
	ETigerDisciplineCanUseResult__FailedIsPassive = 5,
	ETigerDisciplineCanUseResult__FailedDisciplineRequirements = 6,
	ETigerDisciplineCanUseResult__FailedOnCooldown = 7,
	ETigerDisciplineCanUseResult__FailedOnCharges = 8,
	ETigerDisciplineCanUseResult__FailedInteract = 9,
	ETigerDisciplineCanUseResult__FailedChargingAttack = 10,
	ETigerDisciplineCanUseResult__FailedMeleeSwing = 11,
	ETigerDisciplineCanUseResult__FailedBuffBlocking = 12,
	ETigerDisciplineCanUseResult__ETigerDisciplineCanUseResult_MAX = 13,

};

// Enum Tiger.ETigerActionAllowed
enum class Tiger_ETigerActionAllowed : uint8_t
{
	ETigerActionAllowed__Allowed   = 0,
	ETigerActionAllowed__Blocked   = 1,
	ETigerActionAllowed__Cancel    = 2,
	ETigerActionAllowed__None      = 3,
	ETigerActionAllowed__ETigerActionAllowed_MAX = 4,

};

// Enum Tiger.ETigerFOTTStage
enum class Tiger_ETigerFOTTStage : uint8_t
{
	ETigerFOTTStage__ChargeUp      = 0,
	ETigerFOTTStage__Charged       = 1,
	ETigerFOTTStage__Attacking     = 2,
	ETigerFOTTStage__Recover       = 3,
	ETigerFOTTStage__Count         = 4,
	ETigerFOTTStage__ETigerFOTTStage_MAX = 5,

};

// Enum Tiger.ETigerDisciplineParticleStrategyColorModes
enum class Tiger_ETigerDisciplineParticleStrategyColorModes : uint8_t
{
	ETigerDisciplineParticleStrategyColorModes__Default = 0,
	ETigerDisciplineParticleStrategyColorModes__OverrideFriendlyOnly = 1,
	ETigerDisciplineParticleStrategyColorModes__OverrideEnemyOnly = 2,
	ETigerDisciplineParticleStrategyColorModes__OverrideBothSingleColor = 3,
	ETigerDisciplineParticleStrategyColorModes__OverrideBothSplitColor = 4,
	ETigerDisciplineParticleStrategyColorModes__ETigerDisciplineParticleStrategyColorModes_MAX = 5,

};

// Enum Tiger.ETigerPassionStage
enum class Tiger_ETigerPassionStage : uint8_t
{
	ETigerPassionStage__ChooseEffect = 0,
	ETigerPassionStage__ChargeEffect = 1,
	ETigerPassionStage__Count      = 2,
	ETigerPassionStage__ETigerPassionStage_MAX = 3,

};

// Enum Tiger.ETigerPassionEffect
enum class Tiger_ETigerPassionEffect : uint8_t
{
	ETigerPassionEffect__None      = 0,
	ETigerPassionEffect__Panic     = 1,
	ETigerPassionEffect__Apathy    = 2,
	ETigerPassionEffect__Wrath     = 3,
	ETigerPassionEffect__Count     = 4,
	ETigerPassionEffect__ETigerPassionEffect_MAX = 5,

};

// Enum Tiger.ETigerProjectionDashCooldownStart
enum class Tiger_ETigerProjectionDashCooldownStart : uint8_t
{
	ETigerProjectionDashCooldownStart__AfterProjectionSpawned = 0,
	ETigerProjectionDashCooldownStart__AfterDash = 1,
	ETigerProjectionDashCooldownStart__ETigerProjectionDashCooldownStart_MAX = 2,

};

// Enum Tiger.ETigerProjectionDashEndReason
enum class Tiger_ETigerProjectionDashEndReason : uint8_t
{
	ETigerProjectionDashEndReason__TimedOut = 0,
	ETigerProjectionDashEndReason__MaxDistanceReached = 1,
	ETigerProjectionDashEndReason__ETigerProjectionDashEndReason_MAX = 2,

};

// Enum Tiger.ETigerJudgeHelicopterSpotlightState
enum class Tiger_ETigerJudgeHelicopterSpotlightState : uint8_t
{
	ETigerJudgeHelicopterSpotlightState__InCombat = 0,
	ETigerJudgeHelicopterSpotlightState__Idling = 1,
	ETigerJudgeHelicopterSpotlightState__ETigerJudgeHelicopterSpotlightState_MAX = 2,

};

// Enum Tiger.ETigerPatrollingHelicopterSpotlightState
enum class Tiger_ETigerPatrollingHelicopterSpotlightState : uint8_t
{
	ETigerPatrollingHelicopterSpotlightState__TargetInSight = 0,
	ETigerPatrollingHelicopterSpotlightState__Searching = 1,
	ETigerPatrollingHelicopterSpotlightState__Idling = 2,
	ETigerPatrollingHelicopterSpotlightState__ETigerPatrollingHelicopterSpotlightState_MAX = 3,

};

// Enum Tiger.ETigerPatrollingHelicopterState
enum class Tiger_ETigerPatrollingHelicopterState : uint8_t
{
	ETigerPatrollingHelicopterState__Patrolling = 0,
	ETigerPatrollingHelicopterState__TrackingPlayer = 1,
	ETigerPatrollingHelicopterState__LostPlayer = 2,
	ETigerPatrollingHelicopterState__ETigerPatrollingHelicopterState_MAX = 3,

};

// Enum Tiger.ETigerFeedingState
enum class Tiger_ETigerFeedingState : uint8_t
{
	ETigerFeedingState__Inactive   = 0,
	ETigerFeedingState__StartFeeding = 1,
	ETigerFeedingState__Approach   = 2,
	ETigerFeedingState__Feeding    = 3,
	ETigerFeedingState__Decouple   = 4,
	ETigerFeedingState__FedOnApproach = 5,
	ETigerFeedingState__FedOn      = 6,
	ETigerFeedingState__FedOnDecouple = 7,
	ETigerFeedingState__ETigerFeedingState_MAX = 8,

};

// Enum Tiger.ETigerFriendLoadStatus
enum class Tiger_ETigerFriendLoadStatus : uint8_t
{
	ETigerFriendLoadStatus__Unloaded = 0,
	ETigerFriendLoadStatus__Loading = 1,
	ETigerFriendLoadStatus__Loaded = 2,
	ETigerFriendLoadStatus__LoadFailed = 3,
	ETigerFriendLoadStatus__ETigerFriendLoadStatus_MAX = 4,

};

// Enum Tiger.ETigerGraphicsSettingPreset
enum class Tiger_ETigerGraphicsSettingPreset : uint8_t
{
	ETigerGraphicsSettingPreset__Low = 0,
	ETigerGraphicsSettingPreset__Mid = 1,
	ETigerGraphicsSettingPreset__High = 2,
	ETigerGraphicsSettingPreset__Ultra = 3,
	ETigerGraphicsSettingPreset__ETigerGraphicsSettingPreset_MAX = 4,

};

// Enum Tiger.ETigerCurrentGameFlowState
enum class Tiger_ETigerCurrentGameFlowState : uint8_t
{
	ETigerCurrentGameFlowState__CharacterSelect = 0,
	ETigerCurrentGameFlowState__LoadingElysium = 1,
	ETigerCurrentGameFlowState__Elysium = 2,
	ETigerCurrentGameFlowState__LoadingPrague = 3,
	ETigerCurrentGameFlowState__StreamingPrague = 4,
	ETigerCurrentGameFlowState__LoadingCharacter = 5,
	ETigerCurrentGameFlowState__Waiting_Or_PreSpawn = 6,
	ETigerCurrentGameFlowState__SpawningMechanic = 7,
	ETigerCurrentGameFlowState__Spawned = 8,
	ETigerCurrentGameFlowState__EndGame = 9,
	ETigerCurrentGameFlowState__LoadingPragueToElysiumLimbo = 10,
	ETigerCurrentGameFlowState__PragueToElysiumLimbo = 11,
	ETigerCurrentGameFlowState__ETigerCurrentGameFlowState_MAX = 12,

};

// Enum Tiger.ETigerGrimoireArticleType
enum class Tiger_ETigerGrimoireArticleType : uint8_t
{
	ETigerGrimoireArticleType__Featured = 0,
	ETigerGrimoireArticleType__Suggested = 1,
	ETigerGrimoireArticleType__New = 2,
	ETigerGrimoireArticleType__ETigerGrimoireArticleType_MAX = 3,

};

// Enum Tiger.ETigerGrimoireSearchEntryType
enum class Tiger_ETigerGrimoireSearchEntryType : uint8_t
{
	ETigerGrimoireSearchEntryType__Category = 0,
	ETigerGrimoireSearchEntryType__Entry = 1,
	ETigerGrimoireSearchEntryType__ETigerGrimoireSearchEntryType_MAX = 2,

};

// Enum Tiger.ETigerGrimoireContinuationMethod
enum class Tiger_ETigerGrimoireContinuationMethod : uint8_t
{
	ETigerGrimoireContinuationMethod__NewParagraph = 0,
	ETigerGrimoireContinuationMethod__ExtendParagraph = 1,
	ETigerGrimoireContinuationMethod__Conversation = 2,
	ETigerGrimoireContinuationMethod__ETigerGrimoireContinuationMethod_MAX = 3,

};

// Enum Tiger.ETigerGrimoireEntryTextMode
enum class Tiger_ETigerGrimoireEntryTextMode : uint8_t
{
	ETigerGrimoireEntryTextMode__Small = 0,
	ETigerGrimoireEntryTextMode__Large = 1,
	ETigerGrimoireEntryTextMode__ETigerGrimoireEntryTextMode_MAX = 2,

};

// Enum Tiger.ETigerGrimoireEntryMediaDisplayMode
enum class Tiger_ETigerGrimoireEntryMediaDisplayMode : uint8_t
{
	ETigerGrimoireEntryMediaDisplayMode__Image = 0,
	ETigerGrimoireEntryMediaDisplayMode__Background = 1,
	ETigerGrimoireEntryMediaDisplayMode__Video = 2,
	ETigerGrimoireEntryMediaDisplayMode__Info = 3,
	ETigerGrimoireEntryMediaDisplayMode__Card = 4,
	ETigerGrimoireEntryMediaDisplayMode__Model = 5,
	ETigerGrimoireEntryMediaDisplayMode__ETigerGrimoireEntryMediaDisplayMode_MAX = 6,

};

// Enum Tiger.ETigerHeatmap
enum class Tiger_ETigerHeatmap : uint8_t
{
	ETigerHeatmap__PlayerDeaths    = 0,
	ETigerHeatmap__Feeding         = 1,
	ETigerHeatmap__PlayerMovement  = 2,
	ETigerHeatmap__RangedAttack    = 3,
	ETigerHeatmap__MeleeAttack     = 4,
	ETigerHeatmap__DisciplineUsed  = 5,
	ETigerHeatmap__Camping         = 6,
	ETigerHeatmap__PickedUpItem    = 7,
	ETigerHeatmap__NPCMovement     = 8,
	ETigerHeatmap__NPCDamagedPlayer = 9,
	ETigerHeatmap__PVECombat       = 10,
	ETigerHeatmap__PVPCombat       = 11,
	ETigerHeatmap__Count           = 12,
	ETigerHeatmap__ETigerHeatmap_MAX = 13,

};

// Enum Tiger.ETigerHookState
enum class Tiger_ETigerHookState : uint8_t
{
	ETigerHookState__Spawned       = 0,
	ETigerHookState__Throwing      = 1,
	ETigerHookState__Rotating      = 2,
	ETigerHookState__Reeling       = 3,
	ETigerHookState__Missed        = 4,
	ETigerHookState__Done          = 5,
	ETigerHookState__ETigerHookState_MAX = 6,

};

// Enum Tiger.ETigerDamageNumberAmount
enum class Tiger_ETigerDamageNumberAmount : uint8_t
{
	ETigerDamageNumberAmount__NoNumbers = 0,
	ETigerDamageNumberAmount__Accumulate = 1,
	ETigerDamageNumberAmount__EveryHit = 2,
	ETigerDamageNumberAmount__ETigerDamageNumberAmount_MAX = 3,

};

// Enum Tiger.ETigerVendorType
enum class Tiger_ETigerVendorType : uint8_t
{
	ETigerVendorType__MatchMaker   = 0,
	ETigerVendorType__OutfitStore  = 1,
	ETigerVendorType__TalentTrainer = 2,
	ETigerVendorType__ETigerVendorType_MAX = 3,

};

// Enum Tiger.EInteractiveObjectState
enum class Tiger_EInteractiveObjectState : uint8_t
{
	EInteractiveObjectState__NotInteractive = 0,
	EInteractiveObjectState__Inactive = 1,
	EInteractiveObjectState__Activated_Volume = 2,
	EInteractiveObjectState__Activated_Interaction = 3,
	EInteractiveObjectState__Activated_Shooting = 4,
	EInteractiveObjectState__Done  = 5,
	EInteractiveObjectState__EInteractiveObjectState_MAX = 6,

};

// Enum Tiger.ETigerWeaponCycleDirection
enum class Tiger_ETigerWeaponCycleDirection : uint8_t
{
	ETigerWeaponCycleDirection__Previous = 0,
	ETigerWeaponCycleDirection__Next = 1,
	ETigerWeaponCycleDirection__ETigerWeaponCycleDirection_MAX = 2,

};

// Enum Tiger.ETigerItemPickupInfo
enum class Tiger_ETigerItemPickupInfo : uint8_t
{
	ETigerItemPickupInfo__CanBePickedUp = 0,
	ETigerItemPickupInfo__AlreadyPickedUp = 1,
	ETigerItemPickupInfo__CategoryFull = 2,
	ETigerItemPickupInfo__ItemIsNull = 3,
	ETigerItemPickupInfo__CanPickUpAmmo = 4,
	ETigerItemPickupInfo__AmmoFull = 5,
	ETigerItemPickupInfo__Swap     = 6,
	ETigerItemPickupInfo__ETigerItemPickupInfo_MAX = 7,

};

// Enum Tiger.ERangedWeaponModType
enum class Tiger_ERangedWeaponModType : uint8_t
{
	ERangedWeaponModType__Scope    = 0,
	ERangedWeaponModType__ExtendedMag = 1,
	ERangedWeaponModType__Stock    = 2,
	ERangedWeaponModType__Special  = 3,
	ERangedWeaponModType__Barrel   = 4,
	ERangedWeaponModType__ERangedWeaponModType_MAX = 5,

};

// Enum Tiger.ETigerArtifactAbility
enum class Tiger_ETigerArtifactAbility : uint8_t
{
	ETigerArtifactAbility__DoubleJump = 0,
	ETigerArtifactAbility__Count   = 1,
	ETigerArtifactAbility__ETigerArtifactAbility_MAX = 2,

};

// Enum Tiger.ETigerTooltipStatChangeAmount
enum class Tiger_ETigerTooltipStatChangeAmount : uint8_t
{
	ETigerTooltipStatChangeAmount__Minor = 0,
	ETigerTooltipStatChangeAmount__Moderate = 1,
	ETigerTooltipStatChangeAmount__Significant = 2,
	ETigerTooltipStatChangeAmount__Major = 3,
	ETigerTooltipStatChangeAmount__Hidden = 4,
	ETigerTooltipStatChangeAmount__ETigerTooltipStatChangeAmount_MAX = 5,

};

// Enum Tiger.ETigerInventoryItemType
enum class Tiger_ETigerInventoryItemType : uint8_t
{
	ETigerInventoryItemType__TigerInventoryItem_Firearm = 0,
	ETigerInventoryItemType__TigerInventoryItem_Melee = 1,
	ETigerInventoryItemType__TigerInventoryItem_Unarmed = 2,
	ETigerInventoryItemType__TigerInventoryItem_Outfit = 3,
	ETigerInventoryItemType__TigerInventoryItem_Amulet = 4,
	ETigerInventoryItemType__TigerInventoryItem_Artifact = 5,
	ETigerInventoryItemType__TigerInventoryItem_BodyArmor = 6,
	ETigerInventoryItemType__TigerInventoryItem_Relic = 7,
	ETigerInventoryItemType__TigerInventoryItem_Ammo = 8,
	ETigerInventoryItemType__TigerInventoryItem_Consumable = 9,
	ETigerInventoryItemType__TigerInventoryItem_Mod = 10,
	ETigerInventoryItemType__TigerInventoryItem_Collectible = 11,
	ETigerInventoryItemType__TigerInventoryItem_Size = 12,
	ETigerInventoryItemType__TigerInventoryItem_MAX = 13,

};

// Enum Tiger.ETigerTimedAnimationType
enum class Tiger_ETigerTimedAnimationType : uint8_t
{
	ETigerTimedAnimationType__Montage = 0,
	ETigerTimedAnimationType__Section = 1,
	ETigerTimedAnimationType__ETigerTimedAnimationType_MAX = 2,

};

// Enum Tiger.ETigerLegalDocumentType
enum class Tiger_ETigerLegalDocumentType : uint8_t
{
	ETigerLegalDocumentType__Eula  = 0,
	ETigerLegalDocumentType__ExportGate = 1,
	ETigerLegalDocumentType__ExportGateDenied = 2,
	ETigerLegalDocumentType__PrivacyPolicy = 3,
	ETigerLegalDocumentType__Newsletter = 4,
	ETigerLegalDocumentType__NewsletterKorea = 5,
	ETigerLegalDocumentType__KoreaSpecial1 = 6,
	ETigerLegalDocumentType__KoreaSpecial2 = 7,
	ETigerLegalDocumentType__KoreaSpecial3 = 8,
	ETigerLegalDocumentType__KoreaSpecial4 = 9,
	ETigerLegalDocumentType__KoreaSpecial5 = 10,
	ETigerLegalDocumentType__ETigerLegalDocumentType_MAX = 11,

};

// Enum Tiger.ETigerAIPlayerMainState
enum class Tiger_ETigerAIPlayerMainState : uint8_t
{
	ETigerAIPlayerMainState__Idle  = 0,
	ETigerAIPlayerMainState__InBloodVein = 1,
	ETigerAIPlayerMainState__Wandering = 2,
	ETigerAIPlayerMainState__Combat = 3,
	ETigerAIPlayerMainState__Fleeing = 4,
	ETigerAIPlayerMainState__GoingForItem = 5,
	ETigerAIPlayerMainState__GoingForFeeding = 6,
	ETigerAIPlayerMainState__Healing = 7,
	ETigerAIPlayerMainState__PreMatch = 8,
	ETigerAIPlayerMainState__ETigerAIPlayerMainState_MAX = 9,

};

// Enum Tiger.ETigerAIPlayerTargetType
enum class Tiger_ETigerAIPlayerTargetType : uint8_t
{
	ETigerAIPlayerTargetType__Move = 0,
	ETigerAIPlayerTargetType__Feed = 1,
	ETigerAIPlayerTargetType__Loot = 2,
	ETigerAIPlayerTargetType__ETigerAIPlayerTargetType_MAX = 3,

};

// Enum Tiger.ETigerLootCategory
enum class Tiger_ETigerLootCategory : uint8_t
{
	ETigerLootCategory__Weapons    = 0,
	ETigerLootCategory__Ammo       = 1,
	ETigerLootCategory__RangedMods = 2,
	ETigerLootCategory__Consumables = 3,
	ETigerLootCategory__Backpacks  = 4,
	ETigerLootCategory__Collectible = 5,
	ETigerLootCategory__ETigerLootCategory_MAX = 6,

};

// Enum Tiger.EMapMarkerType
enum class Tiger_EMapMarkerType : uint8_t
{
	EMapMarkerType__Other          = 0,
	EMapMarkerType__AntiqueStore   = 1,
	EMapMarkerType__TailorStore    = 2,
	EMapMarkerType__PharmacyStore  = 3,
	EMapMarkerType__EntityCheckpoint = 4,
	EMapMarkerType__EMapMarkerType_MAX = 5,

};

// Enum Tiger.ETigerBlockState
enum class Tiger_ETigerBlockState : uint8_t
{
	ETigerBlockState__NotParrying  = 0,
	ETigerBlockState__StartParrying = 1,
	ETigerBlockState__DeflectIncomingAttacks = 2,
	ETigerBlockState__NumStates    = 3,
	ETigerBlockState__ETigerBlockState_MAX = 4,

};

// Enum Tiger.ETigerMeleeState
enum class Tiger_ETigerMeleeState : uint8_t
{
	ETigerMeleeState__ETigerMeleeState_Inactive = 0,
	ETigerMeleeState__ETigerMeleeState_SwingDamage = 1,
	ETigerMeleeState__ETigerMeleeState_SwingFinish = 2,
	ETigerMeleeState__ETigerMeleeState_MAX = 3,

};

// Enum Tiger.ETigerMeleeWeaponIdentifier
enum class Tiger_ETigerMeleeWeaponIdentifier : uint8_t
{
	ETigerMeleeWeaponIdentifier__None = 0,
	ETigerMeleeWeaponIdentifier__Axe = 1,
	ETigerMeleeWeaponIdentifier__Katana = 2,
	ETigerMeleeWeaponIdentifier__ScourgeBlades = 3,
	ETigerMeleeWeaponIdentifier__Unarmed = 4,
	ETigerMeleeWeaponIdentifier__Bat = 5,
	ETigerMeleeWeaponIdentifier__Count = 6,
	ETigerMeleeWeaponIdentifier__ETigerMeleeWeaponIdentifier_MAX = 7,

};

// Enum Tiger.ETigerDialogueQuestRequirementSpecifier
enum class Tiger_ETigerDialogueQuestRequirementSpecifier : uint8_t
{
	ETigerDialogueQuestRequirementSpecifier__InProgress = 0,
	ETigerDialogueQuestRequirementSpecifier__Completed = 1,
	ETigerDialogueQuestRequirementSpecifier__ETigerDialogueQuestRequirementSpecifier_MAX = 2,

};

// Enum Tiger.ETigerDialogueEqualitySpecifier
enum class Tiger_ETigerDialogueEqualitySpecifier : uint8_t
{
	ETigerDialogueEqualitySpecifier__LessThan = 0,
	ETigerDialogueEqualitySpecifier__LessThanOrEqualTo = 1,
	ETigerDialogueEqualitySpecifier__EqualTo = 2,
	ETigerDialogueEqualitySpecifier__GreaterThanOrEqualTo = 3,
	ETigerDialogueEqualitySpecifier__GreaterThan = 4,
	ETigerDialogueEqualitySpecifier__ETigerDialogueEqualitySpecifier_MAX = 5,

};

// Enum Tiger.ETigerDialogueOutfitRequirementSpecifier
enum class Tiger_ETigerDialogueOutfitRequirementSpecifier : uint8_t
{
	ETigerDialogueOutfitRequirementSpecifier__ClanOutfit = 0,
	ETigerDialogueOutfitRequirementSpecifier__GenderedOutfit = 1,
	ETigerDialogueOutfitRequirementSpecifier__ClanGenderedOutfit = 2,
	ETigerDialogueOutfitRequirementSpecifier__SpecificAssetName = 3,
	ETigerDialogueOutfitRequirementSpecifier__ETigerDialogueOutfitRequirementSpecifier_MAX = 4,

};

// Enum Tiger.ETigerDialogueClanRequirementSpecifier
enum class Tiger_ETigerDialogueClanRequirementSpecifier : uint8_t
{
	ETigerDialogueClanRequirementSpecifier__BothAreSame = 0,
	ETigerDialogueClanRequirementSpecifier__BothAreDifferent = 1,
	ETigerDialogueClanRequirementSpecifier__PlayerIsSpecific = 2,
	ETigerDialogueClanRequirementSpecifier__ETigerDialogueClanRequirementSpecifier_MAX = 3,

};

// Enum Tiger.ETigerDialogueCategory
enum class Tiger_ETigerDialogueCategory : uint8_t
{
	ETigerDialogueCategory__Uncategorised = 0,
	ETigerDialogueCategory__Congratulations = 1,
	ETigerDialogueCategory__Grimoire = 2,
	ETigerDialogueCategory__Character = 3,
	ETigerDialogueCategory__Collectible = 4,
	ETigerDialogueCategory__Item   = 5,
	ETigerDialogueCategory__Location = 6,
	ETigerDialogueCategory__Lore   = 7,
	ETigerDialogueCategory__Narrative = 8,
	ETigerDialogueCategory__Quest  = 9,
	ETigerDialogueCategory__Reaction = 10,
	ETigerDialogueCategory__Miscellaneous1 = 11,
	ETigerDialogueCategory__Miscellaneous2 = 12,
	ETigerDialogueCategory__Miscellaneous3 = 13,
	ETigerDialogueCategory__Miscellaneous4 = 14,
	ETigerDialogueCategory__Miscellaneous5 = 15,
	ETigerDialogueCategory__Max    = 16,

};

// Enum Tiger.ETigerDialogueRepeatability
enum class Tiger_ETigerDialogueRepeatability : uint8_t
{
	ETigerDialogueRepeatability__Repeatable = 0,
	ETigerDialogueRepeatability__OncePerElysium = 1,
	ETigerDialogueRepeatability__OnceEver = 2,
	ETigerDialogueRepeatability__ETigerDialogueRepeatability_MAX = 3,

};

// Enum Tiger.ETigerDialogueIdleAnimation
enum class Tiger_ETigerDialogueIdleAnimation : uint8_t
{
	ETigerDialogueIdleAnimation__Default = 0,
	ETigerDialogueIdleAnimation__Happy = 1,
	ETigerDialogueIdleAnimation__Sad = 2,
	ETigerDialogueIdleAnimation__Angry = 3,
	ETigerDialogueIdleAnimation__Fearful = 4,
	ETigerDialogueIdleAnimation__Amazed = 5,
	ETigerDialogueIdleAnimation__ETigerDialogueIdleAnimation_MAX = 6,

};

// Enum Tiger.ETigerDialoguePriority
enum class Tiger_ETigerDialoguePriority : uint8_t
{
	ETigerDialoguePriority__Flavour = 0,
	ETigerDialoguePriority__Situational = 1,
	ETigerDialoguePriority__Important = 2,
	ETigerDialoguePriority__Urgent = 3,
	ETigerDialoguePriority__Max    = 4,

};

// Enum Tiger.ETigerOnlineServiceStatus
enum class Tiger_ETigerOnlineServiceStatus : uint8_t
{
	ETigerOnlineServiceStatus__Available = 0,
	ETigerOnlineServiceStatus__Unavailable = 1,
	ETigerOnlineServiceStatus__ETigerOnlineServiceStatus_MAX = 2,

};

// Enum Tiger.ETigerLoginResult
enum class Tiger_ETigerLoginResult : uint8_t
{
	ETigerLoginResult__LoginSucceeded = 0,
	ETigerLoginResult__InternalError = 1,
	ETigerLoginResult__GetCharactersFailed = 2,
	ETigerLoginResult__NoValidAuthentication = 3,
	ETigerLoginResult__SteamNotEnabled = 4,
	ETigerLoginResult__AutomaticLoginFailed = 5,
	ETigerLoginResult__PlayerBanned = 6,
	ETigerLoginResult__Count       = 7,
	ETigerLoginResult__ETigerLoginResult_MAX = 8,

};

// Enum Tiger.ETigerPersistentConfigKey
enum class Tiger_ETigerPersistentConfigKey : uint8_t
{
	ETigerPersistentConfigKey__LastRewardedStatusRank = 0,
	ETigerPersistentConfigKey__ETigerPersistentConfigKey_MAX = 1,

};

// Enum Tiger.ETigerPlayerNPCVisibility
enum class Tiger_ETigerPlayerNPCVisibility : uint8_t
{
	ETigerPlayerNPCVisibility__NotSeenByNPC = 0,
	ETigerPlayerNPCVisibility__SeenByCivilian = 1,
	ETigerPlayerNPCVisibility__SeenByPolice = 2,
	ETigerPlayerNPCVisibility__ETigerPlayerNPCVisibility_MAX = 3,

};

// Enum Tiger.ETigerClimbingCameraInterpState
enum class Tiger_ETigerClimbingCameraInterpState : uint8_t
{
	ETigerClimbingCameraInterpState__None = 0,
	ETigerClimbingCameraInterpState__In = 1,
	ETigerClimbingCameraInterpState__Out = 2,
	ETigerClimbingCameraInterpState__ETigerClimbingCameraInterpState_MAX = 3,

};

// Enum Tiger.ETigerPhysicalInteraction
enum class Tiger_ETigerPhysicalInteraction : uint8_t
{
	ETigerPhysicalInteraction__Neither = 0,
	ETigerPhysicalInteraction__Revive = 1,
	ETigerPhysicalInteraction__Diablerie = 2,
	ETigerPhysicalInteraction__ETigerPhysicalInteraction_MAX = 3,

};

// Enum Tiger.ETigerBufferedActionType
enum class Tiger_ETigerBufferedActionType : uint8_t
{
	ETigerBufferedActionType__Jump = 0,
	ETigerBufferedActionType__Dodge = 1,
	ETigerBufferedActionType__MeleeAttack = 2,
	ETigerBufferedActionType__RangedAttack = 3,
	ETigerBufferedActionType__DisciplineArchetype = 4,
	ETigerBufferedActionType__DisciplineArchetypeReleased = 5,
	ETigerBufferedActionType__DisciplineClan = 6,
	ETigerBufferedActionType__DisciplineClanReleased = 7,
	ETigerBufferedActionType__WeaponAbility = 8,
	ETigerBufferedActionType__WeaponAbilityReleased = 9,
	ETigerBufferedActionType__Sprint = 10,
	ETigerBufferedActionType__Block = 11,
	ETigerBufferedActionType__Crouch = 12,
	ETigerBufferedActionType__Reload = 13,
	ETigerBufferedActionType__SwitchWeapon = 14,
	ETigerBufferedActionType__QuickAttack = 15,
	ETigerBufferedActionType__ToggleHeightenedSenses = 16,
	ETigerBufferedActionType__Count = 17,
	ETigerBufferedActionType__ETigerBufferedActionType_MAX = 18,

};

// Enum Tiger.ETigerWallJumpAnimationState
enum class Tiger_ETigerWallJumpAnimationState : uint8_t
{
	ETigerWallJumpAnimationState__None = 0,
	ETigerWallJumpAnimationState__Sliding = 1,
	ETigerWallJumpAnimationState__Jumping = 2,
	ETigerWallJumpAnimationState__ETigerWallJumpAnimationState_MAX = 3,

};

// Enum Tiger.ETigerVersionIsValidResult
enum class Tiger_ETigerVersionIsValidResult : uint8_t
{
	ETigerVersionIsValidResult__Valid = 0,
	ETigerVersionIsValidResult__Invalid = 1,
	ETigerVersionIsValidResult__ConnectionError = 2,
	ETigerVersionIsValidResult__ParseError = 3,
	ETigerVersionIsValidResult__ETigerVersionIsValidResult_MAX = 4,

};

// Enum Tiger.ETigerGetTicketResult
enum class Tiger_ETigerGetTicketResult : uint8_t
{
	ETigerGetTicketResult__Success = 0,
	ETigerGetTicketResult__ConnectionError = 1,
	ETigerGetTicketResult__ParseError = 2,
	ETigerGetTicketResult__InvalidResponse = 3,
	ETigerGetTicketResult__BackendOperationFailed = 4,
	ETigerGetTicketResult__ETigerGetTicketResult_MAX = 5,

};

// Enum Tiger.ETigerInterrupt
enum class Tiger_ETigerInterrupt : uint8_t
{
	ETigerInterrupt__Climbing      = 0,
	ETigerInterrupt__Placeholder   = 1,
	ETigerInterrupt__Size          = 2,
	ETigerInterrupt__ETigerInterrupt_MAX = 3,

};

// Enum Tiger.EHitAudio
enum class Tiger_EHitAudio : uint8_t
{
	EHitAudio__None                = 0,
	EHitAudio__Flesh               = 1,
	EHitAudio__Stone               = 2,
	EHitAudio__Concrete            = 3,
	EHitAudio__Fabric              = 4,
	EHitAudio__MetalThick          = 5,
	EHitAudio__Gravel              = 6,
	EHitAudio__Ground              = 7,
	EHitAudio__CeramicRoofTile     = 8,
	EHitAudio__Grass               = 9,
	EHitAudio__Puddle              = 10,
	EHitAudio__Wood                = 11,
	EHitAudio__MetalThin           = 12,
	EHitAudio__Glass               = 13,
	EHitAudio__MAX                 = 14,

};

// Enum Tiger.ETigerWeaponReloadMode
enum class Tiger_ETigerWeaponReloadMode : uint8_t
{
	ETigerWeaponReloadMode__NotReloading = 0,
	ETigerWeaponReloadMode__WantsToReload = 1,
	ETigerWeaponReloadMode__Reloading = 2,
	ETigerWeaponReloadMode__ETigerWeaponReloadMode_MAX = 3,

};

// Enum Tiger.ETigerReflectBehaviour
enum class Tiger_ETigerReflectBehaviour : uint8_t
{
	ETigerReflectBehaviour__Reflect = 0,
	ETigerReflectBehaviour__Block  = 1,
	ETigerReflectBehaviour__None   = 2,
	ETigerReflectBehaviour__ETigerReflectBehaviour_MAX = 3,

};

// Enum Tiger.ETigerReflectAttackType
enum class Tiger_ETigerReflectAttackType : uint8_t
{
	ETigerReflectAttackType__Bullet = 0,
	ETigerReflectAttackType__Melee = 1,
	ETigerReflectAttackType__ThrownAxe = 2,
	ETigerReflectAttackType__ThrownTrap = 3,
	ETigerReflectAttackType__ThrownChain = 4,
	ETigerReflectAttackType__Count = 5,
	ETigerReflectAttackType__ETigerReflectAttackType_MAX = 6,

};

// Enum Tiger.ETigerClassRepNodeMapping
enum class Tiger_ETigerClassRepNodeMapping : uint8_t
{
	ETigerClassRepNodeMapping__NotRouted = 0,
	ETigerClassRepNodeMapping__RelevantAllConnections = 1,
	ETigerClassRepNodeMapping__OwnerRelevantConnection = 2,
	ETigerClassRepNodeMapping__Spatialize_Static = 3,
	ETigerClassRepNodeMapping__Spatialize_Dynamic = 4,
	ETigerClassRepNodeMapping__Spatialize_Dynamic_PlayerSpawned = 5,
	ETigerClassRepNodeMapping__Spatialize_Static_PlayerSpawned = 6,
	ETigerClassRepNodeMapping__Spatialize_Dormancy = 7,
	ETigerClassRepNodeMapping__ETigerClassRepNodeMapping_MAX = 8,

};

// Enum Tiger.ETigerResurrectHolyIncenseInteractionType
enum class Tiger_ETigerResurrectHolyIncenseInteractionType : uint8_t
{
	ETigerResurrectHolyIncenseInteractionType__None = 0,
	ETigerResurrectHolyIncenseInteractionType__OnOverlap = 1,
	ETigerResurrectHolyIncenseInteractionType__OnWaveReveal = 2,
	ETigerResurrectHolyIncenseInteractionType__ETigerResurrectHolyIncenseInteractionType_MAX = 3,

};

// Enum Tiger.EScreenTransitionState
enum class Tiger_EScreenTransitionState : uint8_t
{
	EScreenTransitionState__NotStarted = 0,
	EScreenTransitionState__TransitionIn = 1,
	EScreenTransitionState__TransitionOut = 2,
	EScreenTransitionState__Finished = 3,
	EScreenTransitionState__EScreenTransitionState_MAX = 4,

};

// Enum Tiger.EShockwaveWallDestroyReason
enum class Tiger_EShockwaveWallDestroyReason : uint8_t
{
	EShockwaveWallDestroyReason__CollidedWithTerrain = 0,
	EShockwaveWallDestroyReason__ReachedMaxDistance = 1,
	EShockwaveWallDestroyReason__OtherShockwaveWall = 2,
	EShockwaveWallDestroyReason__EShockwaveWallDestroyReason_MAX = 3,

};

// Enum Tiger.ETigerSignificanceElysiumNpcMeshType
enum class Tiger_ETigerSignificanceElysiumNpcMeshType : uint8_t
{
	ETigerSignificanceElysiumNpcMeshType__Body = 0,
	ETigerSignificanceElysiumNpcMeshType__Head = 1,
	ETigerSignificanceElysiumNpcMeshType__Hair = 2,
	ETigerSignificanceElysiumNpcMeshType__Hoodie = 3,
	ETigerSignificanceElysiumNpcMeshType__Props = 4,
	ETigerSignificanceElysiumNpcMeshType__ETigerSignificanceElysiumNpcMeshType_MAX = 5,

};

// Enum Tiger.ETigerSignificancePlayerMeshType
enum class Tiger_ETigerSignificancePlayerMeshType : uint8_t
{
	ETigerSignificancePlayerMeshType__Body = 0,
	ETigerSignificancePlayerMeshType__Head = 1,
	ETigerSignificancePlayerMeshType__Hair = 2,
	ETigerSignificancePlayerMeshType__Hoodie = 3,
	ETigerSignificancePlayerMeshType__Headgear = 4,
	ETigerSignificancePlayerMeshType__Eyewear = 5,
	ETigerSignificancePlayerMeshType__Weapon = 6,
	ETigerSignificancePlayerMeshType__SecondaryWeapon = 7,
	ETigerSignificancePlayerMeshType__HolsteredWeapon = 8,
	ETigerSignificancePlayerMeshType__SecondaryHolsteredWeapon = 9,
	ETigerSignificancePlayerMeshType__BodyAdditional = 10,
	ETigerSignificancePlayerMeshType__Generic = 11,
	ETigerSignificancePlayerMeshType__Piercing = 12,
	ETigerSignificancePlayerMeshType__Beard = 13,
	ETigerSignificancePlayerMeshType__ETigerSignificancePlayerMeshType_MAX = 14,

};

// Enum Tiger.ESplatmapTextureChannel
enum class Tiger_ESplatmapTextureChannel : uint8_t
{
	ESplatmapTextureChannel__R     = 0,
	ESplatmapTextureChannel__G     = 1,
	ESplatmapTextureChannel__B     = 2,
	ESplatmapTextureChannel__A     = 3,
	ESplatmapTextureChannel__ChannelCount = 4,
	ESplatmapTextureChannel__ESplatmapTextureChannel_MAX = 5,

};

// Enum Tiger.ETigerStaticMeshType
enum class Tiger_ETigerStaticMeshType : uint8_t
{
	ETigerStaticMeshType__Default  = 0,
	ETigerStaticMeshType__Stairs   = 1,
	ETigerStaticMeshType__Slope    = 2,
	ETigerStaticMeshType__ETigerStaticMeshType_MAX = 3,

};

// Enum Tiger.ETigerLocalPlayerStatsCategory
enum class Tiger_ETigerLocalPlayerStatsCategory : uint8_t
{
	ETigerLocalPlayerStatsCategory__OnlineTime = 0,
	ETigerLocalPlayerStatsCategory__PlayTime = 1,
	ETigerLocalPlayerStatsCategory__Count = 2,
	ETigerLocalPlayerStatsCategory__ETigerLocalPlayerStatsCategory_MAX = 3,

};

// Enum Tiger.ETigerStatsGroupType
enum class Tiger_ETigerStatsGroupType : uint8_t
{
	ETigerStatsGroupType__GeneralStats = 0,
	ETigerStatsGroupType__RangedWeaponStats = 1,
	ETigerStatsGroupType__MeleeWeaponStats = 2,
	ETigerStatsGroupType__Count    = 3,
	ETigerStatsGroupType__ETigerStatsGroupType_MAX = 4,

};

// Enum Tiger.ETigerStatsCategory
enum class Tiger_ETigerStatsCategory : uint8_t
{
	ETigerStatsCategory__TimeInRedGas = 0,
	ETigerStatsCategory__TimeInRedGasWithStimulant = 1,
	ETigerStatsCategory__TotalMoveDistance = 2,
	ETigerStatsCategory__WalkingDistance = 3,
	ETigerStatsCategory__DisciplineTravelDistance = 4,
	ETigerStatsCategory__CrouchingTime = 5,
	ETigerStatsCategory__ClimbingTime = 6,
	ETigerStatsCategory__TimeInside = 7,
	ETigerStatsCategory__WallHangTime = 8,
	ETigerStatsCategory__WallGrindTime = 9,
	ETigerStatsCategory__SlideTime = 10,
	ETigerStatsCategory__AirTime   = 11,
	ETigerStatsCategory__NotMovingTime = 12,
	ETigerStatsCategory__TotalJumps = 13,
	ETigerStatsCategory__TotalWallJumps = 14,
	ETigerStatsCategory__TotalSlideJumps = 15,
	ETigerStatsCategory__TotalLedgeGrabs = 16,
	ETigerStatsCategory__TotalLowVaults = 17,
	ETigerStatsCategory__NumberOfAlliedRevives = 18,
	ETigerStatsCategory__TotalAmountOfHealing = 19,
	ETigerStatsCategory__TotalNumberOfHealingEvents = 20,
	ETigerStatsCategory__TotalFeedingAbortsByDamage = 21,
	ETigerStatsCategory__TotalFeedingAbortsByPlayer = 22,
	ETigerStatsCategory__TotalTimeBloodHunted = 23,
	ETigerStatsCategory__TotalBloodHuntsByFeeding = 24,
	ETigerStatsCategory__TotalBloodHuntsByKilling = 25,
	ETigerStatsCategory__TotalNumberAreaMarkerConsequences = 26,
	ETigerStatsCategory__TotalNumberMapMarkerConsequences = 27,
	ETigerStatsCategory__PingMin   = 28,
	ETigerStatsCategory__PingMax   = 29,
	ETigerStatsCategory__TotalDamageDone = 30,
	ETigerStatsCategory__SurvivalTime = 31,
	ETigerStatsCategory__KindredsKilled = 32,
	ETigerStatsCategory__Placement = 33,
	ETigerStatsCategory__Diableries = 34,
	ETigerStatsCategory__DownedPlayers = 35,
	ETigerStatsCategory__LevelReached = 36,
	ETigerStatsCategory__Assists   = 37,
	ETigerStatsCategory__TotalExpGained = 38,
	ETigerStatsCategory__Deaths    = 39,
	ETigerStatsCategory__NumberOfRangedHits = 40,
	ETigerStatsCategory__NumberOfRangedShots = 41,
	ETigerStatsCategory__DamageDealtWithWeapon = 42,
	ETigerStatsCategory__EnemiesDownedWithWeapon = 43,
	ETigerStatsCategory__NumberOfTimesOutOfAmmoWithWeapon = 44,
	ETigerStatsCategory__NumberHeadshotsWithWeapon = 45,
	ETigerStatsCategory__DurationMeleeWeaponHeldFor = 46,
	ETigerStatsCategory__NumberOfTimesMeleeWeaponDrawn = 47,
	ETigerStatsCategory__NumberOfAttacksWithMeleeWeapon = 48,
	ETigerStatsCategory__NumberOfHitsWithMeleeWeapon = 49,
	ETigerStatsCategory__TotalDamageDoneWithMeleeWeapon = 50,
	ETigerStatsCategory__TotalNumberOfDownsWithMeleeWeapon = 51,
	ETigerStatsCategory__TotalNumberOfKillsWithMeleeWeapon = 52,
	ETigerStatsCategory__Count     = 53,
	ETigerStatsCategory__ETigerStatsCategory_MAX = 54,

};

// Enum Tiger.ETigerTalent
enum class Tiger_ETigerTalent : uint8_t
{
	ETigerTalent__None             = 0,
	ETigerTalent__ShootingDamage1  = 1,
	ETigerTalent__ShotgunDamage1   = 2,
	ETigerTalent__ShotgunDamage2   = 3,
	ETigerTalent__DecreaseSignatureSkillCD = 4,
	ETigerTalent__IncreaseAbilityDamage1 = 5,
	ETigerTalent__Count            = 6,
	ETigerTalent__ETigerTalent_MAX = 7,

};

// Enum Tiger.ETigerTalentType
enum class Tiger_ETigerTalentType : uint8_t
{
	ETigerTalentType__PassiveStatBoost = 0,
	ETigerTalentType__ETigerTalentType_MAX = 1,

};

// Enum Tiger.ETigerTelemetryAceDeathType
enum class Tiger_ETigerTelemetryAceDeathType : uint8_t
{
	ETigerTelemetryAceDeathType__Unknown = 0,
	ETigerTelemetryAceDeathType__Damage = 1,
	ETigerTelemetryAceDeathType__Diablerize = 2,
	ETigerTelemetryAceDeathType__ETigerTelemetryAceDeathType_MAX = 3,

};

// Enum Tiger.ETigerTelemetryMetaItemSourceType
enum class Tiger_ETigerTelemetryMetaItemSourceType : uint8_t
{
	ETigerTelemetryMetaItemSourceType__FlashStore = 0,
	ETigerTelemetryMetaItemSourceType__Battlepass = 1,
	ETigerTelemetryMetaItemSourceType__Reward = 2,
	ETigerTelemetryMetaItemSourceType__Other = 3,
	ETigerTelemetryMetaItemSourceType__ETigerTelemetryMetaItemSourceType_MAX = 4,

};

// Enum Tiger.ETigerTelemetryAceRebirthType
enum class Tiger_ETigerTelemetryAceRebirthType : uint8_t
{
	ETigerTelemetryAceRebirthType__Unknown = 0,
	ETigerTelemetryAceRebirthType__Revive = 1,
	ETigerTelemetryAceRebirthType__Respawn = 2,
	ETigerTelemetryAceRebirthType__ETigerTelemetryAceRebirthType_MAX = 3,

};

// Enum Tiger.ETigerTelemetryNetworkIpType
enum class Tiger_ETigerTelemetryNetworkIpType : uint8_t
{
	ETigerTelemetryNetworkIpType__Unspec = 0,
	ETigerTelemetryNetworkIpType__Ipv4 = 1,
	ETigerTelemetryNetworkIpType__Ipv6 = 2,
	ETigerTelemetryNetworkIpType__ETigerTelemetryNetworkIpType_MAX = 3,

};

// Enum Tiger.ETigerTelemetryNetworkType
enum class Tiger_ETigerTelemetryNetworkType : uint8_t
{
	ETigerTelemetryNetworkType__Unknown = 0,
	ETigerTelemetryNetworkType__Ethernet = 1,
	ETigerTelemetryNetworkType__Wifi = 2,
	ETigerTelemetryNetworkType__ETigerTelemetryNetworkType_MAX = 3,

};

// Enum Tiger.ETigerTelemetryChallengeType
enum class Tiger_ETigerTelemetryChallengeType : uint8_t
{
	ETigerTelemetryChallengeType__Daily = 0,
	ETigerTelemetryChallengeType__Weekly = 1,
	ETigerTelemetryChallengeType__Other = 2,
	ETigerTelemetryChallengeType__ETigerTelemetryChallengeType_MAX = 3,

};

// Enum Tiger.ETigerTelemetryHardCurrencyRecieveMethod
enum class Tiger_ETigerTelemetryHardCurrencyRecieveMethod : uint8_t
{
	ETigerTelemetryHardCurrencyRecieveMethod__TopUp = 0,
	ETigerTelemetryHardCurrencyRecieveMethod__BattlepassReward = 1,
	ETigerTelemetryHardCurrencyRecieveMethod__Gifted = 2,
	ETigerTelemetryHardCurrencyRecieveMethod__Other = 3,
	ETigerTelemetryHardCurrencyRecieveMethod__ETigerTelemetryHardCurrencyRecieveMethod_MAX = 4,

};

// Enum Tiger.ETigerTelemetryBattlepassType
enum class Tiger_ETigerTelemetryBattlepassType : uint8_t
{
	ETigerTelemetryBattlepassType__Regular = 0,
	ETigerTelemetryBattlepassType__Bundle = 1,
	ETigerTelemetryBattlepassType__RankSkipOnly = 2,
	ETigerTelemetryBattlepassType__ETigerTelemetryBattlepassType_MAX = 3,

};

// Enum Tiger.ETigerTelemetryGameplayMode
enum class Tiger_ETigerTelemetryGameplayMode : uint8_t
{
	ETigerTelemetryGameplayMode__BattleRoyale = 0,
	ETigerTelemetryGameplayMode__ETigerTelemetryGameplayMode_MAX = 1,

};

// Enum Tiger.ETigerTelemetryRankedMode
enum class Tiger_ETigerTelemetryRankedMode : uint8_t
{
	ETigerTelemetryRankedMode__Casual = 0,
	ETigerTelemetryRankedMode__ETigerTelemetryRankedMode_MAX = 1,

};

// Enum Tiger.ETigerTelemetryMapIds
enum class Tiger_ETigerTelemetryMapIds : uint8_t
{
	ETigerTelemetryMapIds__Prague  = 0,
	ETigerTelemetryMapIds__ETigerTelemetryMapIds_MAX = 1,

};

// Enum Tiger.ETigerTelemetryPlatformType
enum class Tiger_ETigerTelemetryPlatformType : uint8_t
{
	ETigerTelemetryPlatformType__Steam = 0,
	ETigerTelemetryPlatformType__Unknown = 1,
	ETigerTelemetryPlatformType__ETigerTelemetryPlatformType_MAX = 2,

};

// Enum Tiger.ETigerTelemetryDeviceType
enum class Tiger_ETigerTelemetryDeviceType : uint8_t
{
	ETigerTelemetryDeviceType__Windows = 0,
	ETigerTelemetryDeviceType__ETigerTelemetryDeviceType_MAX = 1,

};

// Enum Tiger.ETigerTelemetryCauseOfPingRemoval
enum class Tiger_ETigerTelemetryCauseOfPingRemoval : uint8_t
{
	ETigerTelemetryCauseOfPingRemoval__Timeout = 0,
	ETigerTelemetryCauseOfPingRemoval__Cancel = 1,
	ETigerTelemetryCauseOfPingRemoval__CollectedLoot = 2,
	ETigerTelemetryCauseOfPingRemoval__GroupMemberRemoved = 3,
	ETigerTelemetryCauseOfPingRemoval__ETigerTelemetryCauseOfPingRemoval_MAX = 4,

};

// Enum Tiger.ETigerTelemetryExpSource
enum class Tiger_ETigerTelemetryExpSource : uint8_t
{
	ETigerTelemetryExpSource__Civillian = 0,
	ETigerTelemetryExpSource__PotentCivillian = 1,
	ETigerTelemetryExpSource__HighPotentCivillian = 2,
	ETigerTelemetryExpSource__Diablerie = 3,
	ETigerTelemetryExpSource__Rat  = 4,
	ETigerTelemetryExpSource__Team = 5,
	ETigerTelemetryExpSource__Entity = 6,
	ETigerTelemetryExpSource__Invalid = 7,
	ETigerTelemetryExpSource__ETigerTelemetryExpSource_MAX = 8,

};

// Enum Tiger.ETigerTelemetryDamageCauser
enum class Tiger_ETigerTelemetryDamageCauser : uint8_t
{
	ETigerTelemetryDamageCauser__Undefined = 0,
	ETigerTelemetryDamageCauser__Self = 1,
	ETigerTelemetryDamageCauser__OtherPlayer = 2,
	ETigerTelemetryDamageCauser__Entity = 3,
	ETigerTelemetryDamageCauser__Judge = 4,
	ETigerTelemetryDamageCauser__Civilian = 5,
	ETigerTelemetryDamageCauser__None = 6,
	ETigerTelemetryDamageCauser__RedGas = 7,
	ETigerTelemetryDamageCauser__Environmental = 8,
	ETigerTelemetryDamageCauser__ETigerTelemetryDamageCauser_MAX = 9,

};

// Enum Tiger.ETigerTelemetryDamageType
enum class Tiger_ETigerTelemetryDamageType : uint8_t
{
	ETigerTelemetryDamageType__Undefined = 0,
	ETigerTelemetryDamageType__Ranged = 1,
	ETigerTelemetryDamageType__Melee = 2,
	ETigerTelemetryDamageType__Discipline = 3,
	ETigerTelemetryDamageType__Environmental = 4,
	ETigerTelemetryDamageType__RedGas = 5,
	ETigerTelemetryDamageType__ETigerTelemetryDamageType_MAX = 6,

};

// Enum Tiger.ETigerThrallMenu
enum class Tiger_ETigerThrallMenu : uint8_t
{
	ETigerThrallMenu__Thralls      = 0,
	ETigerThrallMenu__Upgrades     = 1,
	ETigerThrallMenu__Other        = 2,
	ETigerThrallMenu__ETigerThrallMenu_MAX = 3,

};

// Enum Tiger.ETigerMissionObjectiveType
enum class Tiger_ETigerMissionObjectiveType : uint8_t
{
	ETigerMissionObjectiveType__Action_Brawl = 0,
	ETigerMissionObjectiveType__Action_Firearms = 1,
	ETigerMissionObjectiveType__Action_Chase = 2,
	ETigerMissionObjectiveType__Stealth_FindEntrance = 3,
	ETigerMissionObjectiveType__Stealth_TakePhoto = 4,
	ETigerMissionObjectiveType__Stealth_Hack = 5,
	ETigerMissionObjectiveType__Intel_StealIntenl = 6,
	ETigerMissionObjectiveType__Intel_PlantBug = 7,
	ETigerMissionObjectiveType__Intel_ThreatenWitness = 8,
	ETigerMissionObjectiveType__ETigerMissionObjectiveType_MAX = 9,

};

// Enum Tiger.ETigerMissionType
enum class Tiger_ETigerMissionType : uint8_t
{
	ETigerMissionType__Action      = 0,
	ETigerMissionType__Stealth     = 1,
	ETigerMissionType__Intel       = 2,
	ETigerMissionType__ETigerMissionType_MAX = 3,

};

// Enum Tiger.ETigerThrallSystemLoadedTable
enum class Tiger_ETigerThrallSystemLoadedTable : uint8_t
{
	ETigerThrallSystemLoadedTable__Abilities = 0,
	ETigerThrallSystemLoadedTable__BaseThralls = 1,
	ETigerThrallSystemLoadedTable__StatsModifier = 2,
	ETigerThrallSystemLoadedTable__ThrallMission = 3,
	ETigerThrallSystemLoadedTable__ETigerThrallSystemLoadedTable_MAX = 4,

};

// Enum Tiger.ETigerThrallStatId
enum class Tiger_ETigerThrallStatId : uint8_t
{
	ETigerThrallStatId__Perception = 0,
	ETigerThrallStatId__Commitment = 1,
	ETigerThrallStatId__Dominance  = 2,
	ETigerThrallStatId__Sociability = 3,
	ETigerThrallStatId__Proficiency = 4,
	ETigerThrallStatId__Stealth    = 5,
	ETigerThrallStatId__Stamina    = 6,
	ETigerThrallStatId__Combat     = 7,
	ETigerThrallStatId__Count      = 8,
	ETigerThrallStatId__ETigerThrallStatId_MAX = 9,

};

// Enum Tiger.ETigerThrallAbilityId
enum class Tiger_ETigerThrallAbilityId : uint8_t
{
	ETigerThrallAbilityId__None    = 0,
	ETigerThrallAbilityId__Diplomat = 1,
	ETigerThrallAbilityId__Slippery = 2,
	ETigerThrallAbilityId__NaturalEnemy = 3,
	ETigerThrallAbilityId__IWorkAlone = 4,
	ETigerThrallAbilityId__ETigerThrallAbilityId_MAX = 5,

};

// Enum Tiger.ETigerTraversalNetValue
enum class Tiger_ETigerTraversalNetValue : uint8_t
{
	ETigerTraversalNetValue__Sprint = 0,
	ETigerTraversalNetValue__RootMotionDisabled = 1,
	ETigerTraversalNetValue__Climb = 2,
	ETigerTraversalNetValue__ForcedMove = 3,
	ETigerTraversalNetValue__Stagger = 4,
	ETigerTraversalNetValue__LedgeGrab = 5,
	ETigerTraversalNetValue__LowVault = 6,
	ETigerTraversalNetValue__Downed = 7,
	ETigerTraversalNetValue__WallGrind = 8,
	ETigerTraversalNetValue__Sliding = 9,
	ETigerTraversalNetValue__RESERVE = 10,
	ETigerTraversalNetValue__RESERVE01 = 11,
	ETigerTraversalNetValue__RESERVE02 = 12,
	ETigerTraversalNetValue__RESERVE03 = 13,
	ETigerTraversalNetValue__RESERVE04 = 14,
	ETigerTraversalNetValue__ETigerTraversalNetValue_MAX = 15,

};

// Enum Tiger.ETigerTraversalTransitionResult
enum class Tiger_ETigerTraversalTransitionResult : uint8_t
{
	ETigerTraversalTransitionResult__Success = 0,
	ETigerTraversalTransitionResult__SuccessWithConsumption = 1,
	ETigerTraversalTransitionResult__Fail = 2,
	ETigerTraversalTransitionResult__ETigerTraversalTransitionResult_MAX = 3,

};

// Enum Tiger.ETigerWallJumpInputOption
enum class Tiger_ETigerWallJumpInputOption : uint8_t
{
	ETigerWallJumpInputOption__None = 0,
	ETigerWallJumpInputOption__OppositeToNormal = 1,
	ETigerWallJumpInputOption__ParallelToNormal = 2,
	ETigerWallJumpInputOption__ETigerWallJumpInputOption_MAX = 3,

};

// Enum Tiger.ETigerUIBorderShape
enum class Tiger_ETigerUIBorderShape : uint8_t
{
	ETigerUIBorderShape__ETigerBorderShape_Rectangle = 0,
	ETigerUIBorderShape__ETigerBorderShape_Circle = 1,
	ETigerUIBorderShape__ETigerBorderShape_MAX = 2,

};

// Enum Tiger.ETigerMinMax
enum class Tiger_ETigerMinMax : uint8_t
{
	ETigerMinMax__Min              = 0,
	ETigerMinMax__Max              = 1,
	ETigerMinMax__Count            = 2,

};

// Enum Tiger.ETigerExtendedWeaponLevels
enum class Tiger_ETigerExtendedWeaponLevels : uint8_t
{
	ETigerExtendedWeaponLevels__Default = 0,
	ETigerExtendedWeaponLevels__ExtendedSmall = 1,
	ETigerExtendedWeaponLevels__ExtendedMedium = 2,
	ETigerExtendedWeaponLevels__ExtendedLarge = 3,
	ETigerExtendedWeaponLevels__LevelCount = 4,
	ETigerExtendedWeaponLevels__ETigerExtendedWeaponLevels_MAX = 5,

};

// Enum Tiger.ETigerSpreadModifier
enum class Tiger_ETigerSpreadModifier : uint8_t
{
	ETigerSpreadModifier__Aiming   = 0,
	ETigerSpreadModifier__Crouching = 1,
	ETigerSpreadModifier__Moving   = 2,
	ETigerSpreadModifier__IsInAir  = 3,
	ETigerSpreadModifier__Sprinting = 4,
	ETigerSpreadModifier__Sliding  = 5,
	ETigerSpreadModifier__WallHang = 6,
	ETigerSpreadModifier__Count    = 7,
	ETigerSpreadModifier__ETigerSpreadModifier_MAX = 8,

};

// Enum Tiger.ETigerWeaponAmmoType
enum class Tiger_ETigerWeaponAmmoType : uint8_t
{
	ETigerWeaponAmmoType__Bullet   = 0,
	ETigerWeaponAmmoType__Buckshot = 1,
	ETigerWeaponAmmoType__Pistol   = 2,
	ETigerWeaponAmmoType__SMG      = 3,
	ETigerWeaponAmmoType__Bolt     = 4,
	ETigerWeaponAmmoType__Precision = 5,
	ETigerWeaponAmmoType__Unique   = 6,
	ETigerWeaponAmmoType__Count    = 7,
	ETigerWeaponAmmoType__ETigerWeaponAmmoType_MAX = 8,

};

// Enum Tiger.ETigerWeaponType
enum class Tiger_ETigerWeaponType : uint8_t
{
	ETigerWeaponType__AssaultRifle = 0,
	ETigerWeaponType__Revolver     = 1,
	ETigerWeaponType__Rifle        = 2,
	ETigerWeaponType__SMG          = 3,
	ETigerWeaponType__Pistol       = 4,
	ETigerWeaponType__Axe          = 5,
	ETigerWeaponType__Bat          = 6,
	ETigerWeaponType__Knife        = 7,
	ETigerWeaponType__Shotgun      = 8,
	ETigerWeaponType__Sword        = 9,
	ETigerWeaponType__Bow          = 10,
	ETigerWeaponType__Crossbow     = 11,
	ETigerWeaponType__Count        = 12,
	ETigerWeaponType__ETigerWeaponType_MAX = 13,

};

// Enum Tiger.ETigerWorldCompositionProxyMode
enum class Tiger_ETigerWorldCompositionProxyMode : uint8_t
{
	ETigerWorldCompositionProxyMode__Legacy = 0,
	ETigerWorldCompositionProxyMode__SingleStageMerge = 1,
	ETigerWorldCompositionProxyMode__ETigerWorldCompositionProxyMode_MAX = 2,

};

//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Tiger.TigerCharacterSingleStatModification
// 0x0008
struct FTigerCharacterSingleStatModification
{
	float                                              AdditiveChange;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MultiplicativeChange;                                      // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.ClanDamageMultiplierMatrix
// 0x0024
struct FClanDamageMultiplierMatrix
{
	float                                              BrujahAgainst[0x3];                                        // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              NosferatuAgainst[0x3];                                     // 0x000C(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ToreadorAgainst[0x3];                                      // 0x0018(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerStatusEffect
// 0x000B
struct FTigerStatusEffect
{
	bool                                               bBlockInteraction;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bInvulnerable;                                             // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bInvisible;                                                // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bHidden;                                                   // 0x0003(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bLogicHidden;                                              // 0x0004(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bDisableSprint;                                            // 0x0005(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bDisableClimb;                                             // 0x0006(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bDisableDisciplines;                                       // 0x0007(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bDisableRotation;                                          // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bDisableHeightenedSenses;                                  // 0x0009(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bBlockAILogic;                                             // 0x000A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct Tiger.TigerNiagaraAttachment
// 0x0048
struct FTigerNiagaraAttachment
{
	struct FSoftObjectPath                             NiagaraPath;                                               // 0x0000(0x0018) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_369P[0x8];                                     // 0x0018(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       AttachPointName;                                           // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Location;                                                  // 0x0028(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    Rotation;                                                  // 0x0034(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TEnumAsByte<Engine_EAttachLocation>                AttachLocationRule;                                        // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bOnlySpawnOnLocalPlayer;                                   // 0x0041(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseAbsoluteRotation;                                      // 0x0042(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_02L4[0x5];                                     // 0x0043(0x0005) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerCharacterStatModification
// 0x00B4
struct FTigerCharacterStatModification
{
	float                                              ClanSkillCooldownMultiplier;                               // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ArchetypeSkillCooldownMultiplier;                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CooldownMultiplier;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CooldownSpeedMultiplier;                                   // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RechargeMultiplier;                                        // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RechargeSpeedMultiplier;                                   // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerCharacterSingleStatModification       MovementSpeed;                                             // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                              ClimbSpeedMultiplier;                                      // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MasqueradePointMultiplier;                                 // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerCharacterSingleStatModification       MovementAcceleration;                                      // 0x0028(0x0008) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FTigerCharacterSingleStatModification       Health;                                                    // 0x0030(0x0008) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                              JumpForceMultiplier;                                       // 0x0038(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              WallJumpForceMultiplier;                                   // 0x003C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AttackSpeedMultiplier;                                     // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ReloadSpeedMultiplier;                                     // 0x0044(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StaminaCostMultiplier;                                     // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AmmoFindMultiplier;                                        // 0x004C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FeedSpeedMultiplier;                                       // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MeleeDamageDealtMultiplier;                                // 0x0054(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageDealtMultiplier;                                     // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageDealtToCiviliansMultiplier;                          // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClanDamageMultiplierMatrix                 DamageToClansMultiplierMatrix;                             // 0x0060(0x0024) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                              AbilityDamageDealtMultiplier;                              // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ShotgunDamageDealtMultiplier;                              // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ShootingDamageDealtMultiplier;                             // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageTakenMultiplier;                                     // 0x0090(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MeleeDamageTakenMultiplier;                                // 0x0094(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AbilityDamageTakenMultiplier;                              // 0x0098(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ShootingDamageTakenMultiplier;                             // 0x009C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MosquitoDamageTakenMultiplier;                             // 0x00A0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LoudnessMultiplier;                                        // 0x00A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ReviveSpeedMultiplier;                                     // 0x00A8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ExperienceGainMultiplier;                                  // 0x00AC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AimSensitivityMultiplier;                                  // 0x00B0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerNpcVoCategory
// 0x0008
struct FTigerNpcVoCategory
{
	struct FName                                       Category;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct Tiger.TigerCommandQueue
// 0x0010
struct FTigerCommandQueue
{
	TArray<class UTigerAICommandBase*>                 Commands;                                                  // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPrivate)

};

// ScriptStruct Tiger.TigerContextualAnimationWrapper
// 0x000C
struct FTigerContextualAnimationWrapper
{
	struct FName                                       AnimationName;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Chance;                                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerAIMoveToLocationData
// 0x0018
struct FTigerAIMoveToLocationData
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AcceptanceRadius;                                          // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Yaw;                                                       // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSetRotation;                                              // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UZCI[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerAiMovementBudget
// 0x0018
struct FTigerAiMovementBudget
{
	int                                                NpcMoveBudget[0x3];                                        // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinAllotedMoveTime;                                        // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxAllotedMoveTime;                                        // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bRestrictMovementTimePerTicket;                            // 0x0014(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_A6AK[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerPlayerActionProcessData
// 0x0070
struct FTigerPlayerActionProcessData
{
	class ATigerPlayer*                                TigerPlayer;                                               // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerBaseNPC*                               NPC;                                                       // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_M9WG[0x60];                                    // 0x0010(0x0060) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerAIGroupCapCondition
// 0x000C
struct FTigerAIGroupCapCondition
{
	int                                                Slot;                                                      // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CommandIndex;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerAiConditionCheckTiming                 ConditionCheckTiming;                                      // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerAiFailedCAPConditionAction             FailedConditionAction;                                     // 0x0009(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_S8YP[0x2];                                     // 0x000A(0x0002) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerAIGroupCapCommandWrapper
// 0x0018
struct FTigerAIGroupCapCommandWrapper
{
	struct FTigerAIGroupCapCondition                   Condition;                                                 // 0x0000(0x000C) (Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1771[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UTigerAICommandBase*                         Command;                                                   // 0x0010(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerAiGroupCapSlot
// 0x0050
struct FTigerAiGroupCapSlot
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Yaw;                                                       // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerNPCAsset*                              NpcAssetToSpawn;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<Tiger_ETigerNPCType>                        RestrictedNpcTypesForSlot;                                 // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTigerAIGroupCapCommandWrapper>      SlotCommands;                                              // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                               bLoopCommands;                                             // 0x0038(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_70UP[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ATigerNPC*                                   OccupyingNPC;                                              // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CommandIndex;                                              // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_II7V[0x4];                                     // 0x004C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerSightConfigProperties
// 0x001C
struct FTigerSightConfigProperties
{
	float                                              SightRadius;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LoseSightRadius;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PeripheralVisionAngleDegrees;                              // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CloseSightRadius;                                          // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CloseLoseSightRadius;                                      // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ClosePeripheralVisionAngleDegrees;                         // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              HeightDifference;                                          // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.WeaponDistanceDesc
// 0x0008
struct FWeaponDistanceDesc
{
	float                                              MinDistSquared;                                            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxDistSquared;                                            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerAIPlayerAction
// 0x0058
struct FTigerAIPlayerAction
{
	unsigned char                                      UnknownData_9434[0x4];                                     // 0x0000(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	Tiger_ETigerAIPlayerAction                         Action;                                                    // 0x0004(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_48UD[0x3];                                     // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ATigerCharacter*                             AffectedTarget;                                            // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Location;                                                  // 0x0010(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseCustomLocation;                                        // 0x001C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2X9L[0x3];                                     // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              HearingRangeSquared;                                       // 0x0020(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              VisionRangeSquared;                                        // 0x0024(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MustReactRangeSquared;                                     // 0x0028(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FearMultiplier;                                            // 0x002C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MasqueradeMultiplier;                                      // 0x0030(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bProcessOnlyByAffectedTarget;                              // 0x0034(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bMustBeProcessedByAffectedTarget;                          // 0x0035(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDontProcessForAffectedTarget;                             // 0x0036(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIgnoreInvisibility;                                       // 0x0037(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bShouldDistanceScaleFearValue;                             // 0x0038(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bShouldDistanceScaleMasqueradePoints;                      // 0x0039(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LQPA[0x1E];                                    // 0x003A(0x001E) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerAIMasqueradeEvent
// 0x0088
struct FTigerAIMasqueradeEvent
{
	float                                              Amount;                                                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Location;                                                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     HitLocation;                                               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0PUW[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ATigerCharacter*                             TargetActor;                                               // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerPlayer*                                Instigator;                                                // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerAIPlayerAction                        PlayerAction;                                              // 0x0030(0x0058) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSightConfigData
// 0x0050
struct FTigerSightConfigData
{
	TMap<Tiger_ETigerAIMasqueradeState, struct FTigerSightConfigProperties> SightProperties;                                           // 0x0000(0x0050) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerAISplinePathConnection
// 0x0030
struct FTigerAISplinePathConnection
{
	int                                                Index;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_3TQO[0x4];                                     // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<Tiger_ETigerNPCType>                        RestrictedTypes;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class ATigerAiSplinePathHub*                       ConnectedHub;                                              // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerAISplinePath*                          OwningSpline;                                              // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Weight;                                                    // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAlwaysSwitchSpline;                                       // 0x002C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_I3OZ[0x3];                                     // 0x002D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerAISplinePathData
// 0x00A0
struct FTigerAISplinePathData
{
	TArray<struct FVector>                             PathWaypoints;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FVector>                             PathWaypointsRightVectors;                                 // 0x0010(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTigerAISplinePathConnection                StartingPoint;                                             // 0x0020(0x0030) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTigerAISplinePathConnection                EndPoint;                                                  // 0x0050(0x0030) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FTigerAISplinePathConnection>        AdditionalPathConnections;                                 // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	bool                                               bLooping;                                                  // 0x0090(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EQ27[0x3];                                     // 0x0091(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                ExtraRows;                                                 // 0x0094(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RowDistance;                                               // 0x0098(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QYQ0[0x4];                                     // 0x009C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerRandomVisualAsset
// 0x0010
struct FTigerRandomVisualAsset
{
	class UTigerNPCVisualAsset*                        VisualAsset;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Weight;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_10AT[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerPlayerSequenceByClan
// 0x0018
struct FTigerPlayerSequenceByClan
{
	class UAnimSequence*                               AnimationObjects[0x3];                                     // 0x0000(0x0018) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPlayerMontageByClan
// 0x0018
struct FTigerPlayerMontageByClan
{
	class UAnimMontage*                                AnimationObjects[0x3];                                     // 0x0000(0x0018) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPlayerBlendSpaceByClan
// 0x0018
struct FTigerPlayerBlendSpaceByClan
{
	class UBlendSpace*                                 AnimationObjects[0x3];                                     // 0x0000(0x0018) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPlayerBlendSpace1DByClan
// 0x0018
struct FTigerPlayerBlendSpace1DByClan
{
	class UBlendSpace1D*                               AnimationObjects[0x3];                                     // 0x0000(0x0018) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerTooltipAction
// 0x0048
struct FTigerTooltipAction
{
	struct FText                                       ActionText;                                                // 0x0000(0x0018) (BlueprintVisible, NativeAccessSpecifierPublic)
	struct FName                                       InputAction;                                               // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsHoldAction;                                             // 0x0020(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bListenForOnPreviewKeyDown;                                // 0x0021(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<SlateCore_EHorizontalAlignment>        HAlign;                                                    // 0x0022(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8WZ7[0x1];                                     // 0x0023(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptDelegate                             OnPressed;                                                 // 0x0024(0x0010) (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             OnReleased;                                                // 0x0034(0x0010) (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SISU[0x4];                                     // 0x0044(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerPersistentCharacterID
// 0x0001
struct FTigerPersistentCharacterID
{
	unsigned char                                      SlotIndex;                                                 // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSavedBloodTrackData
// 0x0010
struct FTigerSavedBloodTrackData
{
	TArray<struct FString>                             SelectedPassives;                                          // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPersistentOutfitSetup
// 0x0030
struct FTigerPersistentOutfitSetup
{
	unsigned char                                      OutfitConfig[0x28];                                        // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	int                                                OutfitId;                                                  // 0x0028(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HoodieIndex;                                               // 0x002C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerItemId
// 0x0008
struct FTigerItemId
{
	uint64_t                                           Value;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct Tiger.TigerCharacterAppearance
// 0x0080
struct FTigerCharacterAppearance
{
	struct FTigerPersistentOutfitSetup                 PersistentAppearance;                                      // 0x0000(0x0030) (BlueprintVisible, NativeAccessSpecifierPublic)
	int                                                HeadId;                                                    // 0x0030(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SkinColorIndex;                                            // 0x0034(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HairId;                                                    // 0x0038(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HairColorId;                                               // 0x003C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                EyeColorId;                                                // 0x0040(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TattooId;                                                  // 0x0044(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                FacePaintId;                                               // 0x0048(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HeadgearId;                                                // 0x004C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                EyewearId;                                                 // 0x0050(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PiercingSetId;                                             // 0x0054(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                EyebrowShapeId;                                            // 0x0058(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                EyebrowColorId;                                            // 0x005C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                BeardId;                                                   // 0x0060(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                BeardColorId;                                              // 0x0064(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerGender                                 BodyType;                                                  // 0x0068(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_V5IR[0x7];                                     // 0x0069(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<int>                                        EmoteIds;                                                  // 0x0070(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPersistentPlayerCharacterData
// 0x00A8
struct FTigerPersistentPlayerCharacterData
{
	Tiger_ETigerPowerKitType                           ArchetypeType;                                             // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0KLA[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTigerSavedBloodTrackData                   BloodTrack;                                                // 0x0008(0x0010) (BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTigerCharacterAppearance                   CharacterAppearance;                                       // 0x0018(0x0080) (BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<int>                                        Talents;                                                   // 0x0098(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPersistentPlayerCharacter
// 0x00B8
struct FTigerPersistentPlayerCharacter
{
	struct FTigerPersistentCharacterID                 UniqueCharacterID;                                         // 0x0000(0x0001) (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BL03[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTigerPersistentPlayerCharacterData         Data;                                                      // 0x0008(0x00A8) (BlueprintVisible, NativeAccessSpecifierPublic)
	int64_t                                            LastUsedAt;                                                // 0x00B0(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerHeightenedSensesAudioVisualization
// 0x0008
struct FTigerHeightenedSensesAudioVisualization
{
	class UParticleSystemComponent*                    ParticleSystem;                                            // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerBuildingSystemBalconyVolumeDefaults
// 0x0048
struct FTigerBuildingSystemBalconyVolumeDefaults
{
	struct FVector                                     BottomVolumeOffset;                                        // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     BottomVolumeScale;                                         // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     LeftVolumeOffset;                                          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     LeftVolumeScale;                                           // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     RightVolumeOffset;                                         // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     RightVolumeScale;                                          // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerFacePoseData
// 0x0038
struct FTigerFacePoseData
{
	unsigned char                                      HeadMesh[0x28];                                            // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UPoseAsset*                                  PoseAsset;                                                 // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               PoseSourceAnimation;                                       // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerReplicatedCharacterStats
// 0x0018
struct FTigerReplicatedCharacterStats
{
	struct FTigerCharacterSingleStatModification       Health;                                                    // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FTigerCharacterSingleStatModification       MovementSpeed;                                             // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                              ClimbSpeedMultiplier;                                      // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ReviveSpeedMultiplier;                                     // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerMeshCollection
// 0x00F0
struct FTigerMeshCollection
{
	unsigned char                                      HeadMesh[0x28];                                            // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      HairMesh[0x28];                                            // 0x0028(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      ColorSetAsset[0x28];                                       // 0x0050(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      HairColorSetAsset[0x28];                                   // 0x0078(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      VisualAsset[0x28];                                         // 0x00A0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      PropAsset[0x28];                                           // 0x00C8(0x0028) UNKNOWN PROPERTY: SoftObjectProperty

};

// ScriptStruct Tiger.TigerThrallStats
// 0x0010
struct FTigerThrallStats
{
	TArray<int>                                        Stats;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

};

// ScriptStruct Tiger.TigerBloodResonanceBuffs
// 0x0010
struct FTigerBloodResonanceBuffs
{
	TArray<class UClass*>                              Buffs;                                                     // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerBloodTrack
// 0x0010
struct FTigerBloodTrack
{
	TArray<class UTigerBloodTrackPassiveConfig*>       Passives;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerBloodVeinBranchMovementSettings
// 0x0024
struct FTigerBloodVeinBranchMovementSettings
{
	float                                              LaunchPower;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SimulationTimeScale;                                       // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              YawRotationSpeed;                                          // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PitchDownRotationSpeed;                                    // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PitchUpRotationSpeed;                                      // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TargetPitchOffset;                                         // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxTargetPitch;                                            // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxSpeed;                                                  // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaximumMovementYawAdjustment;                              // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerBuffReplicatedInstanceData
// 0x0020
struct FTigerBuffReplicatedInstanceData
{
	class UClass*                                      BuffType;                                                  // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                BuffID;                                                    // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TimeLeft;                                                  // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BuffStrength;                                              // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ATigerCharacter>              BuffCaster;                                                // 0x0014(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CAWR[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerDeferredBuffInstantiation
// 0x0028
struct FTigerDeferredBuffInstantiation
{
	unsigned char                                      UnknownData_W5A7[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ATigerCharacter*                             BuffCaster;                                                // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2ME8[0x18];                                    // 0x0010(0x0018) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerBuildingSystemWallPieceInstancingDataEntry
// 0x0018
struct FTigerBuildingSystemWallPieceInstancingDataEntry
{
	class UStaticMeshComponent*                        Component;                                                 // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                      Data;                                                      // 0x0008(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerBuildingSystemWallPieceInstancingData
// 0x0010
struct FTigerBuildingSystemWallPieceInstancingData
{
	TArray<struct FTigerBuildingSystemWallPieceInstancingDataEntry> Entries;                                                   // 0x0000(0x0010) (ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerStreamableBuildingSide
// 0x0030
struct FTigerStreamableBuildingSide
{
	TArray<class UStaticMeshComponent*>                SideSegments;                                              // 0x0000(0x0010) (Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                     Normal;                                                    // 0x0010(0x000C) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Center;                                                    // 0x001C(0x000C) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bVisible;                                                  // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DDZ8[0x7];                                     // 0x0029(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerStreamableBuildingSides
// 0x0010
struct FTigerStreamableBuildingSides
{
	TArray<struct FTigerStreamableBuildingSide>        BuildingWalls;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerChallengeTypeID
// 0x0004
struct FTigerChallengeTypeID
{
	uint32_t                                           UID;                                                       // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct Tiger.TigerMetaStoreEntryItem
// 0x0010
struct FTigerMetaStoreEntryItem
{
	struct FTigerItemId                                ItemId;                                                    // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           Quantity;                                                  // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FCZA[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerGroupId
// 0x0010
struct FTigerGroupId
{
	struct FGuid                                       ID;                                                        // 0x0000(0x0010) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct Tiger.TigerFeedingDescription
// 0x0030
struct FTigerFeedingDescription
{
	class UAnimMontage*                                AttackerApproach;                                          // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                AttackerFeeding;                                           // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                AttackerDecouple;                                          // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                VictimApproach;                                            // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                VictimFeeding;                                             // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                VictimDecouple;                                            // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerFeedingMontages
// 0x0090
struct FTigerFeedingMontages
{
	struct FTigerFeedingDescription                    FemaleTargetDescription;                                   // 0x0000(0x0030) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FTigerFeedingDescription                    MaleTargetDescription;                                     // 0x0030(0x0030) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FTigerFeedingDescription                    EntityTargetDescription;                                   // 0x0060(0x0030) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerFeedingDataByGender
// 0x0120
struct FTigerFeedingDataByGender
{
	struct FTigerFeedingMontages                       FeedingDataByVampireGender[0x2];                           // 0x0000(0x0120) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRecentlyStreamedCellEntries
// 0x0010
struct FTigerRecentlyStreamedCellEntries
{
	class UTigerWorldCompositionCellComponent*         Cell;                                                      // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2I5V[0x8];                                     // 0x0008(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerStreamingPlayer
// 0x0038
struct FTigerStreamingPlayer
{
	class APlayerController*                           PlayerController;                                          // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MIIO[0x30];                                    // 0x0008(0x0030) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerBuildingSystemTransformableCorner
// 0x0040
struct FTigerBuildingSystemTransformableCorner
{
	class UPoseableMeshComponent*                      Component;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                        StaticComponent;                                           // 0x0008(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    MiddleBoneRotation;                                        // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     EndBoneLocation;                                           // 0x001C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     StartNormal;                                               // 0x0028(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     NextNormal;                                                // 0x0034(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerChallengeCollectionEntry
// 0x0010
struct FTigerChallengeCollectionEntry
{
	class UTigerChallenge*                             ReferenceChallenge;                                        // 0x0000(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerChallengeTypeID                       ChallengeTypeID;                                           // 0x0008(0x0004) (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SK9U[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerChallengeInstanceID
// 0x0004
struct FTigerChallengeInstanceID
{
	int                                                UID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct Tiger.TigerSeasonalChallengeInstanceDefinition
// 0x0010
struct FTigerSeasonalChallengeInstanceDefinition
{
	struct FTigerChallengeInstanceID                   ChallengeInstanceID;                                       // 0x0000(0x0004) (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerChallengeTypeID                       ChallengeTypeID;                                           // 0x0004(0x0004) (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerItemId                                RewardId;                                                  // 0x0008(0x0008) (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSeasonConfig_DailyFinalReward
// 0x0038
struct FTigerSeasonConfig_DailyFinalReward
{
	struct FTigerItemId                                DailyFinalRewardIds[0x7];                                  // 0x0000(0x0038) (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSeasonConfig_DailyRewardCollection
// 0x0020
struct FTigerSeasonConfig_DailyRewardCollection
{
	TArray<struct FTigerItemId>                        TrackRewardIds;                                            // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FTigerSeasonConfig_DailyFinalReward> DailyFinalRewardWeeks;                                     // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerChallengeRequirementBase
// 0x0008
struct FTigerChallengeRequirementBase
{
	unsigned char                                      UnknownData_45Y8[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerChallengeRequirementWeaponType
// 0x0010 (0x0018 - 0x0008)
struct FTigerChallengeRequirementWeaponType : public FTigerChallengeRequirementBase
{
	bool                                               bAnyRangedWeapon;                                          // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bAnyMeleeWeapon;                                           // 0x0009(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_99ZN[0x6];                                     // 0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UTigerItemAsset*                             RequiredWeaponAsAsset;                                     // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct Tiger.TigerChallengeRequirementGameMode
// 0x0008 (0x0010 - 0x0008)
struct FTigerChallengeRequirementGameMode : public FTigerChallengeRequirementBase
{
	bool                                               bSpecificGameMode;                                         // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	Tiger_EMatchBalanceMode                            RequiredGameMode;                                          // 0x0009(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_591Z[0x6];                                     // 0x000A(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerChallengeRequirementDisciplineSlot
// 0x0008 (0x0010 - 0x0008)
struct FTigerChallengeRequirementDisciplineSlot : public FTigerChallengeRequirementBase
{
	bool                                               bUseSpecificSlot;                                          // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	Tiger_ETigerDisciplineSlot                         RequiredSlot;                                              // 0x0009(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_4A8C[0x6];                                     // 0x000A(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerInventoryItemOwnerType
// 0x0003
struct FTigerInventoryItemOwnerType
{
	Tiger_ETigerClan                                   Clan;                                                      // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerPowerKitType                           Archetype;                                                 // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerGender                                 Gender;                                                    // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerLodSplitMesh
// 0x0078
struct FTigerLodSplitMesh
{
	unsigned char                                      Mesh[0x28];                                                // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      Mesh_Lod0[0x28];                                           // 0x0028(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      Mesh_NoLod0[0x28];                                         // 0x0050(0x0028) UNKNOWN PROPERTY: SoftObjectProperty

};

// ScriptStruct Tiger.TigerCharacterCustomizationScalarParameter
// 0x0010
struct FTigerCharacterCustomizationScalarParameter
{
	Tiger_ETigerCharacterDynamicMeshType               DynamicMeshType;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerCharacterMeshPart                      Part;                                                      // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HOYN[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       Name;                                                      // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Value;                                                     // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterCustomizationTextureParameter
// 0x0018
struct FTigerCharacterCustomizationTextureParameter
{
	Tiger_ETigerCharacterDynamicMeshType               DynamicMeshType;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerCharacterMeshPart                      Part;                                                      // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HF3U[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       Name;                                                      // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HK75[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UTexture*                                    Texture;                                                   // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterCustomizationColorParameter
// 0x001C
struct FTigerCharacterCustomizationColorParameter
{
	Tiger_ETigerCharacterDynamicMeshType               DynamicMeshType;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerCharacterMeshPart                      Part;                                                      // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_019Z[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       Name;                                                      // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                                Color;                                                     // 0x000C(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterCustomizationParameters
// 0x0038
struct FTigerCharacterCustomizationParameters
{
	TArray<struct FTigerCharacterCustomizationScalarParameter> Scalars;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTigerCharacterCustomizationColorParameter> Colors;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTigerCharacterCustomizationTextureParameter> Textures;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FName                                       MaterialSlotName;                                          // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterOutfitHoodieVariation
// 0x00B8
struct FTigerCharacterOutfitHoodieVariation
{
	bool                                               bEnableHairAnimDynamics;                                   // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FZUC[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      Mesh[0x28];                                                // 0x0001(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      Materials[0x50];                                           // 0x0030(0x0050) UNKNOWN PROPERTY: MapProperty
	struct FTigerCharacterCustomizationParameters      AdditionalParameters;                                      // 0x0080(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerClusteredItem
// 0x0064 (0x0070 - 0x000C)
struct FTigerClusteredItem : public FFastArraySerializerItem
{
	unsigned char                                      UnknownData_S5FH[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  Transform;                                                 // 0x0010(0x0030) (IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     Velocity;                                                  // 0x0040(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_K0WS[0x4];                                     // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UTigerItemAsset*                             Item;                                                      // 0x0050(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ItemCount;                                                 // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           ItemUID;                                                   // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ATigerPlayerState>            PlayerWhoDroppedItem;                                      // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DropTime;                                                  // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerTelemetryItemSourceID                  ItemSource;                                                // 0x006C(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7BJM[0x3];                                     // 0x006D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.ItemClusterArray
// 0x0018 (0x0120 - 0x0108)
struct FItemClusterArray : public FFastArraySerializer
{
	TArray<struct FTigerClusteredItem>                 Items;                                                     // 0x0108(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	class ATigerItemCluster*                           Parent;                                                    // 0x0118(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerItemDatabaseCategoryEntry
// 0x0030
struct FTigerItemDatabaseCategoryEntry
{
	uint64_t                                           ItemId;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ItemPath[0x28];                                            // 0x0008(0x0028) UNKNOWN PROPERTY: SoftClassProperty

};

// ScriptStruct Tiger.TigerChallengeRequirementClan
// 0x0008 (0x0010 - 0x0008)
struct FTigerChallengeRequirementClan : public FTigerChallengeRequirementBase
{
	bool                                               bSpecificClan;                                             // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	Tiger_ETigerClan                                   RequiredClan;                                              // 0x0009(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_SH0J[0x6];                                     // 0x000A(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerRevealedWave
// 0x0030
struct FTigerRevealedWave
{
	class ATigerHaven*                                 RevealedHaven;                                             // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Index;                                                     // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Z3JS[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<int>                                        DeformIndices;                                             // 0x0010(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                      TargetArea;                                                // 0x0020(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerWaveData
// 0x0090
struct FTigerWaveData
{
	unsigned char                                      UnknownData_DOUB[0x58];                                    // 0x0000(0x0058) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTigerRevealedWave                          RevealData;                                                // 0x0058(0x0030) (Transient, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QD1P[0x8];                                     // 0x0088(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerHolyIncenseSettings
// 0x0001
struct FTigerHolyIncenseSettings
{
	Tiger_EMatchBalanceMode                            BalanceMode;                                               // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerJudgeSwingCollisionInstant
// 0x0030
struct FTigerJudgeSwingCollisionInstant
{
	float                                              TimeInSwing;                                               // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     SwordStartSweepLoc;                                        // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     SwordEndSweepLoc;                                          // 0x0010(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KKXP[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FQuat                                       SwordRot;                                                  // 0x0020(0x0010) (IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerJudgeSwingCollisionInfo
// 0x0010
struct FTigerJudgeSwingCollisionInfo
{
	TArray<struct FTigerJudgeSwingCollisionInstant>    CollisionInstants;                                         // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPlayerMeshMaterialData
// 0x0010
struct FTigerPlayerMeshMaterialData
{
	TArray<class UMaterialInterface*>                  OriginalMaterials;                                         // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPaperDollHighlightComponents
// 0x0050
struct FTigerPaperDollHighlightComponents
{
	TMap<class USpotLightComponent*, float>            SpotLightIntensities;                                      // 0x0000(0x0050) (ContainsInstancedReference, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPropAttachmentInfo
// 0x0060
struct FTigerPropAttachmentInfo
{
	struct FName                                       AttachIdentifier;                                          // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStreamableRenderAsset*                      Prop;                                                      // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SocketName;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_V4OH[0x8];                                     // 0x0018(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  Transform;                                                 // 0x0020(0x0030) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UClass*                                      PropCompClass;                                             // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_39J9[0x8];                                     // 0x0058(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerDummyPropAttachment
// 0x0070
struct FTigerDummyPropAttachment
{
	struct FTigerPropAttachmentInfo                    AttachmentInfo;                                            // 0x0000(0x0060) (Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bShow;                                                     // 0x0060(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_V0ED[0xF];                                     // 0x0061(0x000F) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerRequest_UpdateSeasonProgressGenericExp
// 0x0008
struct FTigerRequest_UpdateSeasonProgressGenericExp
{
	uint32_t                                           Level;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           Exp;                                                       // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_UpdateSeasonProgress
// 0x0078
struct FTigerRequest_UpdateSeasonProgress
{
	uint32_t                                           ExpGained;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           ExpRemovedDueToConversion;                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           LevelCount;                                                // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_O0JG[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     ArchetypeId;                                               // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           PlayedSeconds;                                             // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IncrementMatchesPlayed;                                    // 0x0024(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_K1JC[0x3];                                     // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<struct FString, struct FTigerRequest_UpdateSeasonProgressGenericExp> GenericExps;                                               // 0x0028(0x0050) (NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponseEnvelope
// 0x0018
struct FTigerResponseEnvelope
{
	bool                                               OK;                                                        // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Retryable;                                                 // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_G8M0[0x6];                                     // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     Error;                                                     // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_IncrementSeasonExp
// 0x0008 (0x0020 - 0x0018)
struct FTigerResponse_IncrementSeasonExp : public FTigerResponseEnvelope
{
	uint32_t                                           OldExp;                                                    // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           NewExp;                                                    // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_IncrementSeasonExp
// 0x0004
struct FTigerRequest_IncrementSeasonExp
{
	uint32_t                                           Exp;                                                       // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_UpdateLastUse
// 0x0001
struct FTigerRequest_UpdateLastUse
{
	unsigned char                                      CharacterId;                                               // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_Character
// 0x0020
struct FTigerResponse_Character
{
	unsigned char                                      CharacterId;                                               // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GKHF[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     Data;                                                      // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64_t                                            LastUsedAt;                                                // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerQuestIdentifier
// 0x0030
struct FTigerQuestIdentifier
{
	struct FString                                     QuestLineId;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     QuestId;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                       ObjectiveId;                                               // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerNpcDialogue
// 0x00A8
struct FTigerNpcDialogue
{
	struct FText                                       DialogueHeader;                                            // 0x0000(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FText>                               DialogueText;                                              // 0x0018(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                               bRandomiseText;                                            // 0x0028(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerDialoguePriority                       DialoguePriority;                                          // 0x0029(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerDialogueIdleAnimation                  IdleAnimation;                                             // 0x002A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZP24[0x5];                                     // 0x002B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UTigerDialogueCondition*>             DialogueConditions;                                        // 0x0030(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	Tiger_ETigerDialogueRepeatability                  Repeatability;                                             // 0x0040(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerDialogueCategory                       DialogueCategory;                                          // 0x0041(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIgnoreCategoryRestrictions;                               // 0x0042(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_NZA5[0x5];                                     // 0x0043(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTigerQuestIdentifier                       QuestToStartId;                                            // 0x0048(0x0030) (Edit, DisableEditOnInstance, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<class UTigerGrimoireEntry*>                 EntriesToUnlock;                                           // 0x0078(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               DialogueAudio;                                             // 0x0088(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                AnimationToPlay;                                           // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8IEE[0x10];                                    // 0x0098(0x0010) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerScoutedCharacter
// 0x0018
struct FTigerScoutedCharacter
{
	class ATigerCharacter*                             ScoutedCharacter;                                          // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerMapMarkerProxy*                        MarkerProxy;                                               // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_PYHP[0x8];                                     // 0x0010(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerScouterCharacterData
// 0x0030
struct FTigerScouterCharacterData
{
	TArray<struct FTigerScoutedCharacter>              ScoutedCharacters;                                         // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTigerScoutedCharacter>              GroupScoutedCharacters;                                    // 0x0010(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	class UClass*                                      ScoutedPlayerMapMarkerClass;                               // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      ScoutedNpcMapMarkerClass;                                  // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.EarthshockUseDataNetworked
// 0x0034
struct FEarthshockUseDataNetworked
{
	struct FVector                                     StartLocation;                                             // 0x0000(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     TargetLocation;                                            // 0x000C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     SurfaceNormal;                                             // 0x0018(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     ConeDirection;                                             // 0x0024(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bTargetIsWall;                                             // 0x0030(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_K78P[0x3];                                     // 0x0031(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerShockwaveWallData
// 0x0060
struct FTigerShockwaveWallData
{
	TArray<class UCurveFloat*>                         SpeedCurve;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UCurveVector*>                        EffectExtentCurve;                                         // 0x0010(0x0010) (Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVector>                             TerrainSweepBoxExtent;                                     // 0x0020(0x0010) (Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<float>                                      TravelDistance;                                            // 0x0030(0x0010) (Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<float>                                      Damage;                                                    // 0x0040(0x0010) (Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UClass*>                              OnHitBuff;                                                 // 0x0050(0x0010) (Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerMetaStoreEntry
// 0x0050
struct FTigerMetaStoreEntry
{
	uint64_t                                           StoreEntryID;                                              // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           PremiumPrice;                                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RQWO[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     ImagePath;                                                 // 0x0010(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           Discount;                                                  // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VIIF[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDateTime                                   StartDate;                                                 // 0x0028(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   EndDate;                                                   // 0x0030(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                FlashStoreSlot;                                            // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DP8Z[0x4];                                     // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FTigerMetaStoreEntryItem>            Items;                                                     // 0x0040(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerMetaStoreEntriesConfig
// 0x0028
struct FTigerMetaStoreEntriesConfig
{
	Tiger_ETigerMetaStoreCategoryType                  ConfigCategory;                                            // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Q14A[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FTigerMetaStoreEntry>                StoreEntries;                                              // 0x0008(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int64_t                                            Checksum;                                                  // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsValid;                                                  // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IVJM[0x7];                                     // 0x0021(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerMetaStoreEntriesKeeper
// 0x0040
struct FTigerMetaStoreEntriesKeeper
{
	TArray<struct FScriptDelegate>                     ConfigEventSubscribers;                                    // 0x0000(0x0010) (ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTigerMetaStoreEntriesConfig                StoreEntryConfig;                                          // 0x0010(0x0028) (NativeAccessSpecifierPublic)
	Tiger_ETigerMetaStoreEventType                     LastEventStatus;                                           // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KQJ2[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.AutoInitializedWidget
// 0x0020
struct FAutoInitializedWidget
{
	class UClass*                                      WidgetClass;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     AssignToPropertyName;                                      // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAddToViewportOnPlayerSpawn;                               // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAddToOnScreenWidgets;                                     // 0x0019(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VVFA[0x2];                                     // 0x001A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                ZOrder;                                                    // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerElysiumNpcAnimationData
// 0x0010
struct FTigerElysiumNpcAnimationData
{
	class UAnimSequenceBase*                           AnimationToPlay;                                           // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AnimationOffset;                                           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2TB5[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerElysiumNpcProp
// 0x0090
struct FTigerElysiumNpcProp
{
	unsigned char                                      PropAsset[0x28];                                           // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      PropActorAsset[0x28];                                      // 0x0028(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	struct FTransform                                  LocalTransform;                                            // 0x0050(0x0030) (Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FName                                       AttachmentPoint;                                           // 0x0080(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EQOB[0x8];                                     // 0x0088(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerElysiumNpcData
// 0x01D0
struct FTigerElysiumNpcData
{
	unsigned char                                      BodyMesh[0x28];                                            // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      HeadMesh[0x28];                                            // 0x0028(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      HairMesh[0x28];                                            // 0x0050(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      HoodieMesh[0x28];                                          // 0x0078(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	struct FTigerElysiumNpcProp                        FirstPropAsset;                                            // 0x00A0(0x0090) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTigerElysiumNpcProp                        SecondPropAsset;                                           // 0x0130(0x0090) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTigerElysiumNpcAnimationData               AnimationData;                                             // 0x01C0(0x0010) (Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPersistentPlayerCardData
// 0x000C
struct FTigerPersistentPlayerCardData
{
	int                                                CharacterIconId;                                           // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CharacterCardShapeMaskId;                                  // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CharacterCardBackgroundTextureId;                          // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPlayingEmote
// 0x0010
struct FTigerPlayingEmote
{
	class UAnimMontage*                                Montage;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartTime;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               StopsMovement;                                             // 0x000C(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZGQ9[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerNPCSpawningPoint
// 0x0020
struct FTigerNPCSpawningPoint
{
	class UTigerNPCAsset*                              NPCAsset;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     SpawnPoint;                                                // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    Rotation;                                                  // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerQuestObjectivePersistentProgressEntry
// 0x0018
struct FTigerQuestObjectivePersistentProgressEntry
{
	struct FString                                     Guid;                                                      // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Progress;                                                  // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_R67Z[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerQuestPersistentProgressEntry
// 0x0018
struct FTigerQuestPersistentProgressEntry
{
	bool                                               bHasDistributedReward;                                     // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W69S[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FTigerQuestObjectivePersistentProgressEntry> ObjectivesProgress;                                        // 0x0008(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerQuestLinePersistentProgress
// 0x0050
struct FTigerQuestLinePersistentProgress
{
	TMap<struct FString, struct FTigerQuestPersistentProgressEntry> Progress;                                                  // 0x0000(0x0050) (RepSkip, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerQuestPersistentProgress
// 0x0050
struct FTigerQuestPersistentProgress
{
	TMap<struct FString, struct FTigerQuestLinePersistentProgress> Progress;                                                  // 0x0000(0x0050) (RepSkip, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterHolsteredWeaponTransforms
// 0x0060
struct FTigerCharacterHolsteredWeaponTransforms
{
	struct FTransform                                  MeleeWeaponHolsteredTransform;                             // 0x0000(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                                  MeleeWeaponSecondaryHolsteredTransform;                    // 0x0030(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerInventoryCombinedItemValue
// 0x0010
struct FTigerInventoryCombinedItemValue
{
	struct FTigerInventoryItemOwnerType                Key;                                                       // 0x0000(0x0003) (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_H3XG[0x5];                                     // 0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      Value;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterHeadHeadgearOffset
// 0x0018
struct FTigerCharacterHeadHeadgearOffset
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    Rotation;                                                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.MapLandmarkPoint
// 0x0018
struct FMapLandmarkPoint
{
	struct FName                                       LandmarkName;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   PositionInWorld;                                           // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   PositionOnMap;                                             // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPingContext
// 0x0010
struct FTigerPingContext
{
	class UDataAsset*                                  Asset;                                                     // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Argument;                                                  // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      TelemetryTypeId;                                           // 0x000C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EHX1[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerPingNotificationNetData
// 0x0018
struct FTigerPingNotificationNetData
{
	class UClass*                                      PingClass;                                                 // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerPingContext                           Context;                                                   // 0x0008(0x0010) (BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerGrimoireSearchEntry
// 0x0038
struct FTigerGrimoireSearchEntry
{
	struct FString                                     Name;                                                      // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T6UH[0x8];                                     // 0x0010(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UTigerGrimoireCategory*                      Category;                                                  // 0x0018(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     EntryIdAsString;                                           // 0x0020(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MV1V[0x8];                                     // 0x0030(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.DisciplineUse
// 0x0050
struct FDisciplineUse
{
	Tiger_ETigerDisciplinesEnum                        DisciplineUsed;                                            // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_3PC2[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     Location;                                                  // 0x0004(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Direction;                                                 // 0x0010(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZXL7[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class ATigerCharacter*>                     Targets;                                                   // 0x0020(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                     DisciplineSpecificVector1;                                 // 0x0030(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     DisciplineSpecificVector2;                                 // 0x003C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisciplineSpecificBool1;                                  // 0x0048(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisciplineSpecificBool2;                                  // 0x0049(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_D7GD[0x6];                                     // 0x004A(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerSeasonSessionExperience
// 0x0018
struct FTigerSeasonSessionExperience
{
	TArray<int>                                        SeasonExperienceAccumulatedSources;                        // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                SeasonExperienceAccumulated;                               // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_E3AG[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerPlayerMatchMetaStats
// 0x0038
struct FTigerPlayerMatchMetaStats
{
	struct FTigerSeasonSessionExperience               SeasonSessionExperienceAccumulated;                        // 0x0000(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int                                                SeasonExpBeforeSession;                                    // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ArchetypeExpBeforeSession;                                 // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ArchetypeExperienceAccumulated;                            // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SoftCurrencyBeforeSession;                                 // 0x0024(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SoftCurrencyAccumulated;                                   // 0x0028(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DWK2[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTigerItemId                                SoftCurrencyItemId;                                        // 0x0030(0x0008) (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPlayerPostMatchScreenHighlightStat
// 0x000C
struct FTigerPlayerPostMatchScreenHighlightStat
{
	int                                                MatchStatValue;                                            // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SeasonAverage;                                             // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerSeasonMatchStatType                    MatchStatType;                                             // 0x0008(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsNewSeasonBest;                                          // 0x0009(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T2WG[0x2];                                     // 0x000A(0x0002) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerPlayerMatchStats
// 0x0038
struct FTigerPlayerMatchStats
{
	Tiger_ETigerKillerType                             KillerType;                                                // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FD55[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     KillerName;                                                // 0x0008(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerPlayerPostMatchScreenHighlightStat    Placement;                                                 // 0x0018(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HEFG[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FTigerPlayerPostMatchScreenHighlightStat> Stats;                                                     // 0x0028(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerProgressedChallengeWrapper
// 0x0028
struct FTigerProgressedChallengeWrapper
{
	struct FText                                       ChallengeDescription;                                      // 0x0000(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int                                                TargetValue;                                               // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PostSessionProgress;                                       // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PreSessionProgress;                                        // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsDailyChallenge;                                         // 0x0024(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YWFF[0x3];                                     // 0x0025(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerGroupInvitation
// 0x0010
struct FTigerGroupInvitation
{
	struct FTigerGroupId                               GroupID;                                                   // 0x0000(0x0010) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterServerHit
// 0x0038
struct FTigerCharacterServerHit
{
	class ATigerCharacter*                             TigerChar;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                         VictimLocation;                                            // 0x0008(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      BoneIndexHit;                                              // 0x0014(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSharkInt8Vector                            ImpactOffset;                                              // 0x0015(0x0003) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal                   SwingDirection;                                            // 0x0018(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0C97[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAnimMontage*                                KnockbackMontage;                                          // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAbortAttack;                                              // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      CompressedActorYaw;                                        // 0x0031(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_98GJ[0x6];                                     // 0x0032(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerMeleeAttackNetData
// 0x0020
struct FTigerMeleeAttackNetData
{
	unsigned char                                      UnknownData_JMBN[0x20];                                    // 0x0000(0x0020) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerCharacterClientHit
// 0x0028
struct FTigerCharacterClientHit
{
	class ATigerCharacter*                             TigerChar;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                         VictimLocation;                                            // 0x0008(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      BoneIndexHit;                                              // 0x0014(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSharkInt8Vector                            ImpactOffset;                                              // 0x0015(0x0003) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal                   SwingDirection;                                            // 0x0018(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      WeaponIndex;                                               // 0x0024(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EA28[0x3];                                     // 0x0025(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerNetworkedDebugShape
// 0x0040
struct FTigerNetworkedDebugShape
{
	struct FCoreUObject_FColor                         Color;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Location;                                                  // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     ShapeSpecificData;                                         // 0x0010(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6GWD[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FQuat                                       Rotation;                                                  // 0x0020(0x0010) (IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                              Thickness;                                                 // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LifeTime;                                                  // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      Shape;                                                     // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      DepthPriority;                                             // 0x0039(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bPersistentLines;                                          // 0x003A(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_P5P7[0x5];                                     // 0x003B(0x0005) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerFireProjectileData
// 0x0014
struct FTigerFireProjectileData
{
	struct FVector_NetQuantize100                      ProjectileSpawnLocation;                                   // 0x0000(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ShootDirPitch;                                             // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ShootDirYaw;                                               // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerFireProjectileDataInterpolated
// 0x0004 (0x0018 - 0x0014)
struct FTigerFireProjectileDataInterpolated : public FTigerFireProjectileData
{
	float                                              LocationAlpha;                                             // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerClientItemDefinition
// 0x0018
struct FTigerClientItemDefinition
{
	struct FTigerItemId                                ItemId;                                                    // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Cost;                                                      // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WLXZ[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTigerItemId                                SoftCurrencyId;                                            // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPartyId
// 0x0010
struct FTigerPartyId
{
	struct FGuid                                       Guid;                                                      // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSpawnGroupBudget
// 0x0008
struct FTigerSpawnGroupBudget
{
	int                                                MaxSpawned;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MinSpawned;                                                // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSpawnGroupBudgetTableRow
// 0x0010 (0x0018 - 0x0008)
struct FTigerSpawnGroupBudgetTableRow : public FTableRowBase
{
	struct FTigerSpawnGroupBudget                      Budgets[0x2];                                              // 0x0008(0x0010) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSessionConnectionParams
// 0x0020
struct FTigerSessionConnectionParams
{
	unsigned char                                      UnknownData_LFXP[0x20];                                    // 0x0000(0x0020) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerRequest_AcknowledgeStateUpdate
// 0x0004
struct FTigerRequest_AcknowledgeStateUpdate
{
	uint32_t                                           StateUpdateId;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_CreateGameSession
// 0x0020
struct FTigerRequest_CreateGameSession
{
	struct FString                                     GameSessionToken;                                          // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     SESSIONTYPE;                                               // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_AcceptInvite
// 0x0060 (0x0078 - 0x0018)
struct FTigerResponse_AcceptInvite : public FTigerResponseEnvelope
{
	struct FString                                     HostPlayerId;                                              // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     PartyId;                                                   // 0x0028(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             PartyPlayerIds;                                            // 0x0038(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                LeaderIndex;                                               // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SRUY[0x4];                                     // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     HostAddr;                                                  // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HostPort;                                                  // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_THLP[0x4];                                     // 0x0064(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     GameSessionToken;                                          // 0x0068(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_DeclineInvite
// 0x0010
struct FTigerRequest_DeclineInvite
{
	struct FString                                     PartyInviteToken;                                          // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_AcceptInvite
// 0x0010
struct FTigerRequest_AcceptInvite
{
	struct FString                                     PartyInviteToken;                                          // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_InvitePlayer
// 0x0010 (0x0028 - 0x0018)
struct FTigerResponse_InvitePlayer : public FTigerResponseEnvelope
{
	struct FString                                     InviteId;                                                  // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_InvitePlayer
// 0x0030
struct FTigerRequest_InvitePlayer
{
	struct FString                                     GuestPlayerId;                                             // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     GameSessionToken;                                          // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     LanSessionUrl;                                             // 0x0020(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_GetParty
// 0x0058 (0x0070 - 0x0018)
struct FTigerResponse_GetParty : public FTigerResponseEnvelope
{
	bool                                               PartyFound;                                                // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IIIC[0x7];                                     // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     PartyId;                                                   // 0x0020(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             PlayerIds;                                                 // 0x0030(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                LeaderIndex;                                               // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxMembers;                                                // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     HostAddr;                                                  // 0x0048(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HostPort;                                                  // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_S4LV[0x4];                                     // 0x005C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     GameSessionToken;                                          // 0x0060(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPartyInviteToken
// 0x0010
struct FTigerPartyInviteToken
{
	struct FString                                     Content;                                                   // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPlayerIdWithPlacement
// 0x0018
struct FTigerPlayerIdWithPlacement
{
	struct FString                                     PlayerId;                                                  // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Placement;                                                 // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1JVC[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerRequest_RegisterGameSessionResults
// 0x0010
struct FTigerRequest_RegisterGameSessionResults
{
	TArray<struct FTigerPlayerIdWithPlacement>         Result;                                                    // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_GetMatchmakingToken
// 0x0010 (0x0028 - 0x0018)
struct FTigerResponse_GetMatchmakingToken : public FTigerResponseEnvelope
{
	struct FString                                     MatchmakingDataToken;                                      // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_GetMatchmakingToken
// 0x0010
struct FTigerRequest_GetMatchmakingToken
{
	TArray<struct FString>                             PlayerIds;                                                 // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_GetSeasonConfigs
// 0x0078 (0x0090 - 0x0018)
struct FTigerResponse_GetSeasonConfigs : public FTigerResponseEnvelope
{
	TMap<uint32_t, struct FString>                     ConfigsBySeasonId;                                         // 0x0018(0x0050) (NativeAccessSpecifierPublic)
	struct FString                                     PublicIpv4;                                                // 0x0068(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     PublicIpv6;                                                // 0x0078(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   CurrentDateTime;                                           // 0x0088(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_GenericExp
// 0x0008
struct FTigerResponse_GenericExp
{
	uint32_t                                           Level;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           Exp;                                                       // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_TransactionalPlayerData
// 0x0118
struct FTigerResponse_TransactionalPlayerData
{
	int                                                Version;                                                   // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           SeasonId;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           SeasonLevel;                                               // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           SeasonLevelExp;                                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           SeasonPlacementExpBonusPercentage;                         // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2994[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<struct FString, struct FTigerResponse_GenericExp> GenericExps;                                               // 0x0018(0x0050) (NativeAccessSpecifierPublic)
	TMap<struct FString, int>                          InventoryItems;                                            // 0x0068(0x0050) (NativeAccessSpecifierPublic)
	TMap<struct FString, struct FString>               CustomizationConfigs;                                      // 0x00B8(0x0050) (NativeAccessSpecifierPublic)
	float                                              Rating;                                                    // 0x0108(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_56NO[0x4];                                     // 0x010C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	uint64_t                                           PremiumCurrencyBalance;                                    // 0x0110(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_BuyItem
// 0x0118 (0x0130 - 0x0018)
struct FTigerResponse_BuyItem : public FTigerResponseEnvelope
{
	struct FTigerResponse_TransactionalPlayerData      Transactional;                                             // 0x0018(0x0118) (NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_SetCustomizationConfigs
// 0x0020
struct FTigerRequest_SetCustomizationConfigs
{
	TArray<struct FString>                             Keys;                                                      // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FString>                             Values;                                                    // 0x0010(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerBoughtItemElement
// 0x0018
struct FTigerBoughtItemElement
{
	struct FString                                     ItemId;                                                    // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           Quantity;                                                  // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_L632[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerResponse_BuyStoreEntries
// 0x0130 (0x0148 - 0x0018)
struct FTigerResponse_BuyStoreEntries : public FTigerResponseEnvelope
{
	struct FTigerResponse_TransactionalPlayerData      Transactional;                                             // 0x0018(0x0118) (NativeAccessSpecifierPublic)
	TArray<struct FTigerBoughtItemElement>             BoughtItems;                                               // 0x0130(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	unsigned char                                      BuyResult;                                                 // 0x0140(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CTU6[0x7];                                     // 0x0141(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerStoreEntryAndQuantity
// 0x0018
struct FTigerStoreEntryAndQuantity
{
	struct FString                                     ItemId;                                                    // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           Quantity;                                                  // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_S950[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerRequest_BuyStoreEntries
// 0x0018
struct FTigerRequest_BuyStoreEntries
{
	TArray<struct FTigerStoreEntryAndQuantity>         StoreEntriesToBuy;                                         // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	uint32_t                                           TotalCost;                                                 // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      Channel;                                                   // 0x0014(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_M3RD[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerItemIdWithQuantity
// 0x0018
struct FTigerItemIdWithQuantity
{
	struct FString                                     ID;                                                        // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           Quantity;                                                  // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XJ39[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerResponse_CategoryGroupDefinition
// 0x0010
struct FTigerResponse_CategoryGroupDefinition
{
	struct FString                                     CategoryDefinitions;                                       // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_GetStoreItemConfigs
// 0x0050 (0x0068 - 0x0018)
struct FTigerResponse_GetStoreItemConfigs : public FTigerResponseEnvelope
{
	TMap<struct FString, struct FTigerResponse_CategoryGroupDefinition> CategoryGroups;                                            // 0x0018(0x0050) (NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_StoreEntryConfig
// 0x0001
struct FTigerRequest_StoreEntryConfig
{
	unsigned char                                      Show;                                                      // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_UpdatePlayerData
// 0x0020
struct FTigerRequest_UpdatePlayerData
{
	struct FString                                     Data;                                                      // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     CardData;                                                  // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_GetCreatePlayer
// 0x0168 (0x0180 - 0x0018)
struct FTigerResponse_GetCreatePlayer : public FTigerResponseEnvelope
{
	struct FTigerResponse_TransactionalPlayerData      Transactional;                                             // 0x0018(0x0118) (NativeAccessSpecifierPublic)
	struct FString                                     Data;                                                      // 0x0130(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     CardData;                                                  // 0x0140(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Banned;                                                    // 0x0150(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      BanReason;                                                 // 0x0151(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KSAD[0x6];                                     // 0x0152(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     BanEndsAt;                                                 // 0x0158(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Muted;                                                     // 0x0168(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      MutedReason;                                               // 0x0169(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8AYH[0x6];                                     // 0x016A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     MutedEndsAt;                                               // 0x0170(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerRequest_GetCreatePlayer
// 0x0001
struct FTigerRequest_GetCreatePlayer
{
	unsigned char                                      UnknownData_L19K[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerOutfitCustomizationConfigValue
// 0x0004
struct FTigerOutfitCustomizationConfigValue
{
	int                                                HoodieIndex;                                               // 0x0000(0x0004) (ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerResponse_GetCharactersForPlayer
// 0x0010 (0x0028 - 0x0018)
struct FTigerResponse_GetCharactersForPlayer : public FTigerResponseEnvelope
{
	TArray<struct FTigerResponse_Character>            Characters;                                                // 0x0018(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterCustomizationOutfitData
// 0x0028
struct FTigerCharacterCustomizationOutfitData
{
	unsigned char                                      ItemClassPath[0x28];                                       // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty

};

// ScriptStruct Tiger.TigerCharacterCustomizationHeadData
// 0x0028
struct FTigerCharacterCustomizationHeadData
{
	unsigned char                                      ItemClassPath[0x28];                                       // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty

};

// ScriptStruct Tiger.TigerCharacterCustomizationItem
// 0x0028
struct FTigerCharacterCustomizationItem
{
	unsigned char                                      ItemClassPath[0x28];                                       // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty

};

// ScriptStruct Tiger.TigerCharacterCardData
// 0x0098
struct FTigerCharacterCardData
{
	unsigned char                                      CharacterIcon[0x28];                                       // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      CharacterCardShape[0x28];                                  // 0x0028(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      CharacterCardBackground[0x28];                             // 0x0050(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      UnknownData_EJOR[0x20];                                    // 0x0078(0x0020) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerCombinedItemCustomizations
// 0x0010
struct FTigerCombinedItemCustomizations
{
	TArray<struct FTigerCharacterCustomizationItem>    CombinedItems;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerMeshData
// 0x0002
struct FTigerMeshData
{
	bool                                               bIsVisibile;                                               // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bVisibilityIsAllowed;                                      // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerStaticMeshData
// 0x0016 (0x0018 - 0x0002)
struct FTigerStaticMeshData : public FTigerMeshData
{
	unsigned char                                      UnknownData_RD4A[0x6];                                     // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UStaticMeshComponent*                        MeshComponent;                                             // 0x0008(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_N7OQ[0x8];                                     // 0x0010(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerPoseableMeshData
// 0x0016 (0x0018 - 0x0002)
struct FTigerPoseableMeshData : public FTigerMeshData
{
	unsigned char                                      UnknownData_MAJT[0x6];                                     // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USkeletalMeshComponent*                      MeshComponent;                                             // 0x0008(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_H38Q[0x8];                                     // 0x0010(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerCharacterMeshData
// 0x0016 (0x0018 - 0x0002)
struct FTigerCharacterMeshData : public FTigerMeshData
{
	unsigned char                                      UnknownData_TJLX[0x6];                                     // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USkeletalMeshComponent*                      MeshComponent;                                             // 0x0008(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                               RegisteredMesh;                                            // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerDeltaCorrectionData
// 0x0040
struct FTigerDeltaCorrectionData
{
	unsigned char                                      UnknownData_93BJ[0x38];                                    // 0x0000(0x0038) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAnimMontage*                                CurrentAnimation;                                          // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPhysicalInteractionDescription
// 0x0030
struct FTigerPhysicalInteractionDescription
{
	class UAnimMontage*                                PrimeStart;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                PrimeMid;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                PrimeEnd;                                                  // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                SecondaryStart;                                            // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                SecondaryMid;                                              // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                SecondaryEnd;                                              // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerPhysicalInteractionMontages
// 0x0060
struct FTigerPhysicalInteractionMontages
{
	struct FTigerPhysicalInteractionDescription        DescriptionByTargetGender[0x2];                            // 0x0000(0x0060) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCharacterPoseableMeshBoneData
// 0x0024
struct FTigerCharacterPoseableMeshBoneData
{
	Tiger_ETigerCharacterMeshPart                      BodyPart;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZXFX[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       ParentBone;                                                // 0x0004(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     RelativeLocation;                                          // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    RelativeRotation;                                          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.ClientSpawnData
// 0x0050
struct FClientSpawnData
{
	uint32_t                                           ClientUid;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UKB6[0x4];                                     // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      SpawnClass;                                                // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                                  Transform;                                                 // 0x0010(0x0030) (IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<unsigned char>                              ClassSpecificData;                                         // 0x0040(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerCurrentContextualHelp
// 0x0018
struct FTigerCurrentContextualHelp
{
	class UTigerContextualHelp*                        ContextualHelp;                                            // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MKUJ[0x10];                                    // 0x0008(0x0010) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.DamageTriggerOverlapData
// 0x0010
struct FDamageTriggerOverlapData
{
	class ATigerCharacter*                             Character;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TimerAccumulator;                                          // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_OXG9[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerItemDatabaseCategory
// 0x0010
struct FTigerItemDatabaseCategory
{
	TArray<struct FTigerItemDatabaseCategoryEntry>     Items;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerItemPreviewCamera
// 0x0018
struct FTigerItemPreviewCamera
{
	class ACineCameraActor*                            CameraActor;                                               // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_I8YP[0x10];                                    // 0x0008(0x0010) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerJudgeRotationSettings
// 0x0008
struct FTigerJudgeRotationSettings
{
	Tiger_ETigerJudgeRotationMode                      RotationMode;                                              // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WOBC[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              RotationSpeed;                                             // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerTimedAnimationTrigger
// 0x0010
struct FTigerTimedAnimationTrigger
{
	struct FName                                       Name;                                                      // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TriggerTime;                                               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Tiger_ETigerTimedAnimationType                     AnimationType;                                             // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_276P[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerTimedAnimationTriggerWrapper
// 0x0018
struct FTigerTimedAnimationTriggerWrapper
{
	TArray<struct FTigerTimedAnimationTrigger>         AnimationTriggers;                                         // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                              ElapsedTime;                                               // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsActive;                                                 // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LQDQ[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerJudgePlayerDamage
// 0x0020
struct FTigerJudgePlayerDamage
{
	class ATigerPlayer*                                Player;                                                    // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                      DamageCollection;                                          // 0x0008(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	float                                              DamageOverLastSecond;                                      // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TotalDamage;                                               // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerVoEvent
// 0x0018
struct FTigerVoEvent
{
	struct FName                                       Category;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      EventActor;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bPlayFacialAnimFromCategory;                               // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GW5J[0x7];                                     // 0x0011(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TigerSeasonConfigResponse_SeasonalChallengeDefinition
// 0x0018
struct FTigerSeasonConfigResponse_SeasonalChallengeDefinition
{
	struct FTigerChallengeInstanceID                   ChallengeInstanceID;                                       // 0x0000(0x0004) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerChallengeTypeID                       ChallengeTypeID;                                           // 0x0004(0x0004) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RewardId;                                                  // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSeasonConfigResponse_ChallengeCollection
// 0x0030
struct FTigerSeasonConfigResponse_ChallengeCollection
{
	TArray<struct FTigerSeasonConfigResponse_SeasonalChallengeDefinition> ChallengeDefinitions;                                      // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FString>                             RewardIds;                                                 // 0x0010(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                                   UnlockDate;                                                // 0x0020(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LockDate;                                                  // 0x0028(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSeasonConfigResponse_RewardTier
// 0x0010
struct FTigerSeasonConfigResponse_RewardTier
{
	TArray<struct FString>                             ItemIds;                                                   // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.DistrictDataAnchor
// 0x0010
struct FDistrictDataAnchor
{
	struct FVector2D                                   WorldPosition;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   MapPosition;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerWallJumpBlendBundle
// 0x0010
struct FTigerWallJumpBlendBundle
{
	float                                              InputBlendScale;                                           // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              NormalBlendScale;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              VelocityDirectionBlendScale;                               // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              VelocityForceScale;                                        // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TutorialTrainerDiablerizeData
// 0x0020
struct FTutorialTrainerDiablerizeData
{
	unsigned char                                      UnknownData_9AOL[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              DiablerizeTimeLeft;                                        // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TimeToGetInPositionforDiablerize;                          // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsGettingDiablerized;                                     // 0x0010(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XCX8[0x3];                                     // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TWeakObjectPtr<class ATigerCharacter>              DiablerizingCharacter;                                     // 0x0014(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7K17[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Tiger.TutorialTrainerReviveData
// 0x0018
struct FTutorialTrainerReviveData
{
	bool                                               bIsGettingRevived;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_L2T3[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              ReviveTimeInSeconds;                                       // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CurrentReviveTime;                                         // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RotationSpeed;                                             // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ATigerPlayer>                 CurrentRevivingPlayer;                                     // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerInputBindings
// 0x0040
struct FTigerInputBindings
{
	TArray<struct FInputActionKeyMapping>              KeyboardMouseMappings;                                     // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInputAxisKeyMapping>                KeyboardMouseAxisMappings;                                 // 0x0010(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInputActionKeyMapping>              GamepadMappings;                                           // 0x0020(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInputAxisKeyMapping>                GamepadAxisMappings;                                       // 0x0030(0x0010) (BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerSensitivitySetting
// 0x0014
struct FTigerSensitivitySetting
{
	float                                              MasterSensitivity;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              HorizontalSensitivity;                                     // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              VerticalSensitivity;                                       // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AimingSensitivity;                                         // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ScopedSensitivity;                                         // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Tiger.TigerControllerSettings
// 0x001C
struct FTigerControllerSettings
{
	int                                                WeaponCyclePreset;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerSensitivitySetting                    SensitivitySettings;                                       // 0x0004(0x0014) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
