#pragma once

// Name: bbbbbbbbbbbbbbbbbbbbbbblod, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function Tiger.TigerBuff.OnDeactivated
struct UTigerBuff_OnDeactivated_Params
{
	class ATigerCharacter*                             InBuffOwner;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerCharacter*                             InBuffCaster;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerBuff.OnActivated
struct UTigerBuff_OnActivated_Params
{
	class ATigerCharacter*                             InBuffOwner;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerCharacter*                             InBuffCaster;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerBuff.FindBuffInstance
struct UTigerBuff_FindBuffInstance_Params
{
	class ATigerCharacter*                             InBuffOwner;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerCharacter*                             InBuffCaster;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerBuffInstance*                          ReturnValue;                                               // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerRebuildableActor.OnRebuild
struct ATigerRebuildableActor_OnRebuild_Params
{
};

// Function Tiger.TigerRebuildableActor.ConvertToBuildComponent
struct ATigerRebuildableActor_ConvertToBuildComponent_Params
{
	class USceneComponent*                             BlueprintCreatedComponent;                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                             ReturnValue;                                               // 0x0008(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerActivatedObject.SetCharacterTriggerComponent
struct ATigerActivatedObject_SetCharacterTriggerComponent_Params
{
	class UShapeComponent*                             TriggerComponent;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerActivatedObject.OnObjectDeactivated
struct ATigerActivatedObject_OnObjectDeactivated_Params
{
};

// Function Tiger.TigerActivatedObject.OnObjectActivated
struct ATigerActivatedObject_OnObjectActivated_Params
{
};

// Function Tiger.TigerActivatedObject.OnEndCharacterOverlap
struct ATigerActivatedObject_OnEndCharacterOverlap_Params
{
	class ATigerCharacter*                             OverlappingCharacter;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TotalOverlapCount;                                         // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerActivatedObject.OnBeginCharacterOverlap
struct ATigerActivatedObject_OnBeginCharacterOverlap_Params
{
	class ATigerCharacter*                             OverlappingCharacter;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TotalOverlapCount;                                         // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerActivatedObject.EndCharacterOverlap
struct ATigerActivatedObject_EndCharacterOverlap_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerActivatedObject.BeginCharacterOverlap
struct ATigerActivatedObject_BeginCharacterOverlap_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFromSweep;                                                // 0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                                  SweepResult;                                               // 0x0020(0x008C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiBaseController.UnregisterMovementTicket
struct ATigerAiBaseController_UnregisterMovementTicket_Params
{
};

// Function Tiger.TigerAiBaseController.PlayAnimationUnreliable
struct ATigerAiBaseController_PlayAnimationUnreliable_Params
{
	class UAnimMontage*                                Animation;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ReturnValue;                                               // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiBaseController.PlayAnimationFromNameUnreliable
struct ATigerAiBaseController_PlayAnimationFromNameUnreliable_Params
{
	struct FName                                       Animation;                                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ReturnValue;                                               // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiBaseController.HasPathToLocation
struct ATigerAiBaseController_HasPathToLocation_Params
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiBaseController.GetSightProperties
struct ATigerAiBaseController_GetSightProperties_Params
{
	Tiger_ETigerNPCType                                NPCType;                                                   // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerSightConfigProperties                 OutSightProps;                                             // 0x0004(0x001C)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0020(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiBaseController.GetSightConfig
struct ATigerAiBaseController_GetSightConfig_Params
{
	class UAISenseConfig_Sight*                        ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiBaseController.GetBaseNpcPawn
struct ATigerAiBaseController_GetBaseNpcPawn_Params
{
	class ATigerBaseNPC*                               ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiBaseController.FindPointOnAiNavMeshWithinExtent
struct ATigerAiBaseController_FindPointOnAiNavMeshWithinExtent_Params
{
	struct FVector                                     Origin;                                                    // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Extent;                                                    // 0x000C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     OutLocation;                                               // 0x0018(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0024(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICAPBase.OnCheckNPCEligibility
struct ATigerAICAPBase_OnCheckNPCEligibility_Params
{
	class ATigerNPC*                                   NPC;                                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICAPBase.CapIsEmpty
struct ATigerAICAPBase_CapIsEmpty_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICAPBase.BeginOverlappedActor
struct ATigerAICAPBase_BeginOverlappedActor_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFromSweep;                                                // 0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                                  SweepResult;                                               // 0x0020(0x008C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICommandBase.DeactivateCommand
struct UTigerAICommandBase_DeactivateCommand_Params
{
	bool                                               bHasFinished;                                              // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICommandComponent.SetContextIdle
struct UTigerAICommandComponent_SetContextIdle_Params
{
	struct FName                                       ContextName;                                               // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICommandComponent.InterruptAndClearCommands
struct UTigerAICommandComponent_InterruptAndClearCommands_Params
{
};

// Function Tiger.TigerAICommandComponent.AddCommand
struct UTigerAICommandComponent_AddCommand_Params
{
	class UTigerAICommandBase*                         Command;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerAICAPBase*                             CommandGiver;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerAICommandBase*                         ReturnValue;                                               // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.SetupData
struct ATigerAIController_SetupData_Params
{
	Tiger_ETigerNPCType                                InNPCType;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.SetNewReactionData
struct ATigerAIController_SetNewReactionData_Params
{
	struct FTigerNpcReactionEvent                      ReactionEvent;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.SetLastReactionData
struct ATigerAIController_SetLastReactionData_Params
{
	struct FTigerNpcReactionEvent                      ReturnValue;                                               // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.SetFearValue
struct ATigerAIController_SetFearValue_Params
{
	float                                              InFearValue;                                               // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.SetCurrentMasqueradeTarget
struct ATigerAIController_SetCurrentMasqueradeTarget_Params
{
	class UBlackboardComponent*                        BBComp;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerCharacter*                             InLookAtTarget;                                            // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.RunDefaultBehavior
struct ATigerAIController_RunDefaultBehavior_Params
{
};

// Function Tiger.TigerAIController.RequestInvestigationTicket
struct ATigerAIController_RequestInvestigationTicket_Params
{
	class ATigerPlayer*                                TigerPlayer;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.IsReacting
struct ATigerAIController_IsReacting_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.GetTigerPawn
struct ATigerAIController_GetTigerPawn_Params
{
	class ATigerNPC*                                   ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.GetMaxFearValue
struct ATigerAIController_GetMaxFearValue_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.GetFearValue
struct ATigerAIController_GetFearValue_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.GetFearPercentage
struct ATigerAIController_GetFearPercentage_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.GetCurrentBehaviorState
struct ATigerAIController_GetCurrentBehaviorState_Params
{
	Tiger_ETigerAIMasqueradeState                      ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.GetActiveCAP
struct ATigerAIController_GetActiveCAP_Params
{
	class ATigerAICAPBase*                             ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.ClearCurrentMasqueradeTarget
struct ATigerAIController_ClearCurrentMasqueradeTarget_Params
{
	class UBlackboardComponent*                        BBComp;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIController.CancelLureBehavior
struct ATigerAIController_CancelLureBehavior_Params
{
};

// Function Tiger.TigerAIController.AdjustFearValue
struct ATigerAIController_AdjustFearValue_Params
{
	float                                              Adjustment;                                                // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICoordinator.SetNPCSightModifier
struct UTigerAICoordinator_SetNPCSightModifier_Params
{
	float                                              Modifier;                                                  // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICoordinator.SetEnableAICoordinator
struct UTigerAICoordinator_SetEnableAICoordinator_Params
{
	bool                                               bEnabled;                                                  // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAICoordinator.CacheFearValueThresholds
struct UTigerAICoordinator_CacheFearValueThresholds_Params
{
	class UTigerFearValueAsset*                        CivFearValueAsset;                                         // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerFearValueAsset*                        PolFearValueAsset;                                         // 0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIGroupCAP.TriggerNextCommandForSlot
struct ATigerAIGroupCAP_TriggerNextCommandForSlot_Params
{
	class ATigerNPC*                                   NPC;                                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CapSlotIndex;                                              // 0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIGroupCAP.OnRequestNewCommands
struct ATigerAIGroupCAP_OnRequestNewCommands_Params
{
	class ATigerNPC*                                   NPC;                                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIGroupCAP.OnIsAvailableCheck
struct ATigerAIGroupCAP_OnIsAvailableCheck_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIGroupCAP.IsSlotAvailable
struct ATigerAIGroupCAP_IsSlotAvailable_Params
{
	int                                                Index;                                                     // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIGroupCAP.GetSlotAssignedToNPC
struct ATigerAIGroupCAP_GetSlotAssignedToNPC_Params
{
	class ATigerNPC*                                   NPC;                                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ReturnValue;                                               // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIGroupCAP.GetNextCommand
struct ATigerAIGroupCAP_GetNextCommand_Params
{
	struct FTigerAiGroupCapSlot                        CapSlot;                                                   // 0x0000(0x0050)  (Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int                                                CapSlotIndex;                                              // 0x0050(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerAICommandBase*                         ReturnValue;                                               // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIGroupCAP.CapCommandStarted
struct ATigerAIGroupCAP_CapCommandStarted_Params
{
	int                                                CapSlotIndex;                                              // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CommandIndex;                                              // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIGroupCAP.AssignNpcToSlot
struct ATigerAIGroupCAP_AssignNpcToSlot_Params
{
	int                                                SlotIndex;                                                 // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerNPC*                                   NPC;                                                       // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiJudgeController.PlayTimedAnimationTriggers
struct ATigerAiJudgeController_PlayTimedAnimationTriggers_Params
{
	TArray<struct FTigerTimedAnimationTrigger>         AnimationTriggers;                                         // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiJudgeController.GetJudgePawn
struct ATigerAiJudgeController_GetJudgePawn_Params
{
	class ATigerJudge*                                 ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiJudgeSmComponent.SwitchToState
struct UTigerAiJudgeSmComponent_SwitchToState_Params
{
	class UClass*                                      NewStateType;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiJudgeSmComponent.AddMasqueradePointsToSeenPlayers
struct UTigerAiJudgeSmComponent_AddMasqueradePointsToSeenPlayers_Params
{
	float                                              AdjustAmount;                                              // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TimeBetweenAddingPoints;                                   // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIPetComponent.HasGotEndPoint
struct UTigerAIPetComponent_HasGotEndPoint_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIPetComponent.GetMasterPlayersStoredPath
struct UTigerAIPetComponent_GetMasterPlayersStoredPath_Params
{
	TArray<struct FVector>                             ReturnValue;                                               // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIPetComponent.GetEndPoint
struct UTigerAIPetComponent_GetEndPoint_Params
{
	struct FVector                                     ReturnValue;                                               // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiPlayerMainStateService.OnPerceptionUpdated
struct UTigerAiPlayerMainStateService_OnPerceptionUpdated_Params
{
	class AActor*                                      InActor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIStimulus                                 InStimulus;                                                // 0x0008(0x003C)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiPlayerMainStateService.OnDiablerizeStateChanged
struct UTigerAiPlayerMainStateService_OnDiablerizeStateChanged_Params
{
	bool                                               InIsDiablerizeActive;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               InIsTarget;                                                // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAIPlayerMoveToTask.OnLifeStatusChanged
struct UTigerAIPlayerMoveToTask_OnLifeStatusChanged_Params
{
	Tiger_ETigerPlayerLifeStatus                       InNewLifeStatus;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAiReloadWeaponTask.OnReloadAborted
struct UTigerAiReloadWeaponTask_OnReloadAborted_Params
{
};

// Function Tiger.TigerAISense_Masquerade.ReportPlayerAction
struct UTigerAISense_Masquerade_ReportPlayerAction_Params
{
	class ATigerPlayer*                                Instigator;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerAIPlayerAction                        PlayerAction;                                              // 0x0008(0x0058)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerNPCSpawningBase.ManuallySpawnNPCs
struct ATigerNPCSpawningBase_ManuallySpawnNPCs_Params
{
	int                                                Budget;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                OverrideSpawnAmount;                                       // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ATigerBaseNPC*>                       ReturnValue;                                               // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimationSetCollection.AddSet
struct UTigerAnimationSetCollection_AddSet_Params
{
	class UTigerAnimationSetAsset*                     Asset;                                                     // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerMontageList.GetRandomMontage
struct UTigerMontageList_GetRandomMontage_Params
{
	class UAnimMontage*                                ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.WeaponTypeBranch
struct UTigerAnimInstance_WeaponTypeBranch_Params
{
	Tiger_ETigerEquippedWeaponType                     WeaponType;                                                // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.UpdateAnimNotifyIKAlphaBlendOnBones
struct UTigerAnimInstance_UpdateAnimNotifyIKAlphaBlendOnBones_Params
{
	float                                              DeltaTime;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.TurnInPlace
struct UTigerAnimInstance_TurnInPlace_Params
{
	bool                                               bInIsStandingOnGround;                                     // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.OnSuccessfulMeleeHit
struct UTigerAnimInstance_OnSuccessfulMeleeHit_Params
{
};

// Function Tiger.TigerAnimInstance.OnSettle
struct UTigerAnimInstance_OnSettle_Params
{
	struct FTigerSettleEvent                           SettleEvent;                                               // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.OnMeleeAttack
struct UTigerAnimInstance_OnMeleeAttack_Params
{
	int                                                InAttackIndex;                                             // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.OnInitiateAnimationBlueprint
struct UTigerAnimInstance_OnInitiateAnimationBlueprint_Params
{
};

// Function Tiger.TigerAnimInstance.OnFootstep
struct UTigerAnimInstance_OnFootstep_Params
{
	bool                                               bIsLeftFoot;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FootstepDuration;                                          // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.OnFiredWeapon
struct UTigerAnimInstance_OnFiredWeapon_Params
{
	bool                                               bInSecondaryWeaponFired;                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.OnChangeAnimationSet
struct UTigerAnimInstance_OnChangeAnimationSet_Params
{
};

// Function Tiger.TigerAnimInstance.IsActiveMontageRootMotion
struct UTigerAnimInstance_IsActiveMontageRootMotion_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetSequence
struct UTigerAnimInstance_GetSequence_Params
{
	struct FName                                       SequenceName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetRandomMontage
struct UTigerAnimInstance_GetRandomMontage_Params
{
	struct FName                                       MontageListName;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetRandomAnimationSequenceList
struct UTigerAnimInstance_GetRandomAnimationSequenceList_Params
{
	struct FName                                       SequenceListName;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerRandomSequenceList*                    ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetPreviousRandomAnimationSequenceList
struct UTigerAnimInstance_GetPreviousRandomAnimationSequenceList_Params
{
	struct FName                                       SequenceListName;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerRandomSequenceList*                    ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetPreviousBlendSpace
struct UTigerAnimInstance_GetPreviousBlendSpace_Params
{
	struct FName                                       BlendSpaceName;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                                 ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetMontage
struct UTigerAnimInstance_GetMontage_Params
{
	struct FName                                       InMontageName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                                ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetFaceAnimSlotsWithActiveCurves
struct UTigerAnimInstance_GetFaceAnimSlotsWithActiveCurves_Params
{
	struct FName                                       OutSlot0;                                                  // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       OutSlot1;                                                  // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       OutSlot2;                                                  // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       OutSlot3;                                                  // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetFaceAnimationForCurve
struct UTigerAnimInstance_GetFaceAnimationForCurve_Params
{
	struct FName                                       CurveName;                                                 // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetBlendSpace1D
struct UTigerAnimInstance_GetBlendSpace1D_Params
{
	struct FName                                       BlendSpace1DName;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace1D*                               ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetBlendSpace
struct UTigerAnimInstance_GetBlendSpace_Params
{
	struct FName                                       BlendSpaceName;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                                 ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetAnimSetAssetFromWeaponClass
struct UTigerAnimInstance_GetAnimSetAssetFromWeaponClass_Params
{
	class UClass*                                      InWeaponClass;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerAnimationSetAsset*                     ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.GetAnimNotifyIKDataForBone
struct UTigerAnimInstance_GetAnimNotifyIKDataForBone_Params
{
	struct FName                                       BoneName;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTigerAnimNotifyIKData                      IKData;                                                    // 0x0008(0x0034)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x003C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.AddSets
struct UTigerAnimInstance_AddSets_Params
{
	class UTigerAnimationSetCollection*                SetCollection;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimInstance.AbortFacialAnimCallback
struct UTigerAnimInstance_AbortFacialAnimCallback_Params
{
};

// Function Tiger.TigerAnimNotify_Footstep.SetData
struct UTigerAnimNotify_Footstep_SetData_Params
{
	bool                                               bIsLeftFootIn;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FootstepDurationIn;                                        // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimNotifyState_CancelReactionIfThreatened.OnReactionCanceled
struct UTigerAnimNotifyState_CancelReactionIfThreatened_OnReactionCanceled_Params
{
	class ATigerNPC*                                   NPC;                                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimNotifyState_HeavyAttackRange.OnChargeUpEnded
struct UTigerAnimNotifyState_HeavyAttackRange_OnChargeUpEnded_Params
{
	class ATigerPlayer*                                Player;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerMeleeWeapon*                           EquippedWeapon;                                            // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ChargeUpRatio;                                             // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimNotifyState_HeavyAttackRange.GetEquippedWeapon
struct UTigerAnimNotifyState_HeavyAttackRange_GetEquippedWeapon_Params
{
	class USkeletalMeshComponent*                      MeshComp;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerMeleeWeapon*                           ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimNotifyState_WeaponGlow.OnWeaponGlowEnd
struct UTigerAnimNotifyState_WeaponGlow_OnWeaponGlowEnd_Params
{
	class USkeletalMeshComponent*                      WeaponMeshComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerMeleeWeaponTrailConfig*                WeaponEffectsConfig;                                       // 0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimNotifyState_WeaponGlow.OnWeaponGlowBegin
struct UTigerAnimNotifyState_WeaponGlow_OnWeaponGlowBegin_Params
{
	class USkeletalMeshComponent*                      WeaponMeshComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerMeleeWeaponTrailConfig*                WeaponEffectsConfig;                                       // 0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimNotifyState_WeaponTrail.OnWeaponTrailsEnd
struct UTigerAnimNotifyState_WeaponTrail_OnWeaponTrailsEnd_Params
{
	class USkeletalMeshComponent*                      WeaponMeshComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*                    TrailParticleSystemComponent;                              // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerCharacter*                             Character;                                                 // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerAnimNotifyState_WeaponTrail.OnWeaponTrailsBegin
struct UTigerAnimNotifyState_WeaponTrail_OnWeaponTrailsBegin_Params
{
	class USkeletalMeshComponent*                      WeaponMeshComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*                    TrailParticleSystemComponent;                              // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATigerCharacter*                             Character;                                                 // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerMeleeWeaponTrailConfig*                WeaponTrailConfig;                                         // 0x0018(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.UpdateScrollOffsetFromGamepadInput
struct UTigerWidget_UpdateScrollOffsetFromGamepadInput_Params
{
	class UScrollBox*                                  ScrollBox;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.ShouldIgnoreVisibilityChanges
struct UTigerWidget_ShouldIgnoreVisibilityChanges_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.ReuseOrCreateNewTooltipWidget
struct UTigerWidget_ReuseOrCreateNewTooltipWidget_Params
{
	class UClass*                                      InTooltipClass;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTigerTooltipWidget*                         ReturnValue;                                               // 0x0008(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.PostAkEvent
struct UTigerWidget_PostAkEvent_Params
{
	class UAkAudioEvent*                               AudioEvent;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.OnPlayerStateReceived
struct UTigerWidget_OnPlayerStateReceived_Params
{
	class ATigerPlayerState*                           InPlayerState;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.IsSharkmobAccountLoginsEnabled
struct UTigerWidget_IsSharkmobAccountLoginsEnabled_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.IncrementCollapseVisibility
struct UTigerWidget_IncrementCollapseVisibility_Params
{
};

// Function Tiger.TigerWidget.GetViewTargetTigerPlayer
struct UTigerWidget_GetViewTargetTigerPlayer_Params
{
	class ATigerPlayer*                                ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerSpectator
struct UTigerWidget_GetTigerSpectator_Params
{
	class ATigerSpectatorPawn*                         ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerPlayerState
struct UTigerWidget_GetTigerPlayerState_Params
{
	class ATigerPlayerState*                           ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerPlayerController
struct UTigerWidget_GetTigerPlayerController_Params
{
	class ATigerPlayerController*                      ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerPlayer
struct UTigerWidget_GetTigerPlayer_Params
{
	class ATigerPlayer*                                ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerPersistentPlayerState
struct UTigerWidget_GetTigerPersistentPlayerState_Params
{
	class UTigerPersistentPlayerState*                 ReturnValue;                                               // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerMatchHUD
struct UTigerWidget_GetTigerMatchHUD_Params
{
	class ATigerMatchHUD*                              ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerMatchGameState
struct UTigerWidget_GetTigerMatchGameState_Params
{
	class ATigerMatchGameState*                        ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerElysiumHUD
struct UTigerWidget_GetTigerElysiumHUD_Params
{
	class ATigerElysiumHUD*                            ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetTigerBaseHUD
struct UTigerWidget_GetTigerBaseHUD_Params
{
	class ATigerHUD*                                   ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetSpectatedTigerPlayer
struct UTigerWidget_GetSpectatedTigerPlayer_Params
{
	class ATigerPlayer*                                ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Tiger.TigerWidget.GetScrollOffsetFromGamepadInput
struct UTigerWidget_GetScrollOffsetFromGamepadInput_Params
{
